Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: ID:32785:V C +O
ta_in: ஐடி: 32785: வி சி +ஓ

source: ID:32793:V C +V
ta_in: ஐடி: 32793: வி சி +வி

source: ID:32794:V C +R
ta_in: ஐடி: 32794: வி சி +ஆர்

source: ID:32796:V C +A
ta_in: ஐடி: 32796: வி சி +அ

source: ID:32809:V C +F
ta_in: ஐடி: 32809: வி சி +எஃப்

source: ID:32811:V C +U
ta_in: ஐடி: 32811: வி சி +யு

source: ID:32814:V C +L
ta_in: ஐடி: 32814: வி சி +எல்

source: ID:32814:VA +D
ta_in: ஐடி: 32814: வா +டி

source: ID:32817:V +W
ta_in: ஐடி: 32817: வி +டபிள்யூ

source: ID:32818:V +H
ta_in: ஐடி: 32818: வி +எச்

source: ID:32819:V +D
ta_in: ஐடி: 32819: வி +டி

source: ID:32824:V C +F
ta_in: ஐடி: 32824: வி சி +எஃப்

source: ID:32825:V C +E
ta_in: ஐடி: 32825: வி சி +இ

source: ID:32825:V C +K
ta_in: ஐடி: 32825: வி சி +கே

source: ID:32825:V C +L
ta_in: ஐடி: 32825: வி சி +எல்

source: ID:32825:VA +D
ta_in: ஐடி: 32825: வா +டி

source: ID:32870:V C +L
ta_in: ஐடி: 32870: வி சி +எல்

source: ID:32880:V C +R
ta_in: ஐடி: 32880: வி சி +ஆர்

source: ID:32880:VAC +C
ta_in: ஐடி: 32880: வெக் +சி

source: ID:32881:V C +P
ta_in: ஐடி: 32881: வி சி +பி

source: ID:32883:V C +A
ta_in: ஐடி: 32883: வி சி +அ

source: ID:32893:V C +G
ta_in: ஐடி: 32893: வி சி +சி

source: ID:32976:V C +E
ta_in: ஐடி: 32976: வி சி +இ

source: ID:57601:V C +O
ta_in: ஐடி: 57601: வி சி +ஓ

source: ID:57603:V C +S
ta_in: ஐடி: 57603: வி சி +எச்

source: ID:57604:V CS+S
ta_in: ஐடி: 57604: வி சிஎச்+எச்

source: ID:57634:V C +C
ta_in: ஐடி: 57634: வி சி +சி

source: ID:57634:V CS+C
ta_in: ஐடி: 57634: வி சிஎச்+சி

source: ID:57635:V C +X
ta_in: ஐடி: 57635: வி சி +எக்ச்

source: ID:57636:V C +F
ta_in: ஐடி: 57636: வி சி +எஃப்

source: ID:57637:V C +V
ta_in: ஐடி: 57637: வி சி +வி

source: ID:57643:V C +Z
ta_in: ஐடி: 57643: வி சி +இசட்

source: ID:57644:V C +Y
ta_in: ஐடி: 57644: வி சி +ஒய்

source: ID:57665:V C +Q
ta_in: ஐடி: 57665: வி சி +கே

source: ID:57665:V C +W
ta_in: ஐடி: 57665: வி சி +டபிள்யூ

source: Icon Overlays
ta_in: படவுரு மேலடுக்குகள்

source: Icon Overlays / Status Columns
ta_in: படவுரு மேலடுக்குகள் / நிலை நெடுவரிசைகள்

source: Icon Set
ta_in: படவுரு தொகுப்பு

source: Icons/Design/Code: Luebbe Onken
ta_in: ஐகான்கள்/வடிவமைப்பு/குறியீடு: லூபே ஓங்கன்

source: If a component (part between two '/') of a given path matches one of these patterns, it is considered a 'branch'.
ta_in: கொடுக்கப்பட்ட பாதையின் ஒரு கூறு (இரண்டு '/' க்கு இடையிலான பகுதி) ஒன்றுடன் பொருந்தினால் இந்த வடிவங்களில், இது ஒரு 'கிளை' என்று கருதப்படுகிறது.

source: If a component (part between two '/') of a given path matches one of these patterns, it is considered a 'tag'.
ta_in: கொடுக்கப்பட்ட பாதையின் ஒரு கூறு (இரண்டு '/' க்கு இடையிலான பகுதி) ஒன்றுடன் பொருந்தினால் இந்த வடிவங்களில், இது ஒரு 'குறிச்சொல்' என்று கருதப்படுகிறது.

source: If a component (part between two '/') of a given path matches one of these patterns, it is considered a 'trunk'.
ta_in: கொடுக்கப்பட்ட பாதையின் ஒரு கூறு (இரண்டு '/' க்கு இடையிலான பகுதி) ஒன்றுடன் பொருந்தினால் இந்த வடிவங்களில், இது ஒரு 'தண்டு' என்று கருதப்படுகிறது.

source: If activated, prevents the overlays and the context menu from showing in 'save as...' or 'open' dialogs
ta_in: செயல்படுத்தப்பட்டால், மேலடுக்குகள் மற்றும் சூழல் மெனுவை 'சேமி ...' அல்லது 'திறந்து' உரையாடல்களில் காண்பிப்பதைத் தடுக்கிறது

source: If activated, the menu entry 'Get Lock' is always shown in the top level menu if the selected file has the svn:needs-lock property set
ta_in: செயல்படுத்தப்பட்டால், பட்டியல் நுழைவு 'கெட் லாக்' எப்போதும் மேல் நிலை பட்டியலில் காட்டப்படும் தேர்ந்தெடுக்கப்பட்ட கோப்பில் எச்.வி.என்: தேவைகள்-லாக் சொத்து தொகுப்பு இருந்தால்

source: If checked, TortoiseSVN creates a temporary file of the BASE to do the diff with the keywords expanded and the line endings adjusted.
ta_in: சரிபார்க்கப்பட்டால், ஆமை விஎன் வேறுபாட்டை செய்ய தளத்தின் தற்காலிக கோப்பை உருவாக்குகிறது முக்கிய வார்த்தைகள் விரிவடைந்து வரி முடிவுகள் சரிசெய்யப்பட்டன.

source: If checked, double-clicking on a revision in the log list compares it with the previous revision
ta_in: சரிபார்க்கப்பட்டால், பதிவு பட்டியலில் ஒரு திருத்தத்தை இருமுறை சொடுக்கு செய்வது முந்தைய திருத்தத்துடன் ஒப்பிடுகிறது

source: If enabled, the Merge dialog initializes the 'From:' URL with the URL of the selected working copy instead of the last used URL.
ta_in: இயக்கப்பட்டால், ஒன்றிணைப்பு உரையாடல் 'இலிருந்து:' முகவரி ஐ தேர்ந்தெடுக்கப்பட்ட வேலை நகலின் முகவரி உடன் துவக்குகிறது கடைசியாக பயன்படுத்தப்பட்ட முகவரி க்கு பதிலாக.

source: If enabled, the repository is contacted when the dialog starts up. You don't have to click on 'Check Repository' anymore.
ta_in: இயக்கப்பட்டால், உரையாடல் தொடங்கும் போது களஞ்சியம் தொடர்பு கொள்ளப்படுகிறது. நீங்கள் இனி 'களஞ்சியத்தை சரிபார்க்கவும்' என்பதைக் சொடுக்கு செய்ய வேண்டியதில்லை.

source: If enabled, working copy folders which are excluded from showing overlays still show the overlay for status 'normal'
ta_in: இயக்கப்பட்டிருந்தால், விலக்கப்பட்ட பணிபுரியும் நகல் கோப்புறைகள் மேலடுக்குகளைக் காண்பிப்பது நிலை 'இயல்பானது' என்று மேலடுக்கைக் காட்டுகிறது

source: If set, TortoiseSVN will set the filetimes to the time they were last committed. If not set, TortoiseSVN uses the current time.
ta_in: அமைக்கப்பட்டால், ஆமை வி.என் அவர்கள் காலங்களில் அவர்கள் நேரத்திற்கு நிர்ணயிக்கும் கடைசியாக உறுதியளித்தனர். அமைக்கப்படாவிட்டால், ஆமை வி.என் தற்போதைய நேரத்தைப் பயன்படுத்துகிறது.

source: If set, files inside unversioned folders can be shown in the status control. The status control is used for example in the commit dialog.
ta_in: அமைக்கப்பட்டால், மாற்றப்படாத கோப்புறைகளுக்குள் உள்ள கோப்புகளை நிலை கட்டுப்பாட்டில் காட்டலாம். நிலை கட்டுப்பாடு எடுத்துக்காட்டாக கமிட் உரையாடலில் பயன்படுத்தப்படுகிறது.

source: If set, then modified files that are in the "ignore-on-commit" changelist do not mark the parent folders as modified i.e., they get the normal icon unless another file or folder is modified.
ta_in: அமைக்கப்பட்டால், "புறக்கணிப்பு-கட்டளை" மாற்றியமைக்கப்பட்ட கோப்புகள் மாற்றியமைக்கப்பட்டபடி பெற்றோர் கோப்புறைகளை குறிக்கவில்லை அதாவது, மற்றொரு கோப்பு அல்லது கோப்புறை மாற்றப்படாவிட்டால் அவை சாதாரண ஐகானைப் பெறுகின்றன.

source: If set, then unversioned files will mark the status of the parent directory as modified i.e. they get the modified overlay icon.
ta_in: அமைக்கப்பட்டால், மாற்றப்படாத கோப்புகள் பெற்றோர் கோப்பகத்தின் நிலையைக் குறிக்கும் அதாவது அவர்கள் மாற்றியமைக்கப்பட்ட மேலடுக்கு ஐகானைப் பெறுகிறார்கள்.

source: If the graph contains multiple trees, separate them by slight variations in background color.
ta_in: வரைபடத்தில் பல மரங்கள் இருந்தால், அவற்றை பின்னணி நிறத்தில் சிறிய மாறுபாடுகளால் பிரிக்கவும்.

source: If the repository can not be contacted
ta_in: களஞ்சியத்தை தொடர்பு கொள்ள முடியாவிட்டால்

source: If you use other SVN clients besides TortoiseSVN on this computer, you have to upgrade those clients too. Otherwise those clients won't be able to access the working copy with the new format.
ta_in: இந்த கணினியில் ஆமை வி.என் தவிர மற்ற எச்.வி.என் வாடிக்கையாளர்களைப் பயன்படுத்தினால், அந்த வாடிக்கையாளர்களையும் மேம்படுத்த வேண்டும். இல்லையெனில் அந்த வாடிக்கையாளர்களால் புதிய வடிவத்துடன் வேலை செய்யும் நகலை அணுக முடியாது.

source: If you want to break the lock, use the 'Check For Modifications' dialog or the repository browser.
ta_in: நீங்கள் பூட்டை உடைக்க விரும்பினால், 'மாற்றங்களைச் சரிபார்க்கவும்' உரையாடல் அல்லது களஞ்சிய உலாவியைப் பயன்படுத்தவும்.

source: Ignore
ta_in: புறக்கணிக்கவும்

source: Ignore %d items by &extension
ta_in: & நீட்டிப்பு மூலம் %d உருப்படிகளை புறக்கணிக்கவும்

source: Ignore &EOL changes
ta_in: புறக்கணிக்கவும் மற்றும் EOL மாற்றங்கள்

source: Ignore &all whitespaces
ta_in: அனைத்து இடைவெளிகளையும் புறக்கணிக்கவும்

source: Ignore &ancestry
ta_in: புறக்கணிக்கவும் & வம்சாவளி

source: Ignore Comments
ta_in: கருத்துகளை புறக்கணிக்கவும்

source: Ignore EOL changes
ta_in: EOL மாற்றங்களை புறக்கணிக்கவும்

source: Ignore all whitespace changes
ta_in: அனைத்து இடைவெளி மாற்றங்களையும் புறக்கணிக்கவும்

source: Ignore case cha&nges
ta_in: வழக்கு சா & என்ச்களை புறக்கணிக்கவும்

source: Ignore changes Ignore the outside changes.
ta_in: மாற்றங்களை புறக்கணிக்கவும் வெளிப்புற மாற்றங்களை புறக்கணிக்கவும்.

source: Ignore comment changes Ignore Comments
ta_in: கருத்து மாற்றங்களை புறக்கணிக்கவும் கருத்துகளை புறக்கணிக்கவும்

source: Ignore comments
ta_in: கருத்துகளை புறக்கணிக்கவும்

source: Ignore line &endings
ta_in: வரி முடிவுகளை புறக்கணிக்கவும்

source: Ignore line &endings (recommended)
ta_in: வரி மற்றும் முடிவுகளை புறக்கணிக்கவும் (பரிந்துரைக்கப்படுகிறது)

source: Ignore multiple items by &extension
ta_in: & நீட்டிப்பு மூலம் பல உருப்படிகளை புறக்கணிக்கவும்

source: Ignore whitespace &changes
ta_in: ஒயிட்ச்பேச் & மாற்றங்களை புறக்கணிக்கவும்

source: Ignore whitespace c&hanges
ta_in: ஒயிட்ச்பேச் சி & ஏங்குகளை புறக்கணிக்கவும்

source: Ignore whitespace changes
ta_in: இடைவெளி மாற்றங்களை புறக்கணிக்கவும்

source: Ignored
ta_in: புறக்கணிக்கப்பட்டது

source: Ignored items included
ta_in: புறக்கணிக்கப்பட்ட உருப்படிகள் சேர்க்கப்பட்டுள்ளன

source: Ignores all whitespace changes when diffing Ignore all whitespace changes
ta_in: பரவும்போது அனைத்து இடைவெளி மாற்றங்களையும் புறக்கணிக்கிறது அனைத்து இடைவெளி மாற்றங்களையும் புறக்கணிக்கவும்

source: Ignores changes in whitespaces when diffing Ignore whitespace changes
ta_in: பரவும்போது இடைவெளிகளில் ஏற்படும் மாற்றங்களை புறக்கணிக்கிறது இடைவெளி மாற்றங்களை புறக்கணிக்கவும்

source: Illegal path
ta_in: சட்டவிரோத பாதை

source: Immediate children, including folders
ta_in: கோப்புறைகள் உட்பட உடனடி குழந்தைகள்

source: Import
ta_in: இறக்குமதி

source: Import %1!ls! to %2!ls!%3!ls!
ta_in: இறக்குமதி %1!ls! to %2!ls!%3!ls!

source: Import %ld items
ta_in: %எல்.டி உருப்படிகளை இறக்குமதி செய்யுங்கள்

source: Import &message
ta_in: இறக்குமதி & செய்தி

source: Import Settings from file...
ta_in: கோப்பிலிருந்து அமைப்புகளை இறக்குமதி செய்யுங்கள் ...

source: Import a previously saved set of properties from a file
ta_in: ஒரு கோப்பிலிருந்து முன்னர் சேமிக்கப்பட்ட பண்புகளின் தொகுப்பை இறக்குமதி செய்க

source: Import file %1!ls! to %2!ls!
ta_in: கோப்பு %1! Ls! பெறுநர் %2! ls!

source: Import file to %ls
ta_in: கோப்பை இறக்குமதி செய்யுங்கள் %ls

source: Import folder %1!ls! to %2!ls!
ta_in: இறக்குமதி கோப்புறை %1! Ls! பெறுநர் %2! ls!

source: Import to %1
ta_in: %1 க்கு இறக்குமதி செய்யுங்கள்

source: Imported folder structure
ta_in: இறக்குமதி செய்யப்பட்ட கோப்புறை அமைப்பு

source: Importing file %1!ls!
ta_in: கோப்பு %1! Ls ஐ இறக்குமதி செய்கிறது!

source: Imports the directory to a repository
ta_in: கோப்பகத்தை ஒரு களஞ்சியத்திற்கு இறக்குமதி செய்கிறது

source: In order to show this dialog in the future, press <Ctrl> while executing the Code Collaborator menu command.
ta_in: எதிர்காலத்தில் இந்த உரையாடலைக் காண்பிப்பதற்காக, குறியீடு கூட்டுறவு பட்டியல் கட்டளையை இயக்கும் போது <ctrl> ஐ அழுத்தவும்.

source: Include e&xternals
ta_in: இ & Xternals ஐ சேர்க்கவும்

source: Include ignored files
ta_in: புறக்கணிக்கப்பட்ட கோப்புகளைச் சேர்க்கவும்

source: Include local settings
ta_in: உள்ளக அமைப்புகளைச் சேர்க்கவும்

source: Include merged revisions
ta_in: இணைக்கப்பட்ட திருத்தங்களை உள்ளடக்கியது

source: Include only the following revision range:
ta_in: பின்வரும் திருத்த வரம்பை மட்டுமே சேர்க்கவும்:

source: Includes the repository for status check Hold down the shift key when clicking to fetch everything.
ta_in: நிலை சோதனைக்கான களஞ்சியத்தை உள்ளடக்கியது எல்லாவற்றையும் பெற சொடுக்கு செய்யும் போது சிப்ட் விசையை அழுத்திப் பிடித்துக் கொள்ளுங்கள்.

source: Incorrect filename.
ta_in: தவறான கோப்பு பெயர்.

source: Index colors:
ta_in: குறியீட்டு நிறங்கள்:

source: Info on external
ta_in: வெளிப்புறம் பற்றிய செய்தி

source: Information
ta_in: செய்தி

source: Inline diff
ta_in: இன்லைன் வேறுபாடு

source: Inline diff word-wise
ta_in: இன்லைன் வேறுபட்ட சொல் வாரியாக

source: Inline differences
ta_in: இன்லைன் வேறுபாடுகள்

source: Input
ta_in: உள்ளீடு

source: Insert Clipboard contents Paste
ta_in: கிளிப்போர்டு உள்ளடக்கங்களை செருகவும் ஒட்டவும்

source: Insert message at:
ta_in: செய்தியை இங்கே செருகவும்:

source: Insert title at the bottom, after the message
ta_in: செய்திக்குப் பிறகு, கீழே தலைப்பை செருகவும்

source: Insufficient memory to perform operation.
ta_in: செயல்பாட்டுக்கு போதுமான நினைவகம் இல்லை.

source: Internal application error.
ta_in: உள் பயன்பாட்டு பிழை.

source: Internal value indicating compression quality
ta_in: சுருக்க தரத்தைக் குறிக்கும் உள் மதிப்பு

source: Invalid Currency.
ta_in: தவறான நாணயம்.

source: Invalid parameters
ta_in: தவறான அளவுருக்கள்

source: Invalid revision number! Valid revisions are: HEAD, BASE, PREV, COMMITTED, WC, positive decimal numbers, dates in one of the following example forms: {2002-02-17} {15:30} {15:30:00.200000} {"2002-02-17 15:30"} {"2002-02-17 15:30 +0230"} {2002-02-17T15:30} {2002-02-17T15:30Z} {2002-02-17T15:30-04:00} {20020217T1530} {20020217T1530Z} {20020217T1530-0500}
ta_in: தவறான திருத்த எண்! செல்லுபடியாகும் திருத்தங்கள்: தலை, அடிப்படை, முந்தைய, உறுதியான, டபிள்யூ.சி, நேர்மறை தசம எண்கள், பின்வரும் எடுத்துக்காட்டு படிவங்களில் ஒன்றில் தேதிகள்: {2002-02-17} {15:30} {15: 30: 00.200000} {"2002-02-17 15:30"} {"2002-02-17 15:30 +0230"} {2002-02-17T15: 30} {2002-02-17T15: 30Z} {2002-02-17T15: 30-04: 00} {20020217T1530} {20020217T1530Z} {20020217T1530-0500}

source: Invalid revision number! Valid revisions are: HEAD positive decimal numbers, dates in one of the following example forms: {2002-02-17} {15:30} {15:30:00.200000} {"2002-02-17 15:30"} {"2002-02-17 15:30 +0230"} {2002-02-17T15:30} {2002-02-17T15:30Z} {2002-02-17T15:30-04:00} {20020217T1530} {20020217T1530Z} {20020217T1530-0500}
ta_in: தவறான திருத்த எண்! செல்லுபடியாகும் திருத்தங்கள்: தலை நேர்மறை தசம எண்கள், பின்வரும் எடுத்துக்காட்டு படிவங்களில் ஒன்றில் தேதிகள்: {2002-02-17} {15:30} {15: 30: 00.200000} {"2002-02-17 15:30"} {"2002-02-17 15:30 +0230"} {2002-02-17T15: 30} {2002-02-17T15: 30Z} {2002-02-17T15: 30-04: 00} {20020217T1530} {20020217T1530Z} {20020217T1530-0500}

source: Invalid revision range! Valid revisions are numbers and HEAD, separated by commas. A range can be specified with a dash. Example: 2-5,7,10,44-70,300-HEAD
ta_in: தவறான திருத்த வரம்பு! செல்லுபடியாகும் திருத்தங்கள் எண்கள் மற்றும் தலை, காற்புள்ளிகளால் பிரிக்கப்படுகின்றன. ஒரு வரம்பை ஒரு கோடு மூலம் குறிப்பிடலாம். எடுத்துக்காட்டு: 2-5,7,10,44-70,300-தலை

source: Issue Tracker Integration
ta_in: டிராக்கர் ஒருங்கிணைப்பை வெளியிடுங்கள்

source: Issue tracker
ta_in: வெளியீடு டிராக்கர்

source: It seems you are trying to relocate your working copy to a different path inside the same repository. From: %1!ls! To: %2!ls! Improper use of relocate will corrupt your working copy!
ta_in: உங்கள் வேலை நகலை ஒரே களஞ்சியத்திற்குள் வேறு பாதைக்கு மாற்ற முயற்சிக்கிறீர்கள் என்று தெரிகிறது. இருந்து: %1! Ls! க்கு: %2! Ls! இடமாற்றத்தின் முறையற்ற பயன்பாடு உங்கள் வேலை நகலை சிதைக்கும்!

source: Items in &externals
ta_in: & வெளிப்புறங்களில் உருப்படிகள்

source: Items to show
ta_in: காட்ட வேண்டிய உருப்படிகள்

source: J&ump to first conflict when loading
ta_in: ஏற்றும்போது முதல் மோதலுக்கு செல்லவும்

source: Join with following &tree
ta_in: பின்வரும் & மரத்துடன் சேரவும்

source: Join with source tree
ta_in: மூல மரத்துடன் சேரவும்

source: Jump to next &conflict
ta_in: அடுத்த மோதலுக்கு செல்லவும்

source: Keep &locks
ta_in: வைத்திருங்கள் & பூட்டுதல்

source: Keep c&hangelists
ta_in: சி & ஏங்கலிச்டுகளை வைத்திருங்கள்

source: Keep resolving Jump to first unresolved conflict
ta_in: தொடர்ந்து தீர்க்க தீர்க்கப்படாத முதல் மோதலுக்கு செல்லவும்

source: Kind
ta_in: வகை

source: L
ta_in: எல்

source: L&imit:
ta_in: &எல்லை

source: Lan&guages
ta_in: &மொழி

source: Language:
ta_in: மொழி:

source: Last changed author:
ta_in: கடைசியாக மாற்றப்பட்ட ஆசிரியர்:

source: Last changed revision:
ta_in: கடைசியாக மாற்றப்பட்ட திருத்தம்:

source: Last saved revision of item
ta_in: கடைசியாக சேமிக்கப்பட்ட உருப்படியை திருத்தம்

source: Last time the cache content was changed
ta_in: கடைசியாக கேச் உள்ளடக்கம் மாற்றப்பட்டது

source: Last time the cache was accessed
ta_in: கடைசியாக தற்காலிக சேமிப்பு அணுகப்பட்டது

source: Last time the repository was asked for the HEAD revision number
ta_in: கடைசியாக களஞ்சியத்திடம் தலை திருத்த எண்ணைக் கேட்கப்பட்டது

source: Launches the external diff / merge program to solve the conflicts
ta_in: மோதல்களைத் தீர்க்க வெளிப்புற வேறுபாடு / ஒன்றிணைக்கும் திட்டத்தை அறிமுகப்படுத்துகிறது

source: Least active author:
ta_in: குறைந்த செயலில் உள்ள ஆசிரியர்:

source: Leave as conflicted The conflict status of the file is kept
ta_in: முரண்பட்டதாக விடுங்கள் கோப்பின் மோதல் நிலை வைக்கப்படுகிறது

source: Leave only marked changes
ta_in: குறிக்கப்பட்ட மாற்றங்களை மட்டுமே விடுங்கள்

source: Leave the box "Path or URL" empty to create a folder item
ta_in: ஒரு கோப்புறை உருப்படியை உருவாக்க "பாதை அல்லது முகவரி" பெட்டியை காலியாக விடவும்

source: Left View:
ta_in: இடது பார்வை:

source: Left image
ta_in: இடது படம்

source: Left local modifications
ta_in: உள்ளக மாற்றங்கள்

source: Like above, but used for reverse merges
ta_in: மேலே உள்ளதைப் போல, ஆனால் தலைகீழ் ஒன்றிணைக்கப் பயன்படுகிறது

source: Line
ta_in: வரி

source: Line Graph
ta_in: வரி வரைபடம்

source: Line diff bar
ta_in: வரி வேறுபாடு பட்டி

source: Line differences
ta_in: வரி வேறுபாடுகள்

source: Line moved from line %ld
ta_in: வரி %எல்.டி.யிலிருந்து வரி நகர்த்தப்பட்டது

source: Line moved to line %ld
ta_in: வரி %எல்.டி.

source: Line:
ta_in: வரி:

source: Line: %*ld
ta_in: வரி: %*ld

source: List Help topics Help Topics
ta_in: பட்டியல் உதவி தலைப்புகள் தலைப்புகளுக்கு உதவுங்கள்

source: List of repositories for which log information has been cached
ta_in: பதிவு செய்தி தற்காலிகமாக சேமிக்கப்பட்ட களஞ்சியங்களின் பட்டியல்

source: Lo&cal path:
ta_in: லோ & கால் பாதை:

source: Load Images
ta_in: படங்களை ஏற்றவும்

source: Load Settings from file
ta_in: கோப்பிலிருந்து அமைப்புகளை ஏற்றவும்

source: Load changes Changes made in TortoiseMerge are lost and replaced with the new content.
ta_in: மாற்றங்களை ஏற்றவும் ஆமைகளில் செய்யப்பட்ட மாற்றங்கள் இழந்து புதிய உள்ளடக்கத்துடன் மாற்றப்படுகின்றன.

source: Load changes The views are updated with the new content.
ta_in: மாற்றங்களை ஏற்றவும் புதிய உள்ளடக்கத்துடன் காட்சிகள் புதுப்பிக்கப்படுகின்றன.

source: Local &Hooks
ta_in: உள்ளக & கொக்கிகள்

source: Local hook scripts
ta_in: உள்ளக ஊக் ச்கிரிப்ட்கள்

source: Location where the contents of the repository URL(s) will be saved to.
ta_in: உள்ளடக்கங்கள் இருக்கும் இடம் களஞ்சிய முகவரி (கள்) சேமிக்கப்படும்.

source: Locator Bar
ta_in: லொக்கேட்டர் பார்

source: Locator bar
ta_in: லொக்கேட்டர் பார்

source: Lock
ta_in: தாழிடு

source: Lock Date
ta_in: பூட்டு தேதி

source: Lock Files
ta_in: கோப்புகளைப் பூட்டவும்

source: Lock broken
ta_in: பூட்டு உடைந்தது

source: Lock broken!
ta_in: பூட்டு உடைந்தது!

source: Lock comment
ta_in: பூட்டு கருத்து

source: Lock creation date:
ta_in: பூட்டு உருவாக்கும் தேதி:

source: Lock failed
ta_in: பூட்டு தோல்வியடைந்தது

source: Lock owner:
ta_in: பூட்டு உரிமையாளர்:

source: Lock stolen by %ls
ta_in: பூட்டு %ls ஆல் திருடப்பட்டது

source: Locked
ta_in: பூட்டப்பட்டுள்ளது

source: Locked by %ls
ta_in: %LS ஆல் பூட்டப்பட்டுள்ளது

source: Locking failed
ta_in: பூட்டுதல் தோல்வியடைந்தது

source: Locking failed because a newer version exists! Do you want to update and try again?
ta_in: புதிய பதிப்பு இருப்பதால் பூட்டுதல் தோல்வியடைந்தது! நீங்கள் புதுப்பித்து மீண்டும் முயற்சிக்க விரும்புகிறீர்களா?

source: Locks a file for other users and makes it editable by you.
ta_in: பிற பயனர்களுக்கான கோப்பைப் பூட்டி, அதை உங்களால் திருத்தலாம்.

source: Log Cache Statistics
ta_in: பதிவு கேச் புள்ளிவிவரங்கள்

source: Log Caching
ta_in: பதிவு கேச்சிங்

source: Log History
ta_in: பதிவு வரலாறு

source: Log Messages
ta_in: பதிவு செய்திகள்

source: Log message
ta_in: பதிவு செய்தி

source: Log message is too short!
ta_in: பதிவு செய்தி மிகக் குறைவு!

source: Log messages
ta_in: பதிவு செய்திகள்

source: Log messages (Input dialog)
ta_in: பதிவு செய்திகள் (உள்ளீட்டு உரையாடல்)

source: Log messages (Show log dialog)
ta_in: பதிவு செய்திகள் (பதிவு உரையாடலைக் காட்டு)

source: Lowest shown revision: %1!ld! - Highest shown revision: %2!ld!
ta_in: குறைந்த காட்டப்பட்ட திருத்தம்: %1! LD! - அதிகபட்சமாகக் காட்டப்பட்ட திருத்தம்: %2! எல்.டி!

source: Lowest shown revision: %1!ld! - Highest shown revision: %2!ld! HEAD revision: %3!ld!
ta_in: மிகக் குறைவான திருத்தம்: %1! LD! - அதிகபட்சமாகக் காட்டப்பட்ட திருத்தம்: %2! எல்.டி! தலை திருத்தம்: %3! எல்.டி!

source: Mail system DLL is invalid.
ta_in: மெயில் சிச்டம் டி.எல்.எல் தவறானது.

source: Main context menu
ta_in: முக்கிய சூழல் பட்டியல்

source: Make this the default
ta_in: இதை இயல்புநிலையாக மாற்றவும்

source: Manage Subversion properties
ta_in: சப்வர்சன் பண்புகளை நிர்வகிக்கவும்

source: Manual Pre-Commit Hook
ta_in: கையேடு முன்-கட்டளை கொக்கி

source: Manual import/export
ta_in: கையேடு இறக்குமதி/ஏற்றுமதி

source: Many items selected to show diff
ta_in: வேறுபாட்டைக் காட்ட தேர்ந்தெடுக்கப்பட்ட பல உருப்படிகள்

source: Mark all projects as read
ta_in: எல்லா திட்டங்களையும் படித்தபடி குறிக்கவும்

source: Mark as &resolved The conflict is resolved.
ta_in: குறிக்கவும் & தீர்க்கப்பட்டது மோதல் தீர்க்கப்படுகிறது.

source: Mark as resolved
ta_in: தீர்க்கப்பட்டபடி குறி

source: Mark as resolved The file status is changed to modified
ta_in: தீர்க்கப்பட்டபடி குறி கோப்பு நிலை மாற்றியமைக்கப்பட்டதாக மாற்றப்பட்டுள்ளது

source: Mark current revision of your working copy
ta_in: உங்கள் வேலை நகலின் தற்போதைய திருத்தத்தைக் குறிக்கவும்

source: Mark for comparison
ta_in: ஒப்பிடுவதற்கு குறி

source: Mark missing files as removed
ta_in: காணாமல் போன கோப்புகளை அகற்றுவதைக் குறிக்கவும்

source: Mark this change
ta_in: இந்த மாற்றத்தைக் குறிக்கவும்

source: Marked Blocks
ta_in: குறிக்கப்பட்ட தொகுதிகள்

source: Marked words: %s
ta_in: குறிக்கப்பட்ட சொற்கள்: %s

source: Markers
ta_in: குறிப்பான்கள்

source: Marks a file as resolved in Subversion Mark as resolved
ta_in: கீழ்ப்படிதலில் தீர்க்கப்பட்ட ஒரு கோப்பைக் குறிக்கிறது தீர்க்கப்பட்டபடி குறி

source: Marks the conflict as resolved. Note: this does not resolve the conflict, only marks it as resolved!
ta_in: தீர்க்கப்பட்ட மோதலை குறிக்கிறது. குறிப்பு: இது மோதலைத் தீர்க்காது, தீர்க்கப்பட்டதாக மட்டுமே குறிக்கிறது!

source: Marks the revisions as merged, without actually doing the merge. This blocks the revisions from getting merged in the future.
ta_in: உண்மையில் ஒன்றிணைக்காமல், திருத்தங்களை ஒன்றிணைத்ததாகக் குறிக்கிறது. இது எதிர்காலத்தில் ஒன்றிணைக்கப்படுவதைத் தடுக்கிறது.

source: Match &case
ta_in: போட்டி & வழக்கு

source: Max
ta_in: அதிகபட்சம்

source: Max. items to keep in the log message history
ta_in: அதிகபட்சம். பதிவு செய்தி வரலாற்றில் வைத்திருக்க வேண்டிய உருப்படிகள்

source: Max. lines in action log
ta_in: அதிகபட்சம். செயல் பதிவில் கோடுகள்

source: Maximum number of tool &failures until cache removal
ta_in: கேச் அகற்றும் வரை அதிகபட்ச கருவி மற்றும் தோல்விகளின் எண்ணிக்கை

source: Merge
ta_in: ஒன்றிணைக்கவும்

source: Merge &depth:
ta_in: ஒன்றிணைத்தல் மற்றும் ஆழம்:

source: Merge Log &Templates
ta_in: பதிவு மற்றும் வார்ப்புருக்கள் ஒன்றிணைக்கவும்

source: Merge Log Templates
ta_in: பதிவு வார்ப்புருக்கள் ஒன்றிணைக்கவும்

source: Merge Reintegrate
ta_in: மீண்டும் ஒன்றிணைக்கவும்

source: Merge Tool
ta_in: கருவியை ஒன்றிணைக்கவும்

source: Merge a &range of revisions
ta_in: திருத்தங்களின் வரம்பை ஒன்றிணைக்கவும்

source: Merge all
ta_in: அனைத்தையும் ஒன்றிணைக்கவும்

source: Merge all...
ta_in: அனைத்தையும் ஒன்றிணைக்கவும் ...

source: Merge changes into the working copy
ta_in: மாற்றங்களை வேலை நகலில் ஒன்றிணைக்கவும்

source: Merge conflict discovered in binary file %s
ta_in: பைனரி கோப்பு %s இல் கண்டுபிடிக்கப்பட்ட மோதலை ஒன்றிணைக்கவும்

source: Merge conflict discovered in file %s
ta_in: கோப்பு %s இல் கண்டுபிடிக்கப்பட்ட மோதலை ஒன்றிணைக்கவும்

source: Merge options
ta_in: விருப்பங்களை ஒன்றிணைக்கவும்

source: Merge revision range
ta_in: திருத்த வரம்பை ஒன்றிணைக்கவும்

source: Merge revision to...
ta_in: திருத்தத்தை ஒன்றிணைக்கவும் ...

source: Merge revisions to...
ta_in: திருத்தங்களை ஒன்றிணைக்கவும் ...

source: Merge two different &trees
ta_in: இரண்டு வெவ்வேறு மற்றும் மரங்களை ஒன்றிணைக்கவும்

source: Merge type
ta_in: வகை ஒன்றிணைக்கவும்

source: Merged
ta_in: ஒன்றிணைந்தது
