Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: max. committed revision
ta_in: அதிகபட்சம். உறுதியான திருத்தம்

source: merged
ta_in: ஒன்றிணைந்தது

source: merges total:
ta_in: மொத்தம் ஒன்றிணைக்கிறது:

source: min. at this revision
ta_in: மணித்துளி. இந்த திருத்தத்தில்

source: min. committed revision
ta_in: மணித்துளி. உறுதியான திருத்தம்

source: missing
ta_in: இல்லை

source: missing / deleted / replaced
ta_in: காணாமல் போன / நீக்கப்பட்டது / மாற்றப்பட்டது

source: missing in:
ta_in: காணவில்லை:

source: modified
ta_in: மாற்றியமைக்கப்பட்ட

source: modified / copied
ta_in: மாற்றியமைக்கப்பட்ட / நகலெடுக்கப்பட்டது

source: month
ta_in: மாதம்

source: months
ta_in: மாதங்கள்

source: no
ta_in: இல்லை

source: no description for this command is available
ta_in: இந்த கட்டளைக்கு எந்த விளக்கமும் கிடைக்கவில்லை

source: non-versioned
ta_in: மாற்றப்படாத

source: non-versioned item
ta_in: மாற்றப்படாத உருப்படி

source: normal
ta_in: இயல்பான

source: obstructed
ta_in: தடைபட்டது

source: offline
ta_in: இணையமில்லாமல்

source: on %1
ta_in: %1 இல்

source: online
ta_in: நிகழ்நிலை

source: pair tokens:
ta_in: இணை டோக்கன்கள்:

source: patched
ta_in: இணைக்கப்பட்டுள்ளது

source: path elements:
ta_in: பாதை கூறுகள்:

source: paths:
ta_in: பாதைகள்:

source: pixels
ta_in: படப்புள்ளிகள்

source: possible or real conflict / obstructed
ta_in: சாத்தியமான அல்லது உண்மையான மோதல் / தடை

source: prn
ta_in: பி.ஆர்.என்

source: quarter of year
ta_in: ஆண்டின் காலாண்டு

source: quarters of year
ta_in: ஆண்டின் காலாண்டுகள்

source: readonly
ta_in: படிக்கமட்டும்

source: relative paths
ta_in: உறவினர் பாதைகள்

source: replaced
ta_in: மாற்றப்பட்டது

source: respecting ancestry
ta_in: வம்சாவளியை மதித்தல்

source: revision %1!ls!-%2!ls!, revision %3!ls!-%4!ls!
ta_in: திருத்தம் %1! ls!- %2! LS !, திருத்தம் %3! LS!- %4! LS!

source: revision count:
ta_in: திருத்த எண்ணிக்கை:

source: revision has already been merged
ta_in: திருத்தம் ஏற்கனவே இணைக்கப்பட்டுள்ளது

source: revisions %1!ls!-%2!ls!, %3!ls!
ta_in: திருத்தங்கள் %1! ls!- %2! LS !, %3! LS!

source: revisions:
ta_in: திருத்தங்கள்:

source: root project
ta_in: ரூட் திட்டம்

source: scanning path:
ta_in: ச்கேனிங் பாதை:

source: skip ranges:
ta_in: வரம்புகளைத் தவிர்க்கவும்:

source: specific r&ange
ta_in: குறிப்பிட்ட ஆர் & ஏஞ்ச்

source: svn:auto-props A list of properties separated by newlines which get applied recursively automatically when adding/importing files. Format: <filemask> = property=value;property=value Example: *.xml = svn:eol-style=native;svn:mime-type=text/xml
ta_in: எச்.வி.என்: ஆட்டோ-ப்ராப்ச் கோப்புகளைச் சேர்க்கும்போது/இறக்குமதி செய்யும் போது தானாகவே மீண்டும் பயன்படுத்தப்படும் புதிய லைன்களால் பிரிக்கப்பட்ட பண்புகளின் பட்டியல். வடிவம்: <filemask> = சொத்து = மதிப்பு; சொத்து = மதிப்பு எடுத்துக்காட்டு:.

source: svn:eol-style
ta_in: எச்.வி.என்: ஈல்-பாணி

source: svn:eol-style One of 'native', 'LF', 'CR', 'CRLF'.
ta_in: எச்.வி.என்: ஈல்-பாணி 'நேட்டிவ்', 'எல்.எஃப்', 'சி.ஆர்', 'சி.ஆர்.எல்.எஃப்'.

source: svn:executable
ta_in: எச்.வி.என்: இயங்கக்கூடியது

source: svn:executable If present, make the file executable. This property cannot be set on a directory. A non-recursive attempt will fail, and a recursive attempt will set the property only on the file children of the directory.
ta_in: எச்.வி.என்: இயங்கக்கூடியது இருந்தால், கோப்பை இயக்கக்கூடியதாக மாற்றவும். இந்த சொத்தை ஒரு கோப்பகத்தில் அமைக்க முடியாது. ஒரு இரகசியமற்ற முயற்சி தோல்வியடையும், மேலும் ஒரு சுழல்நிலை முயற்சி சொத்தின் கோப்பகத்தின் கோப்பில் மட்டுமே சொத்தை அமைக்கும்.

source: svn:externals
ta_in: எச்.வி.என்: வெளிப்புறங்கள்

source: svn:externals A newline separated list of module specifiers, each of which consists of an optional revision, an URL with an optional peg revision and a relative directory path. For example http://example.com/repos/zig foo -r 1234 http://example.com/repos/zag@1234 foo/bar The URLs can either be full URLs or relative. The format for the relative URLs is: ../ relative to the parent directory of the external ^/ relative to the repository root // relative to the URL scheme / relative to the server's hostname
ta_in: எச்.வி.என்: வெளிப்புறங்கள் தொகுதி குறிப்பான்களின் நியூலைன் பிரிக்கப்பட்ட பட்டியல், அவை ஒவ்வொன்றும் உள்ளன ஒரு விருப்ப திருத்தம், விருப்பமான PEG திருத்தம் மற்றும் உறவினர் அடைவு பாதை கொண்ட முகவரி. உதாரணத்திற்கு http://example.com/repos/zig foo -r 1234 http://example.com/repos/zag@1234 foo/bar முகவரி கள் முழு முகவரி கள் அல்லது உறவினர்களாக இருக்கலாம். வடிவமைப்பு தொடர்புடைய முகவரி கள்: ../ வெளிப்புறத்தின் பெற்றோர் கோப்பகத்துடன் தொடர்புடையது ^/ களஞ்சிய மூலத்துடன் தொடர்புடையது // முகவரி திட்டத்துடன் தொடர்புடையது / சேவையகத்தின் ஓச்ட்பெயருடன் தொடர்புடையது

source: svn:global-ignores A newline separated list of file patterns to ignore recursively.
ta_in: எச்.வி.என்: குளோபல்-ஐகிரோர்ச் மீண்டும் புறக்கணிக்க கோப்பு வடிவங்களின் புதிய வரி பிரிக்கப்பட்ட பட்டியல்.

source: svn:ignore A newline separated list of file patterns to ignore.
ta_in: எச்.வி.என்: புறக்கணிக்கவும் புறக்கணிக்க கோப்பு வடிவங்களின் புதிய வரி பிரிக்கப்பட்ட பட்டியல்.

source: svn:keywords
ta_in: எச்.வி.என்: முக்கிய வார்த்தைகள்

source: svn:keywords Keywords to be expanded. Valid keywords are: URL, HeadURL : The URL for the head revision of the object. Author, LastChangedBy : The last person to modify the file. Date, LastChangedDate : The date/time the object was last modified. Rev, LastChangedRevision : The last revision the object changed. Id : A compressed summary of the previous 4 keywords.
ta_in: எச்.வி.என்: முக்கிய வார்த்தைகள் விரிவாக்கப்பட வேண்டிய முக்கிய வார்த்தைகள். செல்லுபடியாகும் சொற்கள்: முகவரி, Headurl: பொருளின் தலை திருத்தத்திற்கான முகவரி. ஆசிரியர், லாச்ட்சாங்க்பி: கோப்பை மாற்றியமைத்த கடைசி நபர். தேதி, லாச்ட்சேங் டேட்: பொருள் கடைசியாக மாற்றப்பட்டது. ரெவ், லாச்ட்சாங்கெட்ரெவிசன்: கடைசி திருத்தம் பொருள் மாற்றப்பட்டது. ஐடி: முந்தைய 4 முக்கிய வார்த்தைகளின் சுருக்கப்பட்ட சுருக்கம்.

source: svn:mergeinfo A newline separated list of merge tracking info. Each line consists of an absolute path followed by a colon and a list of comma separated revision numbers. For example /trunk:123-125,129
ta_in: எச்.வி.என்: மெர்சின்ஃபோ ஒன்றிணைக்கும் கண்காணிப்பு தகவலின் புதிய வரி பிரிக்கப்பட்ட பட்டியல். ஒவ்வொரு வரியும் ஒரு முழுமையானது ஒரு பெருங்குடல் மற்றும் கமா பிரிக்கப்பட்ட திருத்த எண்களின் பட்டியல் தொடர்ந்து பாதை. உதாரணத்திற்கு /டிரங்க்: 123-125,129

source: svn:mime-type
ta_in: எச்.வி.என்: மைம்-வகை

source: svn:mime-type The mime type of the file. Used to determine whether to merge the file, and how to serve it from Apache. A mime type beginning with 'text/' (or an absent mime type) is treated as text. Anything else is treated as binary.
ta_in: எச்.வி.என்: மைம்-வகை கோப்பின் மைம் வகை. கோப்பை ஒன்றிணைக்கலாமா, அப்பாச்சியிலிருந்து அதை எவ்வாறு பரிமாறுவது என்பதை தீர்மானிக்கப் பயன்படுகிறது. 'உரை/' (அல்லது இல்லாத மைம் வகை) உடன் தொடங்கும் ஒரு மைம் வகை உரையாக கருதப்படுகிறது. வேறு எதையும் பைனரி என்று கருதப்படுகிறது.

source: svn:needs-lock
ta_in: எச்.வி.என்: தேவை-லாக்

source: svn:needs-lock Set this to any value (e.g. '*') to enforce locking for this file. The file will be set to read-only when checked out or updated, indicating that a user must acquire a lock on the file before they can edit it and commit changes.
ta_in: எச்.வி.என்: தேவை-லாக் இந்த கோப்பிற்கான பூட்டுதலை செயல்படுத்த எந்த மதிப்புக்கும் (எ.கா. '*') இதை அமைக்கவும். சரிபார்க்கும்போது அல்லது புதுப்பிக்கப்படும் போது கோப்பு படிக்க மட்டும் அமைக்கப்படும், ஒரு பயனர் கோப்பில் ஒரு பூட்டைப் பெற வேண்டும் என்பதைக் குறிக்கிறது அவர்கள் அதைத் திருத்தி மாற்றங்களைச் செய்வதற்கு முன்.

source: switched to %ls
ta_in: மாறியது %ls

source: switched:
ta_in: சுவிட்ச்:

source: tagging externals
ta_in: வெளிப்புறங்களைக் குறிக்கவும்

source: temp. offline
ta_in: தற்காலிக. இணைப்பில்லாத

source: text [token count]:
ta_in: உரை [டோக்கன் எண்ணிக்கை]:

source: the working copy is at this revision
ta_in: வேலை நகல் இந்த திருத்தத்தில் உள்ளது

source: there are conflicting modifications.
ta_in: முரண்பட்ட மாற்றங்கள் உள்ளன.

source: to %1
ta_in: பெறுநர் %1

source: to %1!ls!
ta_in: பெறுநர் %1! ls!

source: tree conflict
ta_in: மர மோதல்

source: tsvn:autoprops A list of properties separated by newlines which get applied automatically when adding/importing files. Format: <filemask> = property=value;property=value Example: *.xml = svn:eol-style=native;svn:mime-type=text/xml
ta_in: டி.எச்.வி.என்: ஆட்டோபிராப்ச் கோப்புகளைச் சேர்க்கும்போது/இறக்குமதி செய்யும் போது தானாகவே பயன்படுத்தப்படும் புதிய லைன்களால் பிரிக்கப்பட்ட பண்புகளின் பட்டியல். வடிவம்: <filemask> = சொத்து = மதிப்பு; சொத்து = மதிப்பு எடுத்துக்காட்டு:.

source: tsvn:lockmsgminsize Minimum size in chars a lock message must have before a lock is allowed.
ta_in: TSVN: Lockmsgminsize ஒரு பூட்டு அனுமதிக்கப்படுவதற்கு முன்பு ஒரு பூட்டு செய்தி இருக்க வேண்டும்.

source: tsvn:logfilelistenglish Set to 'false' if you don't want the list of changed files to be pasted in English in the commit dialog.
ta_in: டி.எச்.வி.என்: logfilelistenglish மாற்றப்பட்ட கோப்புகளின் பட்டியல் ஆங்கிலத்தில் ஒட்டப்படுவதை நீங்கள் விரும்பவில்லை என்றால் 'பொய்' என அமைக்கவும் கமிட் உரையாடலில்.

source: tsvn:logminsize Minimum size in chars a log message must have before a commit is allowed.
ta_in: டி.எச்.வி.என்: logMinsize ஒரு கமிட் அனுமதிக்கப்படுவதற்கு முன்பு ஒரு பதிவு செய்தி இருக்க வேண்டும்.

source: tsvn:logrevregex A regular expression matching revision numbers in a log message
ta_in: டி.எச்.வி.என்: logrevregex ஒரு பதிவு செய்தியில் ஒரு வழக்கமான வெளிப்பாடு பொருந்தக்கூடிய திருத்த எண்கள்

source: tsvn:logsummary A regex string which extracts a summary from a log message in its first group.
ta_in: டி.எச்.வி.என்: பதிவுகள் அதன் முதல் குழுவில் ஒரு பதிவு செய்தியிலிருந்து சுருக்கத்தை பிரித்தெடுக்கும் ஒரு ரீசெக்ச் சரம்.

source: tsvn:logtemplate String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for users to fill in.
ta_in: டி.எச்.வி.என்: லோக்டெம்ப்ளேட் கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப பதிவு செய்தி வார்ப்புருவாக இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplatebranch String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for branch/tags/copies for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplateBranch கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப கிளை/குறிச்சொற்கள்/நகல்களுக்கான பதிவு செய்தி வார்ப்புருவாக இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplatecommit String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for commits for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplateCommit கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்புவதற்கு இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplatedelete String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for deletes for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplatedelete கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப நீக்குவதற்கு இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplateimport String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for imports for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplateimport கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப இறக்குமதிக்கு இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplatelock String which is inserted in the log message boxes in the get-lock dialogs. Use this as a log message template for get-locks for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplatelock கெட்-லாக் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப GET-LOCKS க்கு இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplatemkdir String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for directory creations for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplatemkdir கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப அடைவு படைப்புகளுக்கு இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplatemove String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for moves/renames for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplateMove கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப நகர்வுகள்/மறுபெயரிடுதலுக்கான பதிவு செய்தி வார்ப்புருவாக இதைப் பயன்படுத்தவும்.

source: tsvn:logtemplatepropset String which is inserted in the log message boxes in the commit dialogs. Use this as a log message template for property modifications for users to fill in.
ta_in: டி.எச்.வி.என்: logtemplatepropset கமிட் உரையாடல்களில் பதிவு செய்தி பெட்டிகளில் செருகப்பட்ட சரம். பயனர்கள் நிரப்ப சொத்து மாற்றங்களுக்கான பதிவு செய்தி வார்ப்புருவாக இதைப் பயன்படுத்தவும்.

source: tsvn:logwidthmarker Set this to the number of chars the log message should not exceed its width. A faded line is shown in the commit dialogs at that position. The default is 80 chars.
ta_in: டி.எச்.வி.என்: லோக்விட்மார்க்கர் பதிவு செய்தி அதன் அகலத்தை தாண்டக்கூடாது. அந்த நிலையில் உள்ள கமிட் உரையாடல்களில் ஒரு மங்கலான வரி காட்டப்பட்டுள்ளது. இயல்புநிலை 80 எழுத்துக்கள்.

source: tsvn:projectlanguage Set this to the language number you want your log messages written in. TortoiseSVN will then load the appropriate spell checker module if available.
ta_in: டி.எச்.வி.என்: திட்ட மொழி உங்கள் பதிவு செய்திகளை எழுத விரும்பும் மொழி எண்ணுக்கு இதை அமைக்கவும். ஆமை வி.என் பின்னர் கிடைத்தால் பொருத்தமான எழுத்துப்பிழை சரிபார்ப்பு தொகுதியை ஏற்றும்.

source: tsvn:warnifnoissue Set to 'yes' if a warning shall be shown when no issue is entered in the commit dialog.
ta_in: டி.எச்.வி.என்: வார்னிஃப்னோயிச்யூ கமிட் உரையாடலில் எந்த சிக்கலும் உள்ளிடப்படாதபோது எச்சரிக்கை காட்டப்பட்டால் 'ஆம்' என அமைக்கவும்.

source: user revprops total:
ta_in: பயனர் ரிவிராப்ச் மொத்தம்:

source: user:bool
ta_in: பயனர்: பூல்

source: user:multiline
ta_in: பயனர்: மல்டிலைன்

source: user:singleline
ta_in: பயனர்: ஒற்றை

source: user:state
ta_in: பயனர்: மாநிலம்

source: values are different
ta_in: மதிப்புகள் வேறுபட்டவை

source: webviewer:pathrevision URL pointing to the web viewer for the repository for a specific file and revision. The string %REVISION% in the URL is replaced with the revision number, the string %PATH% is replaced with the path to the file relative to the repository root.
ta_in: வெப்வியூவர்: பாத்ரெவிசன் ஒரு குறிப்பிட்ட கோப்பு மற்றும் திருத்தத்திற்கான களஞ்சியத்திற்கான வலை பார்வையாளரை முகவரி சுட்டிக்காட்டுகிறது. முகவரி இல் உள்ள சரம் %REVISION% திருத்த எண்ணுடன் மாற்றப்படுகிறது, சரம் % பாதை % களஞ்சிய மூலத்துடன் தொடர்புடைய கோப்பிற்கான பாதையுடன் மாற்றப்படுகிறது.

source: webviewer:revision URL pointing to the web viewer for the repository for a specific revision. The string %REVISION% in that URL is replaced with the revision number.
ta_in: வெப்வியூவர்: திருத்தம் ஒரு குறிப்பிட்ட திருத்தத்திற்கான களஞ்சியத்திற்கான வலை பார்வையாளரை முகவரி சுட்டிக்காட்டுகிறது. அந்த முகவரி இல் உள்ள சரம் %REVISION% திருத்த எண்ணுடன் மாற்றப்படுகிறது.

source: week
ta_in: வாரம்

source: weeks
ta_in: வாரங்கள்

source: word tokens:
ta_in: சொல் டோக்கன்கள்:

source: words [uncompressed]:
ta_in: சொற்கள் [சுருக்கப்படாத]:

source: year
ta_in: ஆண்டு

source: years
ta_in: ஆண்டுகள்

source: yes
ta_in: ஆம்
