Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: # authors shown individually:
ta_in: # ஆசிரியர்கள் தனித்தனியாக காட்டப்பட்டுள்ளது:

source: %.2f MBytes transferred
ta_in: %.2f ெமகா ைபட்டுகள் அனுப்பப்பட்டது

source: %.2f kBytes/s
ta_in: %.2f கிேலா ைபட்டுகள்

source: %1 contained an unexpected object.
ta_in: %1 எதிர்பாராத object-கைள ெகாண்டிருந்தது

source: %1 contains an incorrect path.
ta_in: %1 தவறான பாைதைய ெகாண்டுள்ளது

source: %1 contains an incorrect schema.
ta_in: %1 தவறான schema-ைவ ெகாண்டுள்ளது

source: %1 has a bad format.
ta_in: %1 bad format-ஐ ெகாண்டுள்ளது

source: %1 was not found.
ta_in: %1 இல்ைல

source: %1!d! files selected, %2!d! files total
ta_in: %1!d! files ேதர்வு ெசய்யப்பட்டுள்ளது , %2!d! files ெமாத்தம்

source: %1!d! most active author(s) with at least %2!d! commits each (%3!d! %%)
ta_in: %1! டி! குறைந்தது %2! டி உடன் மிகவும் செயலில் உள்ள ஆசிரியர் (கள்)! ஒவ்வொன்றையும் (%3! டி! %%)

source: %1!ld! minute(s) and %2!ld! second(s)
ta_in: %1!ld! நிமிடங்(கள்) மற்றும் %2!ld! விநாடி(கள்)

source: %1!ls! (offline)
ta_in: %1!ls! (ஆஃப்லைன்)

source: %1!ls! - at revision: %2!d!
ta_in: %1!ls! - திருத்தம்: %2!d!

source: %1!ls! : Working Base, Revision %2!ld!
ta_in: %1!ls! : அடிப்படை வேலை, திருத்தம் %2!ld!

source: %1!ls! from %2!ls!
ta_in: %1! Ls! %2! LS!

source: %1!ls! in %2!ls!
ta_in: %2!ls! இல் %1!ls!

source: %1!ls!\%2!ls! - Export
ta_in: %1!ls!\%2!ls! - ஏற்றுமதி

source: %1!ls!\%2!ls! - Export (%3!d!)
ta_in: %1!ls!\%2!ls! - ஏற்றுமதி (%3!d!)

source: %1!ls! Revision %2!ls!, Author %3!ls!, Date %4!ls!
ta_in: %1!ls! திருத்தம் %2!ls!, ஆசிரியர் %3!ls!, தேதி %4!ls!

source: %1!ls! Revision %2!ls!, Author %3!ls!, Size %4!ls!, Date %5!ls!
ta_in: %1!ls! திருத்தம் %2!ls!, ஆசிரியர் %3!ls!, அளவு %4!ls!, தேதி %5!ls!

source: %1!ls! Showing %2!d! files and %3!d! folders, %4!d! items in total
ta_in: %1! Ls! %2! டி ஐக் காட்டுகிறது! கோப்புகள் மற்றும் %3! டி! கோப்புறைகள், %4! டி! மொத்தம்

source: %1: %2 Continue running script?
ta_in: %1: %2 ஸ்கிரிப்ட் runஆவது தொடரலாமா?

source: %1 Cannot find this file. Verify that the correct path and file name are given.
ta_in: %1 இந்த கோப்பை கண்டுபிடிக்க முடியவில்லை. சரியான பாதை மற்றும் கோப்பு பெயர் வழங்கப்பட்டதா என்று சரிபார்க்கவும்.

source: %I64d Bytes transferred
ta_in: %I64d பைட்டுகள் transfer செய்யப்பட்டது

source: %I64d Bytes/s
ta_in: %I64d பைட்டு/கள்

source: %I64d kBytes transferred
ta_in: %I64d கிலோபைட்கள் transfer செய்யப்பட்டது

source: %Ts [Recovered]
ta_in: %Ts [மீட்கப்பட்டது]

source: %d files
ta_in: %d கோப்புகள்

source: %d projects have updates:
ta_in: %d திட்டங்களுக்கு புதுப்பிப்புகள் உள்ளன:

source: %i%% alpha click to toggle alpha double click to automatically toggle alpha
ta_in: %i %% ஆல்பா ஆல்பாவை மாற்ற சொடுக்கு செய்க ஆல்பாவை தானாக மாற்ற இருமுறை சொடுக்கு செய்யவும்

source: %ld of %ld
ta_in: %ld உடைய/இல் %ld

source: %ld paths
ta_in: %ld பாதைகள்

source: %ls (offline)
ta_in: %எல்.எச் (ஆஃப்லைன்)

source: %ls (recursively)
ta_in: %ls (மீண்டும்)

source: %ls : Merged file
ta_in: %ls : இணைக்கப்பட்ட கோப்பு

source: %ls : Remote file
ta_in: %ls : தூரத்திலுள்ள கோப்பு

source: %ls : Working Base
ta_in: %ls : அடிப்படை வேலை

source: %ls : Working Copy
ta_in: %ls : நகல் வேலை

source: %ls %ld failed hunk(s)
ta_in: %ls %எல்.டி தோல்வியுற்றது அங்க் (கள்)

source: %ls Do you want to remove the %d files anyway?
ta_in: %ls எப்படியும் %d கோப்புகளை அகற்ற விரும்புகிறீர்களா?

source: %ls Do you want to remove the file '%ls' anyway?
ta_in: %ls எப்படியும் '%ls' கோப்பை அகற்ற விரும்புகிறீர்களா?

source: %ls The folder %ls contains unversioned and/or modified file(s). Do you want to remove it anyway?
ta_in: %ls கோப்புறை %ls மாற்றப்படாத மற்றும்/அல்லது மாற்றியமைக்கப்பட்ட கோப்பு (கள்) உள்ளன. எப்படியும் அதை அகற்ற விரும்புகிறீர்களா?

source: %ls is a directory, not a file! TortoiseMerge can't diff directories.
ta_in: %ls ஒரு directoryயே தவிர, file அல்ல! TortoiseMerge-இனால் directories வேறுபாடு செய்ய முடியாது.

source: &Abort You can fix the reason the hook script failed first.
ta_in: & கருக்கலைப்பு ஊக் ச்கிரிப்ட் முதலில் தோல்வியடைந்த காரணத்தை நீங்கள் சரிசெய்யலாம்.

source: &About TortoiseMerge...
ta_in: &TortoiseMerge பற்றி...

source: &Accept the certificate The certificate is accepted only this one time.
ta_in: & சான்றிதழை ஏற்றுக்கொள்ளுங்கள் சான்றிதழ் இந்த ஒரு முறை மட்டுமே ஏற்றுக்கொள்ளப்படுகிறது.

source: &Add
ta_in: &சேர்

source: &Add Filter
ta_in: &Filter-ஐ சேர்

source: &Add item This will lead to problems on Windows.
ta_in: & உருப்படியைச் சேர்க்கவும் இது சாளரங்களில் சிக்கல்களுக்கு வழிவகுக்கும்.

source: &Add...
ta_in: &சேர்...

source: &Advanced...
ta_in: &மேம்பட்ட...

source: &All
ta_in: &முழுவதும்

source: &Allow ambiguous URLs
ta_in: &தெளிவற்ற URL-களை இசைவு

source: &Apply
ta_in: & விண்ணப்பிக்கவும்

source: &Apply property recursively
ta_in: &மீண்டும் property-ஐ apply செய்

source: &Apply unified diff
ta_in: &ஒருங்கிணைக்கப்பட்ட வேறுபாட்டை apply செய்

source: &Autoclose:
ta_in: &தானாகமூடு;

source: &Backup original file
ta_in: & காப்புப்பிரதி அசல் கோப்பு

source: &Binary
ta_in: & பைனரி

source: &Blame changes
ta_in: & குற்றச்சாட்டு மாற்றங்கள்

source: &Blame changes in revisions
ta_in: திருத்தத்தில் மாற்றங்களை குறை கூறுங்கள்

source: &Blame previous revision
ta_in: & முந்தைய திருத்தத்தை குற்றம் சாட்டுங்கள்

source: &Blame...
ta_in: & பழி ...

source: &Border:
ta_in: & எல்லை:

source: &Bottom
ta_in: &கீழே

source: &Branches
ta_in: &கிளைகள்

source: &Break write locks
ta_in: எழுதும் பூட்டுகளை உடைக்கவும்

source: &Browse repository
ta_in: &தொகுபதிவகத்தில் உலவு

source: &Browse...
ta_in: &உலவு...

source: &Bugtraq (Issue tracker integration)
ta_in: & Bugtraq (வெளியீடு டிராக்கர் ஒருங்கிணைப்பு)

source: &CD-ROM
ta_in: சிடிரோம்

source: &Cancel
ta_in: &ரத்துசெய்

source: &Cancel Choose a different folder to export to
ta_in: & ரத்துசெய் ஏற்றுமதி செய்ய வேறு கோப்புறையைத் தேர்வுசெய்க

source: &Cancel Do not commit to a tag.
ta_in: & ரத்துசெய் ஒரு குறிச்சொல்லில் ஈடுபட வேண்டாம்.

source: &Cancel Do not remove
ta_in: & ரத்துசெய் அகற்ற வேண்டாம்

source: &Cancel Do not revert.
ta_in: & ரத்துசெய் மாற்றியமைக்க வேண்டாம்.

source: &Cancel Do not update the working copy.
ta_in: & ரத்துசெய் வேலை நகலை புதுப்பிக்க வேண்டாம்.

source: &Cancel Don't resolve the item.
ta_in: & ரத்துசெய் உருப்படியை தீர்க்க வேண்டாம்.

source: &Cancel Don't show the diff.
ta_in: & ரத்துசெய் வேறுபாட்டைக் காட்ட வேண்டாம்.

source: &Cancel Go back and enter an issue number.
ta_in: & ரத்துசெய் திரும்பிச் சென்று வெளியீட்டு எண்ணை உள்ளிடவும்.

source: &Cancel Go back and select a different folder.
ta_in: & ரத்துசெய் திரும்பிச் சென்று வேறு கோப்புறையைத் தேர்ந்தெடுக்கவும்.

source: &Cancel I will enter a different path/URL.
ta_in: & ரத்துசெய் நான் வேறு பாதை/URL ஐ உள்ளிடுவேன்.

source: &Cancel Keep the current URL.
ta_in: & ரத்துசெய் தற்போதைய முகவரி ஐ வைத்திருங்கள்.

source: &Cancel Leave the cache on disk.
ta_in: & ரத்துசெய் தற்காலிக சேமிப்பை வட்டில் விடுங்கள்.

source: &Cancel Local modifications are kept.
ta_in: & ரத்துசெய் உள்ளக மாற்றங்கள் வைக்கப்படுகின்றன.

source: &Cancel The conflict is not resolved.
ta_in: & ரத்துசெய் மோதல் தீர்க்கப்படவில்லை.

source: &Cancel The file is not copied.
ta_in: & ரத்துசெய் கோப்பு நகலெடுக்கப்படவில்லை.

source: &Cancel The folder is not exported.
ta_in: & ரத்துசெய் கோப்புறை ஏற்றுமதி செய்யப்படவில்லை.

source: &Cancel The items are not imported.
ta_in: & ரத்துசெய் உருப்படிகள் இறக்குமதி செய்யப்படவில்லை.

source: &Cancel The tagged revision of the external is left as is.
ta_in: & ரத்துசெய் வெளிப்புறத்தின் குறிக்கப்பட்ட திருத்தம் உள்ளது.

source: &Cancel The target file is left as is
ta_in: & ரத்துசெய் இலக்கு கோப்பு உள்ளது

source: &Cancel You have to add the folder manually.
ta_in: & ரத்துசெய் நீங்கள் கோப்புறையை கைமுறையாக சேர்க்க வேண்டும்.

source: &Cancel You have to run an update yourself to get the externals
ta_in: & ரத்துசெய் வெளிப்புறங்களைப் பெற நீங்கள் ஒரு புதுப்பிப்பை நீங்களே இயக்க வேண்டும்

source: &Cancel keep the current format.
ta_in: & ரத்துசெய் தற்போதைய வடிவமைப்பை வைத்திருங்கள்.

source: &Checkpoint
ta_in: & சோதனைச் சாவடி

source: &Choose items...
ta_in: &பொருட்களை தேர்வு...

source: &Clean up working copy status
ta_in: வேலை நகல் நிலையை தூய்மை செய்யுங்கள்

source: &Clean up...
ta_in: தூய்மை செய்...

source: &Clear Changelists
ta_in: & தெளிவான சேஞ்சலிச்டுகள்

source: &Close
ta_in: &மூடு

source: &Collaborator username
ta_in: & ஒத்துழைப்பாளர் பயனர்பெயர்

source: &Commit
ta_in: & கமிட்

source: &Commit...
ta_in: &Commit செய்...

source: &Compare URLs
ta_in: &URL கள் ஒப்பிட்டு

source: &Compare revisions
ta_in: &மீள்திருத்தங்களை ஒப்பிடவும்

source: &Compare whitespaces
ta_in: & வைட்ச்பேச்களை ஒப்பிடுக

source: &Configure
ta_in: &கட்டமைக்க

source: &Contact the repository on startup
ta_in: & தொடக்கத்தில் களஞ்சியத்தை தொடர்பு கொள்ளவும்

source: &Convert files when diffing against BASE
ta_in: & தளத்திற்கு எதிராக பரவும்போது கோப்புகளை மாற்றவும்

source: &Copy
ta_in: &நகலெடு

source: &Copy log message to clipboard
ta_in: & கிளிப்போர்டுக்கு பதிவு செய்தியை நகலெடுக்கவும்

source: &Copy to clipboard
ta_in: &கிளிப்போர்டுக்கு நகலெடு

source: &Copy to...
ta_in: &நகலெடு ...

source: &Create folder structure
ta_in: &Folder அமைப்பை உருவாக்க

source: &Custom
ta_in: & தனிப்பயன்

source: &Dark Mode
ta_in: இருண்ட முறை

source: &Dark Mode (D)
ta_in: இருண்ட முறை (ஈ)

source: &Date
ta_in: &தேதி

source: &Days of inactivity until small caches get removed
ta_in: &செயல்படாமல் இருக்கும் நாட்களில் சிறிய இடைமாற்றுகள் நீக்கப்படும் வரை

source: &Default
ta_in: &இயல்புநிலை

source: &Delete
ta_in: &நீக்கு

source: &Delete (keep local)
ta_in: &நீக்கு (keep local)

source: &Delete Filter
ta_in: &Filter நீக்கு

source: &Delete unversioned items...
ta_in: &Unversioned நீக்கு ...

source: &Delete...
ta_in: &நீக்கு...

source: &Delete Remove the cache files.
ta_in: &அழி கேச் கோப்புகளை அகற்றவும்.

source: &Diff
ta_in: &வேறுபாடு

source: &Diff with URL
ta_in: &URL மூலமாகவும் வேறுபாடு

source: &Diff with previous version
ta_in: &முந்தைய பதிப்பில் வேறுபாடு

source: &Directories
ta_in: &அடைவுகள்

source: &Do not ask again
ta_in: &மீண்டும் கேட்காதே

source: &Don't run Do not run the script
ta_in: & ஓட வேண்டாம் ச்கிரிப்டை இயக்க வேண்டாம்

source: &Edit
ta_in: &தொகு

source: &Edit Filter
ta_in: &Filter-ஐ தொகு

source: &Edit conflicts
ta_in: &தொகு முரண்பாடுகள்

source: &Edit project
ta_in: &தொகு திட்டம்

source: &Edit...
ta_in: &தொகு...

source: &Empty the recycle bin now
ta_in: & மறுசுழற்சி தொட்டியை இப்போது வெறுமை செய்யுங்கள்

source: &Enable Proxy Server
ta_in: & பதிலாள் சேவையகத்தை இயக்கவும்

source: &Enable edit
ta_in: &Edit-ஐ இயலச்செய்

source: &Enable log caching
ta_in: & பதிவு கேச்சிங்கை இயக்கவும்

source: &Enter a message describing why you are locking the file(s).
ta_in: & நீங்கள் ஏன் கோப்பை (களை) பூட்டுகிறீர்கள் என்பதை விவரிக்கும் செய்தியை உள்ளிடவும்.

source: &Executable
ta_in: &இயங்கக்கூடிய

source: &Exit
ta_in: &வெளியேறு

source: &Export selection to...
ta_in: & ஏற்றுமதி தேர்வு ...

source: &Export Export into the non-empty folder.
ta_in: & ஏற்றுமதி காலியாக இல்லாத கோப்புறையில் ஏற்றுமதி செய்யுங்கள்.

source: &External
ta_in: &புறம்பான

source: &File
ta_in: &கோப்பு

source: &Files
ta_in: &கோப்புகள்

source: &Filter
ta_in: &வடிகட்டு

source: &Find
ta_in: &தேடு

source: &Find... (Ctrl+F)
ta_in: &தேடு... (Ctrl+F)

source: &Fit images in window (F)
ta_in: சாளரங்களில் (எஃப்) பொருத்தப் படம்

source: &Fix time stamps
ta_in: & நேர முத்திரைகளை சரிசெய்யவும்

source: &Fixed drives
ta_in: & நிலையான இயக்கிகள்

source: &Font for log messages:
ta_in: பதிவு செய்திகளுக்கான எழுத்துரு:

source: &Font:
ta_in: & எழுத்துரு:

source: &From URL:
ta_in: &URL- இருந்து:

source: &From WC / URL:
ta_in: &WC / URL- இருந்து:

source: &From revision
ta_in: &மீள்திருத்தத்தை இருந்து

source: &From: (start URL and revision of the range to merge)
ta_in: & இருந்து: (URL ஐத் தொடங்கவும், வரம்பை ஒன்றிணைக்கவும்)

source: &Go To Line... (Ctrl+G)
ta_in: வரிக்குச் செல்லுங்கள் ... (ctrl+g)

source: &Group by branch
ta_in: &கிளை குழு

source: &HEAD Revision
ta_in: & தலை திருத்தம்

source: &HEAD revision
ta_in: & தலை திருத்தம்

source: &HEAD revision in the repository
ta_in: & களஞ்சியத்தில் தலை திருத்தம்

source: &Help
ta_in: &உதவி

source: &Help Topics
ta_in: &உதவி தலைப்புகள்

source: &Hide
ta_in: &மறை

source: &Hide ignored items
ta_in: புறக்கணிக்கப்பட்ட பொருட்களை மறைக்கவும்

source: &Hide/Show the patch file list
ta_in: & ஒட்டு கோப்பு பட்டியலை மறைக்க/காட்டு

source: &Icon Set:
ta_in: & படவுரு தொகுப்பு:

source: &Ignore %d items by name
ta_in: & பெயரால் %d உருப்படிகளை புறக்கணிக்கவும்

source: &Ignore ancestry
ta_in: & வம்சாவளியை புறக்கணிக்கவும்

source: &Ignore and proceed
ta_in: & புறக்கணித்து தொடரவும்

source: &Ignore multiple items by name
ta_in: & பல உருப்படிகளை பெயரால் புறக்கணிக்கவும்

source: &Image info (I)
ta_in: &உருவக தகவல் (I)

source: &Import...
ta_in: &இறக்குமதி...

source: &Import The items are imported, creating a new revision for each item.
ta_in: & இறக்குமதி உருப்படிகள் இறக்குமதி செய்யப்படுகின்றன, ஒவ்வொரு பொருளுக்கும் புதிய திருத்தத்தை உருவாக்குகின்றன.

source: &Include externals
ta_in: & வெளிப்புறங்களைச் சேர்க்கவும்

source: &Include merge info
ta_in: & ஒன்றிணைக்கும் தகவலைச் சேர்க்கவும்

source: &Join all
ta_in: &அனைத்து சேர

source: &Join with sub-trees
ta_in: & துணை மரங்களுடன் சேரவும்

source: &Jump to first difference when loading
ta_in: ஏற்றும்போது முதல் வித்தியாசத்திற்கு செல்லவும்

source: &Keywords
ta_in: &சிறப்புச் சொற்கள்

source: &Language:
ta_in: &மொழி:

source: &Limit search to modified lines
ta_in: & மாற்றியமைக்கப்பட்ட வரிகளுக்கு தேடலை கட்டுப்படுத்துங்கள்

source: &Limit:
ta_in: &வரம்பு:

source: &Line number
ta_in: &வரிசை எண்

source: &Line number (%d - %d)
ta_in: &வரிசை எண் (%d - %d)

source: &Link image positions
ta_in: இணைப்பு பட நிலை

source: &Linux (LF)
ta_in: &லினக்ச்(LF)

source: &List View
ta_in: & பட்டியல் பார்வை

source: &Load...
ta_in: &சுமை...

source: &Locking required (read-only update)
ta_in: & பூட்டுதல் தேவை (படிக்க மட்டும் புதுப்பிப்பு)

source: &Log Sizes
ta_in: பதிவு அளவு

source: &Log message:
ta_in: & பதிவு செய்தி:

source: &Mac (CR)
ta_in: & மேக் (சி.ஆர்)

source: &Make depth sticky
ta_in: & ஆழம் ஒட்டும்

source: &Max line length for inline diffs
ta_in: இன்லைன் வேறுபாட்டிற்கான அதிகபட்ச வரி நீளம்

source: &Maximum size [kByte] of a removed inactive cache
ta_in: அகற்றப்பட்ட செயலற்ற தற்காலிக சேமிப்பின் அதிகபட்ச அளவு [KByte]

source: &Merge
ta_in: &இணை

source: &Merge paths
ta_in: &பாதைகள் இணை

source: &Merge...
ta_in: &இணை...

source: &Merging
ta_in: &இணைத்தல்

source: &Mime-Type
ta_in: & மைம்-வகை

source: &Modify color for tag copies
ta_in: குறிச்சொல் நகலுக்கான வண்ணத்தை மாற்றவும்

source: &Modify color for trunk copies
ta_in: மற்றும் டிரங்க் நகல்களுக்கான வண்ணத்தை மாற்றவும்

source: &Moved blocks
ta_in: & நகர்த்தப்பட்ட தொகுதிகள்

source: &Name
ta_in: & பெயர்

source: &Navigate
ta_in: & செல்லவும்

source: &Network drives
ta_in: பிணையம் இயக்கிகள்

source: &New
ta_in: &புதிய

source: &New...
ta_in: &புதிய...

source: &Next %ld
ta_in: &அடுத்து %ld

source: &Next >
ta_in: &அடுத்து >

source: &Next Page
ta_in: &அடுத்த பக்கம்

source: &No locking required
ta_in: பூட்டுதல் தேவையில்லை

source: &None
ta_in: &எதுவுமில்லை

source: &Not executable
ta_in: & இயங்கக்கூடியது அல்ல

source: &Numeric
ta_in: &எண்

source: &OK
ta_in: &சரி

source: &Offline for now
ta_in: &இப்போது இணைப்பில்லாத

source: &One Page
ta_in: &ஒரு பக்கம்

source: &Open
ta_in: &திற

source: &Open (Ctrl+O)
ta_in: &திற (Ctrl+O)

source: &Operative:
ta_in: & செயல்பாட்டு:

source: &Options
ta_in: &விருப்பங்கள்

source: &Other
ta_in: &வேறு

source: &Overlay images (O)
ta_in: & மேலடுக்கு படங்கள் (ஓ)

source: &Overwrite Replace the target folder.
ta_in: & மேலெழுதும் இலக்கு கோப்புறையை மாற்றவும்.

source: &Overwrite The target file gets replaced
ta_in: & மேலெழுதும் இலக்கு கோப்பு மாற்றப்படும்

source: &Overwrite The target file is replaced.
ta_in: & மேலெழுதும் இலக்கு கோப்பு மாற்றப்படுகிறது.

source: &Password:
ta_in: &கடவுச்சொல்:

source: &Paste
ta_in: &பேச்ட்

source: &Peg:
ta_in: & பெக்:

source: &Permanently offline
ta_in: & நிரந்தரமாக ஆஃப்லைனில்

source: &Platform dependent (native)
ta_in: & இயங்குதளத்தை சார்ந்தது (பூர்வீகம்)

source: &Play sound on notification
ta_in: அறிவிப்பில் ஒலி விளையாடுங்கள்

source: &Port:
ta_in: & போர்ட்:

source: &Power user defaults
ta_in: & பவர் பயனர் இயல்புநிலை

source: &Pre-fetch folders for faster browsing
ta_in: & வேகமான உலாவலுக்கான முன் கோப்புறைகள்

source: &Pretty print
ta_in: அழகான அச்சு

source: &Print...
ta_in: &அச்சிடு...

source: &Proceed anyway Ignore the hook script and run the command anyway.
ta_in: & எப்படியும் தொடரவும் ஊக் ச்கிரிப்டை புறக்கணித்து எப்படியும் கட்டளையை இயக்கவும்.

source: &Proceed with the entered path I'm aware of the possible problems.
ta_in: & நுழைந்த பாதையில் தொடரவும் சாத்தியமான சிக்கல்களை நான் அறிவேன்.

source: &Proceed with the merge.
ta_in: ஒன்றிணைப்புடன் தொடரவும்.

source: &Proceed without an issue number The commit won't be assigned to an issue.
ta_in: & வெளியீட்டு எண் இல்லாமல் தொடரவும் ஒரு பிரச்சினைக்கு கமிட் ஒதுக்கப்படாது.

source: &Properties
ta_in: &பண்புகள்

source: &Properties...
ta_in: &பண்புகள்...

source: &Recent messages
ta_in: &சமீபத்திய செய்திகள்

source: &Redo
ta_in: &மறுபடியும் செய்;

source: &Refresh
ta_in: &புதுப்பி

source: &Reject the certificate Cancel the connection.
ta_in: & சான்றிதழை நிராகரிக்கவும் இணைப்பை ரத்துசெய்.

source: &Relocate The working copy is relocated to the new URL.
ta_in: & இடமாற்றம் வேலை செய்யும் நகல் புதிய முகவரி க்கு மாற்றப்பட்டுள்ளது.

source: &Remind me to enter a bug-ID
ta_in: பிழை-ஐடியில் நுழைய எனக்கு நினைவூட்டுங்கள்

source: &Remove
ta_in: &நீக்கு

source: &Remove from version control All .svn folders are removed
ta_in: & பதிப்பு கட்டுப்பாட்டிலிருந்து அகற்று அனைத்தும் .svn கோப்புறைகள் அகற்றப்படுகின்றன

source: &Remove project
ta_in: & திட்டத்தை அகற்று

source: &Remove Force the removal
ta_in: & அகற்று அகற்றுவதை கட்டாயப்படுத்துங்கள்

source: &Remove Remove the property only from this item.
ta_in: & அகற்று இந்த உருப்படியிலிருந்து மட்டுமே சொத்தை அகற்றவும்.

source: &Remove The project is removed. If it has sub-projects, those are removed as well.
ta_in: & அகற்று திட்டம் அகற்றப்பட்டது. அதில் துணை திட்டங்கள் இருந்தால், அவை அகற்றப்படும்.

source: &Rename
ta_in: &மறுபெயர்

source: &Rename The folder is exported as '%ls'.
ta_in: & மறுபெயரிடுங்கள் கோப்புறை '%LS' ஆக ஏற்றுமதி செய்யப்படுகிறது.

source: &Replace
ta_in: மாற்று (&r)

source: &Repo-browser
ta_in: & ரெப்போ-உலாவி

source: &Resolve The item is marked as resolved.
ta_in: & தீர்க்க உருப்படி தீர்க்கப்பட்டதாக குறிக்கப்பட்டுள்ளது.

source: &Restore defaults
ta_in: & இயல்புநிலைகளை மீட்டெடுங்கள்

source: &Retry
ta_in: & மீண்டும் முயற்சிக்கவும்

source: &Retry as different user
ta_in: & வெவ்வேறு பயனராக மீண்டும் முயற்சிக்கவும்

source: &Retry without hooks
ta_in: & கொக்கிகள் இல்லாமல் மீண்டும் முயற்சிக்கவும்

source: &Revert all changes recursively
ta_in: & அனைத்து மாற்றங்களையும் மீண்டும் மாற்றவும்

source: &Revert changes from these revisions
ta_in: & இந்த திருத்தங்களிலிருந்து மாற்றங்களை மாற்றவும்

source: &Revert changes from this revision
ta_in: & இந்த திருத்தத்திலிருந்து மாற்றங்களை மாற்றவும்

source: &Revert Changes will be applied to the working copy.
ta_in: & மாற்றியமைத்தல் வேலை செய்யும் நகலில் மாற்றங்கள் பயன்படுத்தப்படும்.

source: &Revision
ta_in: & திருத்தம்

source: &Run Run the hook script
ta_in: &ஓடு ஊக் ச்கிரிப்டை இயக்கவும்

source: &SSH client:
ta_in: பாஓடு கிளையன்ட்:

source: &SVN
ta_in: & எச்.வி.என்

source: &Save
ta_in: &சேமி

source: &Save authentication
ta_in: & அங்கீகாரத்தை சேமிக்கவும்

source: &Save graph as...
ta_in: & வரைபடத்தை சேமிக்கவும் ...

source: &Save list of selected files to...
ta_in: & தேர்ந்தெடுக்கப்பட்ட கோப்புகளின் பட்டியலைச் சேமிக்கவும் ...

source: &Save value...
ta_in: & மதிப்பைச் சேமிக்கவும் ...

source: &Settings
ta_in: &அமைப்புகள்

source: &Shelve
ta_in: & அலமாரி

source: &Show HEAD revisions
ta_in: & தலை திருத்தங்களைக் காட்டு

source: &Show Log
ta_in: &பதிவை காட்டு

source: &Show Monitor
ta_in: & மானிட்டர் காட்டு

source: &Show popup notifications
ta_in: & பாப்அப் அறிவிப்புகளைக் காட்டு

source: &Specific revision in repository
ta_in: & களஞ்சியத்தில் குறிப்பிட்ட திருத்தம்

source: &Start Repobrowser
ta_in: & ரெபோபிரோவரைத் தொடங்குங்கள்

source: &Status Bar
ta_in: &நிலைமை பட்டை

source: &Steal the locks
ta_in: & பூட்டுகளைத் திருடுங்கள்

source: &Stop on copy/rename
ta_in: & நகல்/மறுபெயரிடுவதை நிறுத்துங்கள்

source: &Subversion username
ta_in: & சப்வர்சன் பயனர்பெயர்

source: &Switch WC to path and revision
ta_in: & WC ஐ பாதை மற்றும் திருத்தத்திற்கு மாற்றவும்

source: &Switch WC to path@HEAD
ta_in: & WC ஐ பாதை@தலைக்கு மாற்றவும்

source: &Symbol View
ta_in: & குறியீட்டு பார்வை

source: &Tab size:
ta_in: & தாவல் அளவு:

source: &Tags
ta_in: &குறிச்சொற்கள்

source: &Test merge
ta_in: & சோதனை ஒன்றிணைப்பு

source: &Text
ta_in: &உரை

source: &Timeout in seconds before updating the HEAD revision
ta_in: தலை திருத்தத்தை புதுப்பிப்பதற்கு முன் நொடிகளில் நேரம் முடிந்தது

source: &Timeout in seconds to stop the auto-completion parsing
ta_in: தானாக நிறைவு பாகுபடுத்தலைத் தடுக்க நொடிகளில் நேரம் முடிந்தது

source: &To Revision
ta_in: & திருத்தத்திற்கு

source: &To URL:
ta_in: &URL க்கு:

source: &To path:
ta_in: &Path க்கு:

source: &To: (end URL and revision of the range to merge)
ta_in: & இதற்கு: (URL ஐ முடிவுக்குக் கொண்டுவருவதற்கான வரம்பின் திருத்தம்)

source: &Toolbar
ta_in: &டூல்பார்

source: &Top
ta_in: &மேல்

source: &TortoiseMerge
ta_in: ஆமை

source: &TortoiseSVN
ta_in: ஆமை

source: &TortoiseUDiff
ta_in: & ஆமைடிஃப்

source: &Trunk
ta_in: & டிரங்க்

source: &Two Page
ta_in: &இரண்டு பக்கம்

source: &URL of repository:
ta_in: & களஞ்சியத்தின் URL:

source: &Undo
ta_in: &தளர்த்து

source: &Unified diff
ta_in: & ஒருங்கிணைந்த வேறுபாடு

source: &Unknown drives
ta_in: & அறியப்படாத இயக்கிகள்

source: &Update
ta_in: &மேம்படுத்து

source: &Update all
ta_in: அனைத்தையும் புதுப்பிக்கவும்

source: &Update item to revision
ta_in: & திருத்தத்திற்கு உருப்படியைப் புதுப்பிக்கவும்

source: &Update item to revision...
ta_in: & திருத்தத்திற்கு உருப்படியைப் புதுப்பிக்கவும் ...

source: &Update to revision...
ta_in: திருத்தத்திற்கான புதுப்பிப்பு ...

source: &Update Update the file and try locking again.
ta_in: & புதுப்பித்தல் கோப்பைப் புதுப்பித்து மீண்டும் பூட்ட முயற்சிக்கவும்.

source: &Update Update the working copy and reopen the commit dialog to try again.
ta_in: & புதுப்பிக்கவும் வேலை செய்யும் நகலைப் புதுப்பித்து, மீண்டும் முயற்சிக்க கமிட் உரையாடலை மீண்டும் திறக்கவும்.

source: &Update Update to the HEAD revision
ta_in: & புதுப்பிக்கவும் தலை திருத்தத்திற்கு புதுப்பிக்கவும்

source: &Use auto-completion of file paths and keywords
ta_in: & கோப்பு பாதைகள் மற்றும் முக்கிய வார்த்தைகளின் தானாக முடக்குவதைப் பயன்படுத்தவும்

source: &Use recycle bin
ta_in: & மறுசுழற்சி தொட்டியைப் பயன்படுத்தவும்

source: &Username:
ta_in: &பயனர்பெயர்:

source: &Vacuum pristine copies
ta_in: & வெற்றிட அழகிய பிரதிகள்

source: &Version
ta_in: & பதிப்பு

source: &View
ta_in: &நோக்கு

source: &Whole word
ta_in: & முழு சொல்

source: &Windows (CRLF)
ta_in: &விண்டோச் (CRLF)

source: &Working copy
ta_in: &நகல் வேலை

source: &file list control
ta_in: கோப்பு பட்டியல் கட்டுப்பாடு

source: '%ls' : %ld new commits
ta_in: ' %ls': %ld புதிய கமிட்டுகள்

source: '%ls' is not a valid URL or path!
ta_in: '%எல்.எச்' செல்லுபடியாகும் முகவரி அல்லது பாதை அல்ல!

source: 'skip ranges' are used to mark revision ranges that have not been cached yet
ta_in: 'ச்கிப் வரம்புகள்' இன்னும் தற்காலிக சேமிப்பு வரம்புகளைக் குறிக்கப் பயன்படுகிறது

source: (Double-click to clear error message)
ta_in: (பிழை செய்தியை அழிக்க இருமுறை சொடுக்கு செய்யவும்)

source: (binary value)
ta_in: (பைனரி மதிப்பு)

source: (content and properties)
ta_in: (உள்ளடக்கம் மற்றும் பண்புகள்)

source: (content only)
ta_in: (உள்ளடக்கம் மட்டும்)

source: (copy)
ta_in: (நகலெடு)

source: (create branch)
ta_in: (கிளையை உருவாக்கு)

source: (created)
ta_in: (உருவாக்கப்பட்டது)

source: (delete)
ta_in: (நீக்கு)

source: (externals)
ta_in: (புறம்பான)

source: (modified)
ta_in: (மாற்றியமைக்கப்பட்ட)
