Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: Recording mergeinfo for merge of r%1!ld! through r%2!ld!
ta_in: R%1! LD இன் ஒன்றிணைக்க மெர்சின்ஃபோவை பதிவு செய்தல்! r%2! ld!

source: Recording mergeinfo for merge of r%ld
ta_in: R%LD இன் ஒன்றிணைக்க மெர்சின்ஃபோவை பதிவு செய்தல்

source: Recording mergeinfo for reverse merge of r%1!ld! through r%2!ld!
ta_in: R%1! LD இன் தலைகீழ் ஒன்றிணைக்க மெர்சின்ஃபோவை பதிவு செய்தல்! r%2! ld!

source: Recording mergeinfo for reverse merge of r%ld
ta_in: R%LD இன் தலைகீழ் ஒன்றிணைக்க மெர்சின்ஃபோவை பதிவு செய்தல்

source: Recover the auto-saved documents Open the auto-saved versions instead of the explicitly saved versions
ta_in: தானாக சேமிக்கப்பட்ட ஆவணங்களை மீட்டெடுக்கவும் வெளிப்படையாக சேமிக்கப்பட்ட பதிப்புகளுக்கு பதிலாக தானாக சேமிக்கப்பட்ட பதிப்புகளைத் திறக்கவும்

source: Recur&sive Remove the property also from items in Subfolders.
ta_in: மீண்டும் & sive துணை கோப்புறைகளில் உள்ள பொருட்களிலிருந்தும் சொத்தையும் அகற்றவும்.

source: Recurse into unversioned folders
ta_in: மாற்றப்படாத கோப்புறைகளாக மறுபரிசீலனை செய்யுங்கள்

source: Recursive operation
ta_in: சுழல்நிலை செயல்பாடு

source: Recycle bin
ta_in: மறுசுழற்சி பின்

source: Redirecting to url
ta_in: முகவரி க்கு திருப்பி விடுதல்

source: Redo
ta_in: மீண்டும்செய்

source: Redo the previously undone action Redo
ta_in: முன்னர் செயல்தவிர்க்காத செயலை மீண்டும் செய்யவும் மீண்டும்

source: Reduce cross-&lines
ta_in: குறுக்கு & கோடுகளைக் குறைக்கவும்

source: Reduce the window to an icon
ta_in: சாளரத்தை ஒரு ஐகானாகக் குறைக்கவும்

source: Refresh
ta_in: புதுப்பிப்பு

source: Refresh &shell overlays
ta_in: புதுப்பிப்பு மற்றும் செல் மேலடுக்குகள்

source: Refreshing shell for %1!ls!
ta_in: %1! Ls க்கு புத்துணர்ச்சியூட்டும் செல்!

source: Regex Filter
ta_in: ரீசெக்ச் வடிகட்டி

source: Regex Filters
ta_in: ரீசெக்ச் வடிப்பான்கள்

source: Regex error caught! %S Trying to recover by unsetting it again.
ta_in: ரீசெக்ச் பிழை பிடிபட்டது! %கள் அதை மீண்டும் வெட்டுவதன் மூலம் மீட்க முயற்சிக்கிறது.

source: Regex is invalid!
ta_in: ரீசெக்ச் தவறானது!

source: Regex matching message:
ta_in: ரீசெக்ச் பொருந்தும் செய்தி:

source: Regex:
ta_in: ரெசெக்ச்:

source: Register context menu
ta_in: சூழல் மெனுவை பதிவு செய்யுங்கள்

source: Regular Expression
ta_in: வழக்கமான வெளிப்பாடு

source: Regular expressions filter: . : any character c+ : match character c one or more times c* : match character c zero or more times ^ : start of line $ : end of line (string){n} : match string n times (abcd) : subexpression [aei0-9] : match a,e,i and 0..9 [^aei0-9] : anything but a,e,i and 0..9 \w : matches a-z,A-Z,0-9 and _ \W : any non-alphanumeric character \d : digits 0-9 \s : whitespaces
ta_in: வழக்கமான வெளிப்பாடுகள் வடிகட்டி: . : எந்த கதாபாத்திரமும் சி+: பொருந்தக்கூடிய எழுத்து ஒன்று அல்லது அதற்கு மேற்பட்ட முறை சி*: பொருந்தக்கூடிய எழுத்து சி பூச்சியம் அல்லது அதற்கு மேற்பட்ட முறை ^: வரியின் தொடக்க $: வரியின் முடிவு (சரம்) {n}: சரம் n நேரங்களை பொருத்துங்கள் (ஏபிசிடி): துணை வெளிப்பாடு . [^aei0-9]: A, E, I மற்றும் 0..9 ஐத் தவிர வேறு எதையும் \ W: A-Z, A-Z, 0-9 மற்றும் _ உடன் பொருந்துகிறது \ W: எந்தவொரு ஆல்பசுமெரிக் அல்லாத பாத்திரமும் \ d: இலக்கங்கள் 0-9 \ கள்: வைட்ச்பேச்

source: Reintegrate merge %1!ls! into %2!ls!
ta_in: மீண்டும் ஒன்றிணைக்க %1! Ls! %2! ls!

source: Rejected patch hunks for '%ls'
ta_in: '%LS' க்கு நிராகரிக்கப்பட்ட ஒட்டு அங்க்ச்

source: Release loc&k...
ta_in: லாக் & கே வெளியீடு ...

source: Releases locks even if you're not the owner of the locks (breaks them).
ta_in: நீங்கள் பூட்டுகளின் உரிமையாளராக இல்லாவிட்டாலும் பூட்டுகளை வெளியிடுகிறது (அவற்றை உடைக்கிறது).

source: Releases locks on files so other users can edit them again.
ta_in: கோப்புகளில் பூட்டுகளை வெளியிடுகிறது, எனவே பிற பயனர்கள் அவற்றை மீண்டும் திருத்தலாம்.

source: Relo&cate...
ta_in: ரிலோ & கேட் ...

source: Reload
ta_in: ஏற்றவும்

source: Reloads the opened files and reverts all changes. Reload
ta_in: திறந்த கோப்புகளை மீண்டும் ஏற்றவும், எல்லா மாற்றங்களையும் மாற்றவும். ஏற்றவும்

source: Relocate
ta_in: இடமாற்றம்

source: Relocate where a switch might be intended
ta_in: ஒரு சுவிட்ச் நோக்கம் கொண்ட இடத்தில் இடமாற்றம் செய்யுங்கள்

source: Relocating...
ta_in: இடமாற்றம் ...

source: Remember the depth for this working copy
ta_in: இந்த வேலை நகலுக்கான ஆழத்தை நினைவில் கொள்ளுங்கள்

source: Remote property status
ta_in: தொலை சொத்து நிலை

source: Remote revision
ta_in: தொலை திருத்தம்

source: Remote status
ta_in: தொலைநிலை நிலை

source: Remote text status
ta_in: தொலை உரை நிலை

source: Remove
ta_in: அகற்று

source: Remove %ld items
ta_in: %எல்.டி உருப்படிகளை அகற்று

source: Remove %ls
ta_in: %LS ஐ அகற்று

source: Remove Bookmark
ta_in: புத்தகக்குறியை அகற்று

source: Remove Project
ta_in: திட்டத்தை அகற்று

source: Remove Saved Authentication Data
ta_in: சேமித்த அங்கீகார தரவை அகற்று

source: Remove from &ignore list
ta_in: புறக்கணிப்பு பட்டியலிலிருந்து அகற்று

source: Remove from changelist
ta_in: சேஞ்சலிச்ட்டில் இருந்து அகற்று

source: Remove property '%1!S!' from %2!ls!
ta_in: சொத்தின் '%1! கள்!' இருந்து %2! Ls!

source: Remove the selected cache(s) from disk
ta_in: தேர்ந்தெடுக்கப்பட்ட கேச் (களை) வட்டில் இருந்து அகற்றவும்

source: Remove the whole subtree(s)
ta_in: முழு சப்டிரீ (களை) அகற்றவும்

source: Removed
ta_in: அகற்றப்பட்டது

source: Removed from changelist
ta_in: சேஞ்சலிச்ட்டில் இருந்து அகற்றப்பட்டது

source: Removed the file pattern(s) %ls from the global ignore list.
ta_in: கோப்பு முறை (களை) அகற்றியது %ls உலகளாவிய புறக்கணிப்பு பட்டியலிலிருந்து.

source: Removed the file pattern(s) %ls from the ignore list.
ta_in: கோப்பு முறை (களை) அகற்றியது %ls புறக்கணிப்பு பட்டியலிலிருந்து.

source: Removes all unversioned and ignored items
ta_in: மாற்றப்படாத மற்றும் புறக்கணிக்கப்பட்ட அனைத்து பொருட்களையும் நீக்குகிறது

source: Removes the file or filemask from the list of ignored items
ta_in: புறக்கணிக்கப்பட்ட பொருட்களின் பட்டியலிலிருந்து கோப்பு அல்லது கோப்பு வரைபடத்தை நீக்குகிறது

source: Removes the selected properties
ta_in: தேர்ந்தெடுக்கப்பட்ட பண்புகளை நீக்குகிறது

source: Removing ignored items. in %1!ls!
ta_in: புறக்கணிக்கப்பட்ட பொருட்களை அகற்றுதல். %1! ls!

source: Removing unversioned items in %1!ls!
ta_in: மாற்றப்படாத பொருட்களை %1! LS இல் நீக்குதல்!

source: Rename
ta_in: மறுபெயரிடுங்கள்

source: Rename '%ls':
ta_in: '%Ls' என மறுபெயரிடுங்கள்:

source: Rename item from %1!ls! to %2!ls!
ta_in: உருப்படியை %1! LS இலிருந்து மறுபெயரிடுங்கள்! பெறுநர் %2! ls!

source: Rename/move
ta_in: மறுபெயரிட/நகர்த்தவும்

source: Renamed node
ta_in: முனை மறுபெயரிடப்பட்டது

source: Renames files / folders inside version control
ta_in: பதிப்பு கட்டுப்பாட்டுக்குள் கோப்புகள் / கோப்புறைகளை மறுபெயரிடுங்கள்

source: Reopen dialog after commit if items were left uncommitted
ta_in: உருப்படிகள் அனுமதிக்கப்படாவிட்டால் கமிட் செய்யப்பட்ட பிறகு உரையாடலை மீண்டும் திறக்கவும்

source: Reopens the commit dialog after a successful commit if there were files and/or folders left uncommitted.
ta_in: கோப்புகள் மற்றும்/அல்லது கோப்புறைகள் சேர்க்கப்படாமல் இருந்தால் வெற்றிகரமான உறுதிப்பாட்டிற்குப் பிறகு கமிட் உரையாடலை மீண்டும் திறக்கிறது.

source: Repair copy
ta_in: பழுதுபார்க்கும் நகல்

source: Repair move
ta_in: பழுதுபார்க்கும் நகர்வு

source: Repeat the last action Repeat
ta_in: கடைசி நடவடிக்கையை மீண்டும் செய்யவும் மீண்டும்

source: Replace &All
ta_in: அனைத்தையும் மாற்று (&a)

source: Replace specific text with different text Replace
ta_in: குறிப்பிட்ட உரையை வெவ்வேறு உரையுடன் மாற்றவும் மாற்றவும்

source: Replace with:
ta_in: இதனுடன் மாற்றவும்:

source: Replace:
ta_in: மாற்று:

source: Replaced %d matches
ta_in: %d போட்டிகளை மாற்றியது

source: Replacing
ta_in: மாற்றுகிறது

source: Repository
ta_in: களஞ்சியம்

source: Repository Browser
ta_in: களஞ்சிய உலாவி

source: Repository URL
ta_in: களஞ்சிய முகவரி

source: Repository UUID:
ta_in: களஞ்சியம் UUID:

source: Repository browser
ta_in: களஞ்சிய உலாவி

source: Repository created
ta_in: களஞ்சியம் உருவாக்கப்பட்டது

source: Repository query failed. Refresh to retry.
ta_in: களஞ்சிய வினவல் தோல்வியடைந்தது. மீண்டும் முயற்சிக்க புதுப்பிக்கவும்.

source: Request cancelled by TSVN
ta_in: கோரிக்கை TSVN ஆல் ரத்து செய்யப்பட்டது

source: Requests a username and a password
ta_in: பயனர்பெயர் மற்றும் கடவுச்சொல்லைக் கோருகிறது

source: Res&olve...
ta_in: ரெச் & ஓல்வ் ...

source: Reset columns
ta_in: நெடுவரிசைகளை மீட்டமைக்கவும்

source: Resolve
ta_in: தீர்க்க

source: Resolve conflict using 'mine'
ta_in: 'என்னுடையது' பயன்படுத்தி மோதலைத் தீர்க்கவும்

source: Resolve conflict using 'theirs'
ta_in: 'அவர்களுடைய' பயன்படுத்தி மோதலைத் தீர்க்கவும்

source: Resolve conflicts
ta_in: மோதல்களைத் தீர்க்கவும்

source: Resolved
ta_in: தீர்க்கப்பட்டது

source: Resolved: %ls
ta_in: தீர்க்கப்பட்டது: %ls

source: Resolves conflicted files
ta_in: முரண்பட்ட கோப்புகளை தீர்க்கிறது

source: Restore
ta_in: மீட்டமை

source: Restore Default
ta_in: இயல்புநிலையை மீட்டமைக்கவும்

source: Restore after commit
ta_in: உறுதிப்பாட்டிற்குப் பிறகு மீட்டமைக்கவும்

source: Restore the window to normal size
ta_in: சாளரத்தை சாதாரண அளவிற்கு மீட்டமைக்கவும்

source: Restored
ta_in: மீட்டெடுக்கப்பட்டது

source: Reverse merged revision(s) {revrange} from {mergeurl}:
ta_in: தலைகீழ் இணைக்கப்பட்ட திருத்தம் (கள்) {மெர்சூர்லிலிருந்து {revrange}:

source: Reverse merging %1!ld! through %2!ld!
ta_in: தலைகீழ் இணைத்தல் %1! எல்.டி! %2! எல்.டி!

source: Reverse merging %ld
ta_in: தலைகீழ் இணைத்தல் %எல்.டி.

source: Revert
ta_in: மாற்றியமைக்கவும்

source: Revert to default settings. Recommended for unexperienced users.
ta_in: இயல்புநிலை அமைப்புகளுக்கு திரும்பவும். அனுபவமற்ற பயனர்களுக்கு பரிந்துரைக்கப்படுகிறது.

source: Revert All local modifications will be lost.
ta_in: மாற்றியமைக்கவும் அனைத்து உள்ளக மாற்றங்களும் இழக்கப்படும்.

source: Reverted
ta_in: மாற்றியமைக்கப்பட்டது

source: Reverting %1!ls!
ta_in: %1! Ls!

source: Reverting changes
ta_in: மாற்றங்களை மாற்றுதல்

source: Reverts all changes you made since the last update
ta_in: கடைசி புதுப்பிப்பிலிருந்து நீங்கள் செய்த அனைத்து மாற்றங்களையும் மாற்றுகிறது

source: Reverts an addition to version control
ta_in: பதிப்பு கட்டுப்பாட்டுக்கு கூடுதலாக மாற்றுகிறது

source: Revision
ta_in: திருத்தம்

source: Revision %1!ls!
ta_in: திருத்தம் %1! Ls!

source: Revision %ld
ta_in: திருத்தம் %எல்.டி.

source: Revision &graph
ta_in: திருத்தம் மற்றும் வரைபடம்

source: Revision Graph
ta_in: திருத்த வரைபடம்

source: Revision Graph Filter
ta_in: திருத்த வரைபட வடிகட்டி

source: Revision Range
ta_in: திருத்த வரம்பு

source: Revision graph
ta_in: திருத்த வரைபடம்

source: Revision range to merge
ta_in: ஒன்றிணைக்க திருத்த வரம்பு

source: Revision:
ta_in: திருத்தம்:

source: Revision: %1!ld! %2!ls! URL: %3!ls! %4!ls!Author: %5!ls! Date: %6!ls! Log message: %7!ls!
ta_in: திருத்தம்: %1! எல்.டி! %2! Ls! URL: %3! Ls! %4! Ls! ஆசிரியர்: %5! Ls! தேதி: %6! Ls! பதிவு செய்தி: %7! Ls!

source: Revision: %1!ld! %2!ls! URL: %3!ls! %4!ls!Author: %5!ls! Date: %6!ls! Tags (%7!d!):%8!ls! Log message: %9!ls!
ta_in: திருத்தம்: %1! எல்.டி! %2! Ls! URL: %3! Ls! %4! Ls! ஆசிரியர்: %5! Ls! தேதி: %6! Ls! குறிச்சொற்கள் (%7! D!):%8! Ls! பதிவு செய்தி: %9! Ls!

source: Revisions
ta_in: திருத்தங்கள்

source: Rich Text (RTF) text with font and paragraph formatting
ta_in: பணக்கார உரை (RTF) எழுத்துரு மற்றும் பத்தி வடிவமைப்புடன் உரை

source: Right View:
ta_in: சரியான பார்வை:

source: Right image
ta_in: சரியான படம்

source: Run cleanup &now
ta_in: தூய்மைப்படுத்தும் & இப்போது இயக்கவும்

source: Run hoo&k script
ta_in: ஊ & கே ச்கிரிப்டை இயக்கவும்

source: S
ta_in: கள்

source: S&tatistics
ta_in: எச் & டாட்டிச்டிக்ச்

source: S&witch...
ta_in: சொடுக்கி...

source: SSH
ta_in: பாஓடு

source: SVN &Vendorbranch here
ta_in: எச்.வி.என் & விற்பனையாளர் இங்கே

source: SVN Add as &external here
ta_in: எச்.வி.என் சேர் & வெளிப்புறமாக இங்கே

source: SVN Author
ta_in: எச்.வி.என் ஆசிரியர்

source: SVN Copy and add files to this WC
ta_in: இந்த WC இல் எச்.வி.என் நகலெடுத்து கோப்புகளைச் சேர்க்கவும்

source: SVN Copy and rename versioned item here
ta_in: எச்.வி.என் நகல் மற்றும் பதிப்பு உருப்படியை மறுபெயரிடுதல் இங்கே

source: SVN Copy versioned item(s) here
ta_in: எச்.வி.என் நகல் பதிக்கப்பட்ட உருப்படி (கள்) இங்கே

source: SVN Export all items here
ta_in: எச்.வி.என் அனைத்து பொருட்களையும் இங்கே ஏற்றுமதி செய்கிறது

source: SVN Export changed items here
ta_in: எச்.வி.என் ஏற்றுமதி இங்கே மாற்றப்பட்ட பொருட்களை மாற்றியது

source: SVN Export versioned items here
ta_in: எச்.வி.என் ஏற்றுமதி பதிக்கப்பட்ட உருப்படிகள் இங்கே

source: SVN Local lock owner
ta_in: எச்.வி.என் உள்ளக பூட்டு உரிமையாளர்

source: SVN Move and rename versioned item here
ta_in: எச்.வி.என் நகர்வு மற்றும் பதிப்பு உருப்படியை மறுபெயரிடுங்கள்

source: SVN Move versioned item(s) here
ta_in: எச்.வி.என் நகர்த்தப்பட்ட பதிப்பு உருப்படி (கள்) இங்கே

source: SVN Revision
ta_in: எச்.வி.என் திருத்தம்

source: SVN Status
ta_in: எச்.வி.என் நிலை

source: SVN Statusnumber
ta_in: எச்.வி.என் நிலை

source: SVN URL
ta_in: எச்.வி.என் முகவரி

source: SVN eol-style
ta_in: எச்.வி.என் ஈல்-பாணி

source: SVN mime-type
ta_in: எச்.வி.என் மைம்-வகை

source: SVN short URL
ta_in: எச்.வி.என் குறுகிய முகவரி

source: Sample log message to test the bugtraq: regex strings. Testing mentions of issues inside a text: Mention issue #55. Mention issues #77, #78. Update issue #101 Fixes issue #202 Resolves issue #88. Closes issue #99.
ta_in: பிழைத்திருத்தத்தை சோதிக்க மாதிரி பதிவு செய்தி: ரீசெக்ச் சரங்கள். சோதனை ஒரு உரையின் சிக்கல்களைக் குறிப்பிடுகிறது: வெளியீடு #55 ஐக் குறிப்பிடவும். சிக்கல்கள் #77, #78 ஐக் குறிப்பிடவும். புதுப்பிப்பு வெளியீடு #101 சரிசெய்தல் வெளியீடு #202 வெளியீடு #88 ஐ தீர்க்கிறது. வெளியீடு #99 ஐ மூடுகிறது.

source: Sample text:
ta_in: மாதிரி உரை:

source: Save
ta_in: சேமி

source: Save &as
ta_in: எனச் சேமிக்க

source: Save &as...
ta_in: என சேமி... (&a)

source: Save As
ta_in: என சேமி

source: Save Bottom File as You're asked where to save the bottom file
ta_in: கீழே கோப்பை சேமிக்கவும் கீழே உள்ள கோப்பை எங்கு சேமிப்பது என்று கேட்கப்படுகிறது

source: Save File
ta_in: கோப்பை சேமி

source: Save Left File as You're asked where to save the left file
ta_in: இடது கோப்பை சேமிக்கவும் இடது கோப்பை எங்கு சேமிப்பது என்று கேட்கப்படுகிறது

source: Save Left File The modifications are saved to %ls
ta_in: இடது கோப்பை சேமிக்கவும் மாற்றங்கள் சேமிக்கப்படுகின்றன %ls

source: Save Right File as You're asked where to save the right file
ta_in: சரியான கோப்பை சேமிக்கவும் சரியான கோப்பை எங்கு சேமிப்பது என்று கேட்கப்படுகிறது

source: Save Right File The modifications are saved to %ls
ta_in: சரியான கோப்பைச் சேமிக்கவும் மாற்றங்கள் சேமிக்கப்படுகின்றன %ls

source: Save all Both Files are saved
ta_in: அனைத்தையும் சேமிக்கவும் இரண்டு கோப்புகளும் சேமிக்கப்படுகின்றன

source: Save and exclude Your changes are saved and the original content is used
ta_in: சேமித்து விலக்கு உங்கள் மாற்றங்கள் சேமிக்கப்பட்டு அசல் உள்ளடக்கம் பயன்படுத்தப்படுகிறது

source: Save and ignore marked blocks Only your manual edits are saved, marked blocks are left as they are
ta_in: குறிக்கப்பட்ட தொகுதிகளை சேமித்து புறக்கணிக்கவும் உங்கள் கையேடு திருத்தங்கள் மட்டுமே சேமிக்கப்படுகின்றன, குறிக்கப்பட்ட தொகுதிகள் உள்ளன

source: Save and include Your changes are saved and the marked blocks are included
ta_in: சேமித்து சேர்க்கவும் உங்கள் மாற்றங்கள் சேமிக்கப்பட்டு குறிக்கப்பட்ட தொகுதிகள் சேர்க்கப்பட்டுள்ளன

source: Save as
ta_in: என சேமி

source: Save as...
ta_in: சேமி ...

source: Save as You're asked where to save the file
ta_in: சேமிக்கவும் கோப்பை எங்கு சேமிப்பது என்று கேட்கப்படுகிறது

source: Save changes to %1?
ta_in: மாற்றங்களை %1 ஆக சேமிக்கவா?

source: Save client certificate path
ta_in: கிளையன்ட் சான்றிதழ் பாதையை சேமிக்கவும்

source: Save in Git format
ta_in: அறிவிலி வடிவத்தில் சேமிக்கவும்

source: Save modifications.
ta_in: மாற்றங்களைச் சேமிக்கவும்.

source: Save revision &to...
ta_in: திருத்தத்தை சேமிக்கவும் ...

source: Save settings to file
ta_in: அமைப்புகளை கோப்பில் சேமிக்கவும்

source: Save the modified file Save file
ta_in: மாற்றியமைக்கப்பட்ட கோப்பை சேமிக்கவும் கோப்பை சேமி

source: Save to clipboard
ta_in: கிளிப்போர்டில் சேமிக்கவும்

source: Save Save the file with the conflict markers.
ta_in: சேமிக்கவும் மோதல் குறிப்பான்களுடன் கோப்பை சேமிக்கவும்.

source: Save The modifications are saved to %ls
ta_in: சேமிக்கவும் மாற்றங்கள் சேமிக்கப்படுகின்றன %ls

source: Saved Data
ta_in: சேமித்த தரவு

source: Saves expensive server roundtrips when set to longer than 0 seconds
ta_in: 0 வினாடிகளுக்கு மேல் அமைக்கும்போது விலையுயர்ந்த சேவையக ரவுண்ட்ரிப்சை சேமிக்கிறது

source: Saves the selected property value to a file
ta_in: தேர்ந்தெடுக்கப்பட்ட சொத்து மதிப்பை ஒரு கோப்பில் சேமிக்கிறது

source: Saving files
ta_in: கோப்புகளைச் சேமிக்கிறது

source: Saving patchfile to:
ta_in: பேட்ச்பைலை சேமிக்கிறது:

source: Scan
ta_in: ஊடுகதிர்

source: Scintilla
ta_in: சிண்டில்லா

source: Search &log messages...
ta_in: பதிவு செய்திகளைத் தேடுங்கள் ...

source: Search &up
ta_in: தேடல் & மேலே

source: Search for:
ta_in: தேடு:

source: Search string not found!
ta_in: தேடல் சரம் கிடைக்கவில்லை!

source: Searching for better path to apply patch...
ta_in: பேட்சைப் பயன்படுத்துவதற்கான சிறந்த பாதையைத் தேடுகிறது ...

source: Seek failed on %1
ta_in: %1 இல் தோல்வியுற்றது

source: Select
ta_in: தேர்ந்தெடு

source: Select &All
ta_in: அனைத்தையும் தேர்ந்தெடு (&a)

source: Select / deselect &all
ta_in: தேர்ந்தெடுக்க / தேர்வு செய்யுங்கள்

source: Select File...
ta_in: கோப்பைத் தேர்ந்தெடுக்கவும் ...

source: Select Revision
ta_in: திருத்தத்தைத் தேர்ந்தெடுக்கவும்

source: Select SSH client
ta_in: பாஓடு கிளையண்டைத் தேர்ந்தெடுக்கவும்

source: Select a button.
ta_in: ஒரு பொத்தானைத் தேர்ந்தெடுக்கவும்.

source: Select an existing shelf to create a new version, or enter a new name to create a new shelf
ta_in: புதிய பதிப்பை உருவாக்க ஏற்கனவே இருக்கும் அலமாரியைத் தேர்ந்தெடுக்கவும் அல்லது புதிய அலமாரியை உருவாக்க புதிய பெயரை உள்ளிடவும்

source: Select an object on which to get Help
ta_in: உதவி பெற ஒரு பொருளைத் தேர்ந்தெடுக்கவும்

source: Select changelist
ta_in: சேஞ்சலிச்ட்டைத் தேர்ந்தெடுக்கவும்

source: Select diff application
ta_in: வேறுபாடு பயன்பாட்டைத் தேர்ந்தெடுக்கவும்

source: Select end revision
ta_in: இறுதி திருத்தத்தைத் தேர்ந்தெடுக்கவும்

source: Select folder to associate with this issue tracker
ta_in: இந்த வெளியீடு டிராக்கருடன் இணைக்க கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Select folder to export to. You might need to create a new folder before performing this export.
ta_in: ஏற்றுமதி செய்ய கோப்புறையைத் தேர்ந்தெடுக்கவும். இந்த ஏற்றுமதியைச் செய்வதற்கு முன்பு நீங்கள் ஒரு புதிய கோப்புறையை உருவாக்க வேண்டியிருக்கும்.

source: Select folder to run script for
ta_in: ச்கிரிப்டை இயக்க கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Select folder to save the selected files to
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்புகளைச் சேமிக்க கோப்புறையைத் தேர்ந்தெடுக்கவும்

source: Select hook script file
ta_in: ஊக் ச்கிரிப்ட் கோப்பைத் தேர்ந்தெடுக்கவும்

source: Select items automatically
ta_in: உருப்படிகளை தானாகத் தேர்ந்தெடுக்கவும்

source: Select merge application
ta_in: ஒன்றிணைக்கும் பயன்பாட்டைத் தேர்ந்தெடுக்கவும்

source: Select merge target
ta_in: ஒன்றிணைக்கும் இலக்கைத் தேர்ந்தெடுக்கவும்

source: Select patch file...
ta_in: ஒட்டு கோப்பைத் தேர்ந்தெடுக்கவும் ...

source: Select revision range
ta_in: திருத்த வரம்பைத் தேர்ந்தெடுக்கவும்

source: Select settings file
ta_in: அமைப்புகள் கோப்பைத் தேர்ந்தெடுக்கவும்

source: Select start revision
ta_in: தொடக்க திருத்தத்தைத் தேர்ந்தெடுக்கவும்

source: Select the URLs for the tree merge
ta_in: மர ஒன்றிணைப்புக்கு முகவரி களைத் தேர்ந்தெடுக்கவும்

source: Select the behaviour of the progress dialog at the end of the operation.
ta_in: செயல்பாட்டின் முடிவில் முன்னேற்ற உரையாடலின் நடத்தையைத் தேர்ந்தெடுக்கவும்.

source: Select the entire document Select All
ta_in: முழு ஆவணத்தையும் தேர்ந்தெடுக்கவும் அனைத்தையும் தெரிவுசெய்

source: Select the language this project is using. This settings affects the spell checker used for commit messages.
ta_in: இந்த திட்டம் பயன்படுத்தும் மொழியைத் தேர்ந்தெடுக்கவும். இந்த அமைப்புகள் செய்திகளுக்கு பயன்படுத்தப்படும் எழுத்துப்பிழை சரிபார்ப்பை பாதிக்கிறது.

source: Select the merge options
ta_in: ஒன்றிணைப்பு விருப்பங்களைத் தேர்ந்தெடுக்கவும்

source: Select the revisions to merge
ta_in: ஒன்றிணைக்க திருத்தங்களைத் தேர்ந்தெடுக்கவும்

source: Select the type of merge
ta_in: ஒன்றிணைக்கும் வகையைத் தேர்ந்தெடுக்கவும்

source: Select viewer for diff-files
ta_in: டிஃப்-ஃபைல்களுக்கு பார்வையாளரைத் தேர்ந்தெடுக்கவும்

source: Select what file you want to save as
ta_in: நீங்கள் எந்த கோப்பை சேமிக்க விரும்புகிறீர்கள் என்பதைத் தேர்ந்தெடுக்கவும்

source: Select what file you want to save as Note: There is unresolved conflict!
ta_in: நீங்கள் எந்த கோப்பை சேமிக்க விரும்புகிறீர்கள் என்பதைத் தேர்ந்தெடுக்கவும் குறிப்பு: தீர்க்கப்படாத மோதல் உள்ளது!

source: Selected node
ta_in: தேர்ந்தெடுக்கப்பட்ட முனை

source: Send Mail failed to send message.
ta_in: அஞ்சல் அனுப்புதல் செய்தியை அனுப்பத் தவறிவிட்டது.

source: Sending content
ta_in: உள்ளடக்கத்தை அனுப்புகிறது

source: Server &address:
ta_in: சேவையகம் & முகவரி:

source: Set explicit revision for these externals:
ta_in: இந்த வெளிப்புறங்களுக்கு வெளிப்படையான திருத்தத்தை அமைக்கவும்:

source: Set file dates to the "last commit &time"
ta_in: கோப்பு தேதிகளை "கடைசி கமிட் & டைம்" க்கு அமைக்கவும்

source: Set property '%1!S!' on %2!ls!
ta_in: சொத்து '%1! கள்!' ஆன் %2! Ls!

source: Setting properties...
ta_in: பண்புகளை அமைத்தல் ...

source: Settings
ta_in: அமைப்புகள்

source: Settings - TortoiseSVN
ta_in: அமைப்புகள் - ஆமை

source: Shall I update the working copy and retry?
ta_in: நான் வேலை நகலை புதுப்பித்து மீண்டும் முயற்சிக்கிறேன்?

source: Shelf "%s" has %ld version(s)
ta_in: அலமாரியில் " %s" %ld பதிப்பு (கள்) உள்ளது

source: Shelf name can not be empty!
ta_in: அலமாரியின் பெயர் காலியாக இருக்க முடியாது!

source: Shelfing
ta_in: அடுக்கு

source: Shell
ta_in: ஓடு

source: Shell Icon Cache was rebuilt!
ta_in: செல் படவுரு கேச் மீண்டும் கட்டப்பட்டது!

source: Shelve
ta_in: அலமாரி

source: Shelve the selected files and revert the changes.
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்புகளை நிறுத்தி மாற்றங்களை மாற்றவும்.

source: Shelve...
ta_in: அலமாரி ...

source: Shelving to "%s"
ta_in: "%s" க்கு அலமாரி

source: Shift trees to the top of the window. Alignment to other trees will be lost.
ta_in: மரங்களை சாளரத்தின் மேற்புறத்தில் மாற்றவும். மற்ற மரங்களுடன் சீரமைப்பு இழக்கப்படும்.

source: Sho&w properties
ta_in: சோ & டபிள்யூ பண்புகள்

source: Short &date/time format in log messages
ta_in: பதிவு செய்திகளில் குறுகிய & தேதி/நேர வடிவம்

source: Short URL of Subversion items
ta_in: சப்வர்சன் உருப்படிகளின் குறுகிய முகவரி

source: Shorten property list
ta_in: சொத்து பட்டியலைக் குறைக்கவும்

source: Show
ta_in: காட்டு

source: Show &All
ta_in: காட்டு & அனைத்தும்

source: Show &Log
ta_in: பதிவை காட்டு

source: Show &Range...
ta_in: காட்டு & வரம்பு ...

source: Show &WC revision
ta_in: காட்டு & WC திருத்தம்

source: Show &all revisions
ta_in: அனைத்து திருத்தங்களையும் காட்டு

source: Show &changes
ta_in: காட்டு & மாற்றங்கள்

source: Show &externals
ta_in: காட்டு மற்றும் வெளிப்புறங்கள்

source: Show &locks
ta_in: காட்டு & பூட்டுகள்

source: Show &log
ta_in: பதிவை காட்டு

source: Show &log...
ta_in: பதிவை காட்டு...

source: Show &overlays and context menu only in explorer
ta_in: எக்ச்ப்ளோரரில் மட்டுமே காட்டு & மேலடுக்குகள் மற்றும் சூழல் பட்டியல்

source: Show &unversioned files
ta_in: காண்பி & மாற்றப்படாத கோப்புகள்

source: Show HEAD revision nodes
ta_in: தலை திருத்த முனைகளைக் காட்டு

source: Show Inline-Diff word by word Inline diff word-wise
ta_in: சொல் மூலம் இன்லைன்-டிஃப் வார்த்தையைக் காட்டுங்கள் இன்லைன் வேறுபட்ட சொல் வாரியாக

source: Show Inline-Diff Inline diff
ta_in: இன்லைன்-டிஃப் காட்டு இன்லைன் வேறுபாடு

source: Show Lock dialog before locking files
ta_in: கோப்புகளைப் பூட்டுவதற்கு முன் பூட்டு உரையாடலைக் காட்டு

source: Show Monitor Dialog
ta_in: மானிட்டர் உரையாடலைக் காட்டு

source: Show Ove&rview
ta_in: OVE & RVIEW ஐக் காட்டு

source: Show WC &modifications
ta_in: WC & மாற்றங்களைக் காட்டு

source: Show Whitespaces
ta_in: வைட்ச்பேசைக் காட்டு

source: Show an overview of the whole graph
ta_in: முழு வரைபடத்தின் கண்ணோட்டத்தைக் காட்டு
