Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: Show c&hanges (content only)
ta_in: சி & ஏங்கல்களைக் காட்டு (உள்ளடக்கம் மட்டும்)

source: Show changes as &unified diff
ta_in: மாற்றங்களை & ஒருங்கிணைந்த வேறுபாட்டைக் காட்டு

source: Show diff separately
ta_in: தனித்தனியாக வேறுபடுவதைக் காட்டு

source: Show differences as &unified diff
ta_in: வேறுபாடுகளை & ஒருங்கிணைந்த வேறுபாட்டைக் காட்டுங்கள்

source: Show excluded root folders as normal
ta_in: விலக்கப்பட்ட ரூட் கோப்புறைகளை சாதாரணமாகக் காட்டு

source: Show externals from &different repositories
ta_in: & வெவ்வேறு களஞ்சியங்களிலிருந்து வெளிப்புறங்களைக் காட்டு

source: Show l&og
ta_in: பதிவை காட்டு

source: Show linenumber&s
ta_in: லினென்யூம்பர் & கள் காட்டு

source: Show lo&g
ta_in: பதிவை காட்டு

source: Show log of repo at revision…
ta_in: திருத்தத்தில் ரெப்போவின் பதிவைக் காட்டு…

source: Show multiple &changes...
ta_in: பல & மாற்றங்களைக் காட்டு ...

source: Show multiple &changes... (content only)
ta_in: பல மற்றும் மாற்றங்களைக் காட்டு ... (உள்ளடக்கம் மட்டும்)

source: Show oldest node at top
ta_in: மேலே பழமையான முனையைக் காட்டு

source: Show only a&ffected paths
ta_in: A & ffected பாதைகளை மட்டுமே காட்டு

source: Show only the changed parts of the path name. Replace unchanged elements with dots.
ta_in: பாதை பெயரின் மாற்றப்பட்ட பகுதிகளை மட்டுமே காட்டுங்கள். மாறாத கூறுகளை புள்ளிகளுடன் மாற்றவும்.

source: Show or hide the line diff bar Toggle LineDiffBar
ta_in: வரி வேறுபாடு பட்டியைக் காட்டவும் அல்லது மறைக்கவும் லைடிஃபார் மாற்று

source: Show or hide the locator bar Toggle LocatorBar
ta_in: லொக்கேட்டர் பட்டியைக் காட்டவும் அல்லது மறைக்கவும் லொக்கடார்பாரை மாற்றவும்

source: Show or hide the status bar Toggle StatusBar
ta_in: நிலை பட்டியைக் காட்டுங்கள் அல்லது மறைக்கவும் நிலைமையை மாற்றவும்

source: Show or hide the toolbar Toggle ToolBar
ta_in: கருவிப்பட்டியைக் காட்டவும் அல்லது மறைக்கவும் கருவிப்பட்டியை மாற்றவும்

source: Show revision properties
ta_in: திருத்த பண்புகளைக் காட்டு

source: Show special characters for whitespaces and newlines Show Whitespaces
ta_in: ஒயிட்ச்பேச்கள் மற்றும் புதிய வரிகளுக்கான சிறப்பு எழுத்துக்களைக் காட்டு வைட்ச்பேசைக் காட்டு

source: Show statistics for the selected log cache
ta_in: தேர்ந்தெடுக்கப்பட்ட பதிவு தற்காலிக சேமிப்பிற்கான புள்ளிவிவரங்களைக் காட்டு

source: Show tags on the copy source, not as separate nodes
ta_in: நகல் மூலத்தில் குறிச்சொற்களைக் காட்டு, தனி முனைகளாக அல்ல

source: Show the &diff The diff viewer is started for every selected item.
ta_in: & வேறுபாடு தேர்ந்தெடுக்கப்பட்ட ஒவ்வொரு பொருளுக்கும் வேறுபட்ட பார்வையாளர் தொடங்கப்படுகிறது.

source: Show/Hide
ta_in: காட்டு/மறைக்க

source: Showing %1!ld! revision(s), from revision %2!ld! to revision %3!ld! - %4!ld! revision(s) selected, showing %5!ld! changed paths
ta_in: %1! LD ஐக் காட்டுகிறது! திருத்தம் (கள்), திருத்தம் %2! LD! திருத்தம் %3! ld! - %4! எல்.டி! திருத்தம் (கள்) தேர்ந்தெடுக்கப்பட்டது, %5! LD ஐக் காட்டுகிறது! மாற்றப்பட்ட பாதைகள்

source: Showing %ld nodes
ta_in: %எல்.டி முனைகளைக் காட்டுகிறது

source: Showing graph for %ls
ta_in: %LS க்கான வரைபடத்தைக் காட்டுகிறது

source: Shows a graphical representation of copies/tags/branches
ta_in: பிரதிகள்/குறிச்சொற்கள்/கிளைகளின் வரைகலை பிரதிநிதித்துவத்தைக் காட்டுகிறது

source: Shows a unified diff of all changes of the path and those below, including property changes.
ta_in: சொத்து மாற்றங்கள் உட்பட பாதையின் அனைத்து மாற்றங்களையும் கீழே உள்ளவற்றின் ஒருங்கிணைந்த வேறுபாட்டைக் காட்டுகிறது.

source: Shows all files which were changed since the last update, locally and in the repository
ta_in: கடைசி புதுப்பிப்பிலிருந்து, உள்நாட்டிலும் களஞ்சியத்திலும் மாற்றப்பட்ட அனைத்து கோப்புகளையும் காட்டுகிறது

source: Shows all revisions where changes were made to this item
ta_in: இந்த உருப்படியில் மாற்றங்கள் செய்யப்பட்ட அனைத்து திருத்தங்களையும் காட்டுகிறது

source: Shows folders and files included with the svn:externals property
ta_in: எச்.வி.என் உடன் சேர்க்கப்பட்ட கோப்புறைகள் மற்றும் கோப்புகளைக் காட்டுகிறது: வெளிப்புற சொத்து

source: Shows information about TortoiseSVN
ta_in: ஆமை வி.என் பற்றிய தகவல்களைக் காட்டுகிறது

source: Shows the action log file in the default text editor
ta_in: இயல்புநிலை உரை திருத்தியில் செயல் பதிவு கோப்பைக் காட்டுகிறது

source: Shows the eol-style property value
ta_in: EOL- பாணி சொத்து மதிப்பைக் காட்டுகிறது

source: Shows the lock owner of locked files. Disable this to improve performance with older servers.
ta_in: பூட்டப்பட்ட கோப்புகளின் பூட்டு உரிமையாளரைக் காட்டுகிறது. பழைய சேவையகங்களுடன் செயல்திறனை மேம்படுத்த இதை முடக்கு.

source: Shows the log for the selected file / folder
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்பு / கோப்புறைக்கான பதிவைக் காட்டுகிறது

source: Shows the mime type of the versioned file
ta_in: பதிப்பு செய்யப்பட்ட கோப்பின் MIME வகையைக் காட்டுகிறது

source: Size
ta_in: அளவு

source: Size and status
ta_in: அளவு மற்றும் நிலை

source: Size of all cached text information
ta_in: அனைத்து தற்காலிக சேமிப்பு உரை தகவல்களின் அளவு

source: Size of log messages
ta_in: பதிவு செய்திகளின் அளவு

source: Size of the cache file on disk
ta_in: வட்டில் கேச் கோப்பின் அளவு

source: Size of the cache if it were not compressed
ta_in: தற்காலிக சேமிப்பு சுருக்கப்படாவிட்டால் அது அளவு

source: Skip The file is left where it is.
ta_in: தவிர்க்கவும் கோப்பு இருக்கும் இடத்தில் விடப்பட்டுள்ளது.

source: Skipped
ta_in: தவிர்க்கப்பட்டது

source: Skipped missing target
ta_in: காணாமல் போன இலக்கைத் தவிர்த்தது

source: Skipped obstructing working copy
ta_in: வேலை நகலைத் தவிர்த்தது

source: Skipped, access denied
ta_in: தவிர்க்கப்பட்டது, அணுகல் மறுக்கப்பட்டது

source: Skipped, no versioned parent
ta_in: தவிர்க்கப்பட்டது, பதிப்பு பெற்றோர் இல்லை

source: Skipped, remains conflicted
ta_in: தவிர்க்கப்பட்டது, முரண்பட்டது

source: Smart tab char
ta_in: அறிவுள்ள தாவல் கரி

source: Some file(s) have been changed outside T-Merge. Do you want to load the changes?
ta_in: டி-மெர்சுக்கு வெளியே சில கோப்பு (கள்) மாற்றப்பட்டுள்ளன. மாற்றங்களை ஏற்ற விரும்புகிறீர்களா?

source: Some file(s) have been changed outside T-Merge. Would you like to reload and lose your changes?
ta_in: டி-மெர்சுக்கு வெளியே சில கோப்பு (கள்) மாற்றப்பட்டுள்ளன. உங்கள் மாற்றங்களை மீண்டும் ஏற்றி இழக்க விரும்புகிறீர்களா?

source: Something went wrong
ta_in: ஏதோ தவறு நடந்துவிட்டது

source: Sort by commit count
ta_in: வரிசைப்படுத்து by commit எண்ணுங்கள்

source: Source URL:
ta_in: மூல URL:

source: Sparse update %1!ls!, depth '%2!ls!'
ta_in: சிதறிய புதுப்பிப்பு %1! LS !, ஆழம் ' %2! LS!'

source: Specifies how many items you want to keep in the most recent log messages dialog.
ta_in: மிகச் அண்மைக் கால பதிவு செய்திகள் உரையாடலில் எத்தனை உருப்படிகளை வைத்திருக்க விரும்புகிறீர்கள் என்பதைக் குறிப்பிடுகிறது.

source: Specifies how the text for each merged revision should look like. The following keywords can be used: {msg}: The log message of the merged revision, as it was entered. {msgoneline}: The log message force onto one line {author}: The author of the merged revision {rev}: The merged revision itself {bugid}: The bug ids of the merged revision
ta_in: இணைக்கப்பட்ட ஒவ்வொரு திருத்தத்திற்கும் உரை எப்படி இருக்க வேண்டும் என்பதைக் குறிப்பிடுகிறது. பின்வரும் முக்கிய வார்த்தைகளைப் பயன்படுத்தலாம்: {msg}: இணைக்கப்பட்ட திருத்தத்தின் பதிவு செய்தி, அது உள்ளிடப்பட்டது. {msgoneline}: பதிவு செய்தி படை ஒரு வரியில் {ஆசிரியர்}: இணைக்கப்பட்ட திருத்தத்தின் ஆசிரியர் {ரெவ்}: இணைக்கப்பட்ட திருத்தம் {bugid}: இணைக்கப்பட்ட திருத்தத்தின் பிழை ஐடிகள்

source: Specify how the commit message should be built from the entered bug-ID. Use the placeholder %BUGID% for the real bug-ID. If you leave these settings empty, TortoiseSVN will use the regular expressions instead.
ta_in: உள்ளிட்ட பிழை-ஐடியிலிருந்து கமிட் செய்தி எவ்வாறு உருவாக்கப்பட வேண்டும் என்பதைக் குறிப்பிடவும். உண்மையான பிழை-ஐடிக்கு பிளேச்ஓல்டர் % bugid % ஐப் பயன்படுத்தவும். இந்த அமைப்புகளை நீங்கள் காலியாக விட்டுவிட்டால், அதற்கு பதிலாக வழக்கமான வெளிப்பாடுகளைப் பயன்படுத்தும்.

source: Specify the URL to access the issue tracker. Use %BUGID% as a placeholder for the real issue number.
ta_in: வெளியீடு டிராக்கரை அணுக முகவரி ஐக் குறிப்பிடவும். உண்மையான வெளியீட்டு எண்ணுக்கு ஒதுக்கிடமாக % bugid % ஐப் பயன்படுத்தவும்.

source: Specify the files or folders which TortoiseSVN should ignore in all working copies. Separate the patterns with a space.
ta_in: ஆமை விஎன் கோப்புகள் அல்லது கோப்புறைகளைக் குறிப்பிடவும் வேலை செய்யும் அனைத்து நகல்களிலும் புறக்கணிக்க வேண்டும். வடிவங்களை ஒரு இடத்துடன் பிரிக்கவும்.

source: Split &source tree
ta_in: பிளவு மற்றும் மூல மரம்

source: Split following &tree
ta_in: பின்வரும் & மரம் பிரிக்கவும்

source: Split lines
ta_in: பிளவு கோடுகள்

source: Split sub-trees
ta_in: துணை மரங்களை பிரிக்கவும்

source: Split the active window into panes Split
ta_in: செயலில் உள்ள சாளரத்தை பேன்களாக பிரிக்கவும் பிளவு

source: Stacked Bar Graph
ta_in: அடுக்கப்பட்ட பார் வரைபடம்

source: Stacked Line Graph
ta_in: அடுக்கப்பட்ட வரி வரைபடம்

source: Start Commit Hook
ta_in: கமிட் ஊக்கைத் தொடங்குங்கள்

source: Start Revision
ta_in: திருத்தத் தொடங்கு

source: Start Update Hook
ta_in: புதுப்பிப்பு கொக்கி தொடங்கவும்

source: Start registry editor
ta_in: பதிவு ஆசிரியர்

source: Start with &Windows
ta_in: & விண்டோசுடன் தொடங்குங்கள்

source: Starting externals...
ta_in: வெளிப்புறங்களைத் தொடங்குகிறது ...

source: Starts the diff viewer with the currently selected file and the one marked before for diffing later.
ta_in: தற்போது தேர்ந்தெடுக்கப்பட்ட கோப்புடன் வேறுபட்ட பார்வையாளரைத் தொடங்குகிறது மற்றும் பின்னர் பரவுவதற்கு முன் குறிக்கப்பட்டுள்ளது.

source: Starts the merge tool where you can resolve the property conflict
ta_in: சொத்து மோதலை நீங்கள் தீர்க்கக்கூடிய ஒன்றிணைக்கும் கருவியைத் தொடங்குகிறது

source: Starts the property dialog where you can edit the property manually.
ta_in: சொத்து உரையாடலைத் தொடங்குகிறது, அங்கு நீங்கள் சொத்தை கைமுறையாக திருத்தலாம்.

source: State
ta_in: நிலை

source: Statistics
ta_in: புள்ளிவிவரங்கள்

source: Status
ta_in: நிலை

source: Status Bar
ta_in: நிலைமை பட்டை

source: Status and action colors
ta_in: நிலை மற்றும் செயல் வண்ணங்கள்

source: Status cache
ta_in: நிலை கேச்

source: Status cache kept in an external process, can show the overlay recursively
ta_in: வெளிப்புற செயல்பாட்டில் வைக்கப்பட்டுள்ள நிலை தற்காலிக சேமிப்பு, மேலடுக்கை மீண்டும் காட்டலாம்

source: Status cache only for one folder, no recursive overlays
ta_in: நிலை கேச் ஒரு கோப்புறைக்கு மட்டுமே, சுழல்நிலை மேலடுக்குகள் இல்லை

source: Status of item in SVN
ta_in: எச்.வி.என் இல் உருப்படியின் நிலை

source: Steal loc&k
ta_in: எஃகு பூட்டு

source: Steal the lock
ta_in: பூட்டைத் திருடுங்கள்

source: Stefan Küng, Lübbe Onken
ta_in: ச்டீபன் கோங், லாபே ஒங்கன்

source: Store pristine copies in working copy
ta_in: வேலை நகலில் அழகிய நகல்களை சேமிக்கவும்

source: Stores the path of the file to be used for a diff on a later right-click. Hold down the Ctrl key to remove the last saved path.
ta_in: வலது சொடுக்கு செய்வதில் வேறுபாட்டிற்கு பயன்படுத்த வேண்டிய கோப்பின் பாதையை சேமிக்கிறது. கடைசியாக சேமித்த பாதையை அகற்ற கட்டுப்பாடு விசையை அழுத்திப் பிடித்துக் கொள்ளுங்கள்.

source: Stripes
ta_in: கோடுகள்

source: Sub-string filter: * Specify one or more strings, separated by spaces. They will be evaluated left to right. * Put a - in front of a sub-string to exclude revisions that contain this sub-string. * Put a + in front of a sub-string to include revisions that may not match the filter so far. * Enclose strings that contain spaces etc. with ". * Put a ! at the beginning of the line to invert the whole filter condition. Examples: myname 2008 : my commits of 2008 .h -.cpp : commits that changed headers but no implementations .doc +.xls 2010 : commits from 2010 with .doc or .xls files in it " " : commits with spaces (ex. when searching in paths only) -""show all"" : commits that don't contain the string "show all" !myname .cpp : everything but my commits to .cpp files
ta_in: சப்-சரம் வடிகட்டி: * இடைவெளிகளால் பிரிக்கப்பட்ட ஒன்று அல்லது அதற்கு மேற்பட்ட சரங்களைக் குறிப்பிடவும். அவை இடமிருந்து வலமாக மதிப்பீடு செய்யப்படும். * இந்த துணை சரம் கொண்ட திருத்தங்களை விலக்க ஒரு துணை சரத்தின் முன் ஒரு-வைக்கவும். * இதுவரை வடிப்பானுடன் பொருந்தாத திருத்தங்களைச் சேர்க்க A + ஐ துணை சரத்தின் முன் வைக்கவும். * இடைவெளிகளைக் கொண்டிருக்கும் சரங்களை "உடன் இணைக்கவும். * ஒரு போடு! முழு வடிகட்டி நிலையையும் மாற்ற வரியின் தொடக்கத்தில். எடுத்துக்காட்டுகள்: MyName 2008: எனது கம்யூட்ச் ஆஃப் 2008 .h -.cpp: தலைப்புகளை மாற்றியமைத்தது ஆனால் செயலாக்கங்கள் இல்லை .doc +.xls 2010: 2010 முதல் .doc அல்லது .xls கோப்புகளுடன் செய்யப்படுகிறது "": இடைவெளிகளுடன் கம்யூச் (எ.கா. பாதைகளில் மட்டுமே தேடும்போது) -"" அனைத்தையும் காட்டு "": சரம் இல்லாத கமிட்டுகள் "அனைத்தையும் காட்டு" ! MyName .cpp: .cpp கோப்புகளுக்கு எனது கம்ஃபிட்ச் தவிர எல்லாமே

source: Subversion
ta_in: கீழ்ப்படிதல்

source: Subversion configuration &file:
ta_in: சப்வர்சன் உள்ளமைவு கோப்பு:

source: Subversion encountered a serious problem. Please take the time to report this on the Subversion mailing list with as much information as possible about what you were trying to do. But please first search the mailing list archives for the error message to avoid reporting the same problem repeatedly. You can find the mailing list archives at https://subversion.apache.org/mailing-lists.html Subversion encountered the problem in: file %1!ls!, line %2!ld! expression = %3!ls! you can copy the content of this dialog to the clipboard using Ctrl-C.
ta_in: கீழ்ப்படிதல் ஒரு கடுமையான சிக்கலை எதிர்கொண்டது. இதை சப்வர்சன் அஞ்சல் பட்டியலில் புகாரளிக்க நேரம் ஒதுக்குங்கள் எதைப் பற்றி முடிந்தவரை தகவலுடன் நீங்கள் செய்ய முயற்சித்தீர்கள். ஆனால் முதலில் பிழை செய்திக்கு அஞ்சல் பட்டியல் காப்பகங்களைத் தேடுங்கள் அதே பிரச்சினையை மீண்டும் புகாரளிப்பதைத் தவிர்க்க. அஞ்சல் பட்டியல் காப்பகங்களை நீங்கள் காணலாம் https://subversion.apache.org/mailing-lists.html அடிபடு சிக்கலை எதிர்கொண்டது: கோப்பு %1! LS !, வரி %2! LD! வெளிப்பாடு = %3! ls! இந்த உரையாடலின் உள்ளடக்கத்தை நீங்கள் நகலெடுக்கலாம் Ctrl-C ஐப் பயன்படுத்தி கிளிப்போர்டுக்கு.

source: Subversion encountered a serious problem. Please take the time to report this on the Subversion mailing list with as much information as possible about what you were trying to do. But please first search the mailing list archives for the error message to avoid reporting the same problem repeatedly. You can find the mailing list archives at https://subversion.apache.org/mailing-lists.html Subversion reported the following (you can copy the content of this dialog to the clipboard using Ctrl-C):
ta_in: கீழ்ப்படிதல் ஒரு கடுமையான சிக்கலை எதிர்கொண்டது. இதை சப்வர்சன் அஞ்சல் பட்டியலில் புகாரளிக்க நேரம் ஒதுக்குங்கள் எதைப் பற்றி முடிந்தவரை தகவலுடன் நீங்கள் செய்ய முயற்சித்தீர்கள். ஆனால் முதலில் பிழை செய்திக்கு அஞ்சல் பட்டியல் காப்பகங்களைத் தேடுங்கள் அதே பிரச்சினையை மீண்டும் புகாரளிப்பதைத் தவிர்க்க. அஞ்சல் பட்டியல் காப்பகங்களை நீங்கள் காணலாம் https://subversion.apache.org/mailing-lists.html கீழ்ப்படிதல் பின்வருவனவற்றைப் புகாரளித்தது (இந்த உரையாடலின் உள்ளடக்கத்தை நீங்கள் நகலெடுக்கலாம் Ctrl-C ஐப் பயன்படுத்தி கிளிப்போர்டுக்கு):

source: Subversion passwor&d
ta_in: சப்வர்சன் பாச்வொர்க் & டி

source: Subversion reported an error while creating a repository! Make sure the folder is empty and not write protected.
ta_in: ஒரு களஞ்சியத்தை உருவாக்கும் போது சப்வர்சன் ஒரு பிழையைப் புகாரளித்தது! கோப்புறை காலியாக இருப்பதை உறுதிசெய்து, பாதுகாக்கப்படாமல் எழுதுங்கள்.

source: Subversion reported an error:
ta_in: கீழ்ப்படிதல் ஒரு பிழையைப் புகாரளித்தது:

source: Subversion server file:
ta_in: சப்வர்சன் சர்வர் கோப்பு:

source: Success
ta_in: செய்

source: Swit&ch working copy to new branch/tag
ta_in: வேலை நகலை புதிய கிளை/குறிச்சொல்லுக்கு மாற்றவும்

source: Switch
ta_in: ஆளி, நிலைமாறி

source: Switch %1!ls! to %2!ls!, Revision %3!ls!
ta_in: %1! Ls! பெறுநர் %2! ls !, திருத்தம் %3! ls!

source: Switch Depth
ta_in: ஆழம் சுவிட்ச்

source: Switch To Branch / Tag
ta_in: கிளை / குறிச்சொல்லுக்கு மாறவும்

source: Switch back to parent
ta_in: பெற்றோரிடம் திரும்பவும்

source: Switch back to the previous window pane Previous Pane
ta_in: முந்தைய சாளர பலகத்திற்கு மாறவும் முந்தைய பலகம்

source: Switch between single and double pane view
ta_in: ஒற்றை மற்றும் இரட்டை பலக பார்வைக்கு இடையில் மாறவும்

source: Switch between single and double pane view Switch between single and double pane view
ta_in: ஒற்றை மற்றும் இரட்டை பலக பார்வைக்கு இடையில் மாறவும் ஒற்றை மற்றும் இரட்டை பலக பார்வைக்கு இடையில் மாறவும்

source: Switch left and right view
ta_in: இடது மற்றும் வலது காட்சியை மாற்றவும்

source: Switch the contents of the left and right view Switch left and right view
ta_in: இடது மற்றும் வலது பார்வையின் உள்ளடக்கங்களை மாற்றவும் இடது மற்றும் வலது காட்சியை மாற்றவும்

source: Switch to the next document window
ta_in: அடுத்த ஆவண சாளரத்திற்கு மாறவும்

source: Switch to the next window pane Next Pane
ta_in: அடுத்த சாளர பலகத்திற்கு மாறவும் அடுத்த பலகம்

source: Switch to the previous document window
ta_in: முந்தைய ஆவண சாளரத்திற்கு மாறவும்

source: Switch working copy to another branch / tag
ta_in: வேலை நகலை மற்றொரு கிளை / குறிச்சொல்லுக்கு மாற்றவும்

source: Switch:
ta_in: சொடுக்கி:

source: Switched
ta_in: சுவிட்ச்

source: Switches the comparison left<->right
ta_in: இடது <-> வலது ஒப்பீட்டை மாற்றுகிறது

source: Sync
ta_in: ஒத்திசைவு

source: Sync setup
ta_in: அமைவு ஒத்திசைவு

source: Sync stored auth data
ta_in: சேமிக்கப்பட்ட அங்கீகார தரவை ஒத்திசைக்கவும்

source: System &sounds
ta_in: கணினி & ஒலிகள்

source: System registry entries have been removed and the INI file (if any) was deleted.
ta_in: கணினி பதிவு உள்ளீடுகள் அகற்றப்பட்டு, ஐ.என்.ஐ கோப்பு (ஏதேனும் இருந்தால்) நீக்கப்பட்டது.

source: TORTOISEBLAME
ta_in: ஆமை

source: TORTOISEIDIFF
ta_in: ஆமை எய்டிஃப்

source: Tab size:
ta_in: தாவல் அளவு:

source: Tag nodes
ta_in: குறிச்சொல் முனைகள்

source: Target folder is not empty
ta_in: இலக்கு கோப்புறை காலியாக இல்லை

source: Tasks
ta_in: பணிகள்

source: Test Only
ta_in: சோதனை மட்டும்

source: Test the regex strings
ta_in: ரீசெக்ச் சரங்களை சோதிக்கவும்

source: Text Status:
ta_in: உரை நிலை:

source: Text status
ta_in: உரை நிலை

source: The changes will be applied to your working copy with a reverse merge operation. The repository won't be affected. You can review the changes before you commit them.
ta_in: மாற்றங்கள் உங்கள் வேலை நகலில் தலைகீழ் ஒன்றிணைப்பு செயல்பாட்டுடன் பயன்படுத்தப்படும். களஞ்சியம் பாதிக்கப்படாது. மாற்றங்களை நீங்கள் செய்வதற்கு முன்பு அவற்றை மதிப்பாய்வு செய்யலாம்.

source: The chunk size did not match the number of added/removed lines!
ta_in: சேர்க்கப்பட்ட/அகற்றப்பட்ட வரிகளின் எண்ணிக்கையுடன் துண்டின் அளவு பொருந்தவில்லை!

source: The color of creation, copy and rename nodes of tags will be shifted towards yellow.
ta_in: குறிச்சொற்களின் உருவாக்கம், நகல் மற்றும் மறுபெயரிடுதல் ஆகியவற்றின் நிறம் மஞ்சள் நோக்கி மாற்றப்படும்.

source: The color of creation, copy and rename nodes of the trunk will be shifted towards green.
ta_in: உடற்பகுதியின் உருவாக்கம், நகல் மற்றும் மறுபெயரிடு ஆகியவற்றின் நிறம் பச்சை நோக்கி மாற்றப்படும்.

source: The default URL to checkout from if nothing else is specified
ta_in: வேறு எதுவும் குறிப்பிடப்படாவிட்டால் புதுப்பிக்க இயல்புநிலை முகவரி

source: The default path to checkout to if nothing else is specified
ta_in: வேறு எதுவும் குறிப்பிடப்படாவிட்டால் புதுப்பிப்பதற்கான இயல்புநிலை பாதை

source: The depth of this commit is "%ls", but copies are always performed recursively in the repository.
ta_in: இந்த உறுதிப்பாட்டின் ஆழம் "%எல்.எச்", ஆனால் பிரதிகள் எப்போதும் களஞ்சியத்தில் மீண்டும் செய்யப்படுகின்றன.

source: The diffing engine aborted because of an error: %ls
ta_in: பிழை காரணமாக மாறுபடும் இயந்திரம் கைவிடப்பட்டது: %ls

source: The file %ls does not exist!
ta_in: %Ls கோப்பு இல்லை!

source: The file %ls is not versioned. How do you want to proceed?
ta_in: %LS கோப்பு பதிப்பு செய்யப்படவில்லை. நீங்கள் எவ்வாறு தொடர விரும்புகிறீர்கள்?

source: The file %ls was not found in the patch file!
ta_in: %எல்எச் கோப்பு ஒட்டு கோப்பில் காணப்படவில்லை!

source: The file %ls is empty. Do you want to remove the file?
ta_in: கோப்பு %ls காலியாக உள்ளது. கோப்பை அகற்ற விரும்புகிறீர்களா?

source: The file is too big
ta_in: கோப்பு மிகப் பெரியது

source: The file is too large to open.
ta_in: கோப்பு திறக்க முடியாத அளவுக்கு பெரியது.

source: The file or directory "%ls" already exists at the drop location! You have to remove it first before you can add an external there with the same name.
ta_in: "%LS" கோப்பு அல்லது அடைவு ஏற்கனவே துளி இருப்பிடத்தில் உள்ளது! அதே பெயருடன் வெளிப்புறத்தை சேர்ப்பதற்கு முன்பு நீங்கள் அதை முதலில் அகற்ற வேண்டும்.

source: The file %ls already exists! Do you want to overwrite it?
ta_in: கோப்பு %ls ஏற்கனவே இருக்கிறது! நீங்கள் அதை மேலெழுத விரும்புகிறீர்களா?

source: The file %ls is not a valid text file!
ta_in: கோப்பு %ls சரியான உரை கோப்பு அல்ல!

source: The folder %ls already exists!
ta_in: கோப்புறை %ls ஏற்கனவே இருக்கிறது!

source: The hook script executed successfully
ta_in: ஊக் ச்கிரிப்ட் வெற்றிகரமாக செயல்படுத்தப்பட்டது

source: The hook script returned an error: %ls
ta_in: ஊக் ச்கிரிப்ட் ஒரு பிழையைத் தந்தது: %ls

source: The hook script was not approved to run
ta_in: ஊக் ச்கிரிப்ட் இயக்க அங்கீகரிக்கப்படவில்லை

source: The image can not be shown.
ta_in: படத்தைக் காட்ட முடியாது.

source: The issue-tracker provider could not be created. Please check that it is installed correctly.
ta_in: வெளியீடு-கண்காணிப்பு வழங்குநரை உருவாக்க முடியவில்லை. அது சரியாக நிறுவப்பட்டுள்ளதா என்பதை சரிபார்க்கவும்.

source: The issue-tracker provider was unable to validate the parameter string
ta_in: வெளியீடு-கண்காணிப்பு வழங்குநரால் அளவுரு சரத்தை சரிபார்க்க முடியவில்லை

source: The item '%ls' has property conflicts: %ls
ta_in: '%LS' உருப்படி சொத்து மோதல்களைக் கொண்டுள்ளது: %ls

source: The line '====' was expected in line %d!
ta_in: '====' வரி %d வரிசையில் எதிர்பார்க்கப்பட்டது!

source: The line 'Index: ' was not found! Either this is not a diff file or the diff is empty.
ta_in: 'குறியீட்டு:' வரி காணப்படவில்லை! ஒன்று இது ஒரு வேறுபட்ட கோப்பு அல்ல அல்லது வேறுபாடு காலியாக உள்ளது.

source: The line indicating the new file was expected in line %d!
ta_in: புதிய கோப்பைக் குறிக்கும் வரி %d வரிசையில் எதிர்பார்க்கப்பட்டது!

source: The line number must be in between %d and %d
ta_in: வரி எண் %d மற்றும் %d க்கு இடையில் இருக்க வேண்டும்

source: The lock has already been broken from another working copy
ta_in: மற்றொரு வேலை நகலில் இருந்து பூட்டு ஏற்கனவே உடைக்கப்பட்டுள்ளது

source: The maximum number of action log lines to keep. Any lines added over this limit will remove the oldest lines from the file.
ta_in: வைத்திருக்க அதிகபட்ச செயல் பதிவு கோடுகள். இந்த வரம்பில் சேர்க்கப்பட்ட எந்த வரிகளும் கோப்பிலிருந்து பழமையான வரிகளை அகற்றும்.

source: The operation failed.
ta_in: செயல்பாடு தோல்வியடைந்தது.

source: The parameters '/path' and '/pathfile' are mutually exclusive. You must only specify one of them.
ta_in: அளவுருக்கள் '/பாதை' மற்றும் '/பாத்ஃபைல்' இருவழி. அவற்றில் ஒன்றை மட்டுமே நீங்கள் குறிப்பிட வேண்டும்.

source: The password is wrong. Please enter the correct password in the settings dialog.
ta_in: கடவுச்சொல் தவறு. அமைப்புகள் உரையாடலில் சரியான கடவுச்சொல்லை உள்ளிடவும்.

source: The passwords don't match
ta_in: கடவுச்சொற்கள் பொருந்தவில்லை

source: The patch seems outdated! The file line %1!ls! and the patchline %2!ls! do not match!
ta_in: இணைப்பு காலாவதியானதாகத் தெரிகிறது! கோப்பு வரி %1! Ls! மற்றும் பேட்ச்லைன் %2! Ls! பொருந்தவில்லை!

source: The path/URL '%ls' seems to be illegal on Windows! You can try it anyway, but you might get an error later.
ta_in: பாதை/url '%ls' சன்னல்களில் சட்டவிரோதமானது என்று தெரிகிறது! நீங்கள் எப்படியும் முயற்சி செய்யலாம், ஆனால் பின்னர் பிழையைப் பெறலாம்.
