Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: (modified, HEAD revision)
ta_in: (மாற்றியமைக்கப்பட்ட, தலை திருத்தம்)

source: (multiple targets selected)
ta_in: (பல இலக்குகள் தேர்ந்தெடுக்கப்பட்டன)

source: (no changelist)
ta_in: (சேஞ்சலிச்ட் இல்லை)

source: (no line number)
ta_in: (வரி எண் இல்லை)

source: (no modification but copy created from here)
ta_in: (மாற்றம் இல்லை, ஆனால் இங்கிருந்து உருவாக்கப்பட்ட நகல்)

source: (no modification but relevant for working copy)
ta_in: (மாற்றியமில்லை ஆனால் வேலை நகலுக்கு பொருத்தமானது)

source: (no value)
ta_in: (மதிப்பில்லை)

source: (not found)
ta_in: (கிடைக்கவில்லை)

source: (properties only)
ta_in: (பண்புகள் மட்டும்)

source: (property change only)
ta_in: (சொத்து மாற்றம் மட்டுமே)

source: (props and content)
ta_in: (முட்டுகள் மற்றும் உள்ளடக்கம்)

source: (rename)
ta_in: (மறுபெயர்)

source: (tagged)
ta_in: (குறித்துள்ளார்)

source: (unknown)
ta_in: (தெரியவில்லை)

source: ... checking cache and preparing log query
ta_in: ... தற்காலிக சேமிப்பை சரிபார்த்து, பதிவு வினவலைத் தயாரித்தல்

source: ... reading working copy status
ta_in: ... வேலை நகல் நிலையைப் படித்தல்

source: ...and %d more paths.
ta_in: ... மற்றும் %d மேலும் பாதைகள்.

source: 1 file
ta_in: 1 கோப்பு

source: : Revision %d
ta_in: : திருத்தம் %d

source: : working copy
ta_in: : நகல் வேலை

source: < &Back
ta_in: <& பின்

source: <new changelist>
ta_in: <புதிய சேஞ்சலிச்ட்>

source: A list of user defined properties for files to show in the combo box
ta_in: காம்போ பெட்டியில் காண்பிக்க கோப்புகளுக்கான பயனர் வரையறுக்கப்பட்ட பண்புகளின் பட்டியல்

source: A list of user defined properties for folders to show in the combo box
ta_in: காம்போ பெட்டியில் காண்பிக்க கோப்புறைகளுக்கான பயனர் வரையறுக்கப்பட்ட பண்புகளின் பட்டியல்

source: A newer version is available. Please go to https://tortoisesvn.net and download the current version.
ta_in: புதிய பதிப்பு கிடைக்கிறது. தயவுசெய்து https://tortoisesvn.net க்குச் சென்று தற்போதைய பதிப்பைப் பதிவிறக்கவும்.

source: A newline separated list of paths for which icon overlays are shown. If you add an '?' char at the end of a path, then only this path will be included. If you add an '*' or no char at all at the end of a path, then all files and subdirs inside that path are included too.
ta_in: படவுரு மேலடுக்குகள் காண்பிக்கப்படும் பாதைகளின் புதிய லைன் பிரிக்கப்பட்ட பட்டியல். நீங்கள் ஒரு '?' ஒரு பாதையின் முடிவில் கரி, பின்னர் இந்த பாதை மட்டுமே சேர்க்கப்படும். ஒரு பாதையின் முடிவில் நீங்கள் ஒரு '*' அல்லது கரி இல்லை என்றால், அந்த பாதையில் உள்ள அனைத்து கோப்புகளும் துணைப்பிரிவுகளும் சேர்க்கப்பட்டுள்ளன.

source: A newline separated list of paths for which no context menu is shown. If you add an '*' char at the end of a path, then all files and subdirs inside that path are excluded too. An empty list will allow the context menu on all paths.
ta_in: சூழல் பட்டியல் எதுவும் காட்டப்படாத பாதைகளின் புதிய லைன் பிரிக்கப்பட்ட பட்டியல். ஒரு பாதையின் முடிவில் நீங்கள் ஒரு '*' கரியைச் சேர்த்தால், அந்த பாதையில் உள்ள அனைத்து கோப்புகளும் துணைப்பிரிவுகளும் விலக்கப்படுகின்றன. வெற்று பட்டியல் அனைத்து பாதைகளிலும் சூழல் மெனுவை அனுமதிக்கும்.

source: A newline separated list of paths for which no icon overlays are shown. If you add an '?' char at the end of a path, then only this path will be excluded. If you add an '*' or no char at all at the end of a path, then all files and subdirs inside that path are excluded too. An empty list will allow overlays on all paths.
ta_in: படவுரு மேலடுக்குகள் எதுவும் காட்டப்படாத பாதைகளின் நியூலைன் பிரிக்கப்பட்ட பட்டியல். நீங்கள் ஒரு '?' ஒரு பாதையின் முடிவில் கரி, பின்னர் இந்த பாதை மட்டுமே விலக்கப்படும். ஒரு பாதையின் முடிவில் நீங்கள் ஒரு '*' அல்லது கரி இல்லை என்றால், அந்த பாதையில் உள்ள அனைத்து கோப்புகளும் துணைப்பிரிவுகளும் விலக்கப்படுகின்றன. வெற்று பட்டியல் எல்லா பாதைகளிலும் மேலடுக்குகளை அனுமதிக்கும்.

source: A relocate is only needed if the path to a repository has changed. Changing to a different path inside a repository is done by a switch operation. If you are not sure what to do, try a switch operation first.
ta_in: ஒரு களஞ்சியத்திற்கான பாதை மாறிவிட்டால் மட்டுமே ஒரு இடமாற்றம் தேவைப்படுகிறது. ஒரு களஞ்சியத்திற்குள் வேறு பாதையில் மாறுவது ஒரு சுவிட்ச் செயல்பாட்டின் மூலம் செய்யப்படுகிறது. என்ன செய்வது என்று உங்களுக்குத் தெரியாவிட்டால், முதலில் ஒரு சுவிட்ச் செயல்பாட்டை முயற்சிக்கவும்.

source: A required resource was unavailable.
ta_in: தேவையான சான்று கிடைக்கவில்லை.

source: A valid path on windows must not contain '<>|"?*:' or one of the following device names: com1-com9, lpt1-lpt9, prn, aux, con, nul, clock$ See the <a href="http://msdn.microsoft.com/en-us/library/aa365247%28VS.85%29.aspx">documentation</a> from Microsoft about this.
ta_in: சாளரங்களில் செல்லுபடியாகும் பாதையில் '<> | "?*:' அல்லது பின்வரும் சாதன பெயர்களில் ஒன்று இருக்கக்கூடாது: COM1-COM9, LPT1-LPT9, PRN, AUX, CON, NUL, கடிகை $ <a href="http://msdn.microsoft.com/en-us/library/aa365247%28vs.85%29.aspx"> ஆவணங்கள் </a> மைக்ரோசாப்டில் இருந்து இது பற்றி.

source: A viewer program for GNU diff files (patch files). If you don't have one use NotePad.
ta_in: குனு டிஃப் கோப்புகளுக்கான பார்வையாளர் நிரல் (பேட்ச் கோப்புகள்). உங்களிடம் ஒரு பயன்பாடு நோட்பேட் இல்லையென்றால்.

source: A&dd folder...
ta_in: ஏ & டிடி கோப்புறை ...

source: Abort
ta_in: கலைப்பு

source: Abou&t TortoiseMerge
ta_in: ஆமைஒன்றிணை பற்றி

source: About
ta_in: பற்றி

source: About TortoiseMerge
ta_in: ஆமைஒன்றிணை பற்றி

source: About TortoiseSVN
ta_in: ஆமைதுபபு பற்றி

source: Accept the certificate &permanently You won't get asked about this certificate again.
ta_in: சான்றிதழை மற்றும் நிரந்தரமாக ஏற்றுக்கொள்ளுங்கள் இந்த சான்றிதழ் பற்றி நீங்கள் மீண்டும் கேட்க மாட்டீர்கள்.

source: Access to %1 was denied.
ta_in: %1 க்கான அணுகல் மறுக்கப்பட்டது.

source: Action
ta_in: செயல்

source: Action log
ta_in: செயல் பதிவு

source: Actions
ta_in: செயல்கள்

source: Activate Task List
ta_in: பணி பட்டியலை செயல்படுத்தவும்

source: ActiveX objects cannot be saved while exiting Windows! Discard all changes to %1?
ta_in: விண்டோசிலிருந்து வெளியேறும் போது ஆக்டிவ்எக்ச் பொருள்களை சேமிக்க முடியாது! அனைத்து மாற்றங்களையும் %1 க்கு நிராகரிக்கவா?

source: Ad&just case The file is not added.
ta_in: விளம்பரம் & சச்ட் கேச் கோப்பு சேர்க்கப்படவில்லை.

source: Add
ta_in: சேர்

source: Add &file...
ta_in: சேர் &கோப்பு...

source: Add '%ls' to dictionary
ta_in: அகராதியில் '%LS' ஐச் சேர்க்கவும்

source: Add (as replacement)...
ta_in: சேர் (மாற்றாக) ...

source: Add Properties
ta_in: பண்புகளைச் சேர்க்கவும்

source: Add extension specific diff program
ta_in: நீட்டிப்பு குறிப்பிட்ட வேறுபாடு நிரலைச் சேர்க்கவும்

source: Add extension specific merge program
ta_in: நீட்டிப்பு குறிப்பிட்ட ஒன்றிணைக்கும் நிரலைச் சேர்க்கவும்

source: Add new files automatically to SVN
ta_in: எச்.வி.என் -க்கு புதிய கோப்புகளை தானாக சேர்க்கவும்

source: Add project or folder here...
ta_in: திட்டம் அல்லது கோப்புறையை இங்கே சேர்க்கவும் ...

source: Add project or folder...
ta_in: திட்டம் அல்லது கோப்புறையைச் சேர்க்கவும் ...

source: Add to %1
ta_in: %1 இல் சேர்க்கவும்

source: Add to &ignore list
ta_in: புறக்கணிப்பு பட்டியலில் சேர்க்கவும்

source: Add to Bookmarks
ta_in: புக்மார்க்குகளில் சேர்க்கவும்

source: Add...
ta_in: சேர்...

source: Add/Edit Extension Specific Diff/Merge Program
ta_in: நீட்டிப்பு குறிப்பிட்ட வேறுபாடு/ஒன்றிணைக்கும் நிரலைச் சேர்க்கவும்/திருத்தவும்

source: Added
ta_in: சேர்க்கப்பட்டது

source: Added node
ta_in: முனை சேர்க்கப்பட்டது

source: Added the file pattern(s) %ls to the global ignore list.
ta_in: கோப்பு முறை (கள்) சேர்க்கப்பட்டது %ls உலகளாவிய புறக்கணிப்பு பட்டியலில்.

source: Added the file pattern(s) %ls to the ignore list.
ta_in: கோப்பு முறை (கள்) சேர்க்கப்பட்டது %ls புறக்கணிப்பு பட்டியலில்.

source: Adding
ta_in: சேர்த்து

source: Adds a new property
ta_in: ஒரு புதிய சொத்தை சேர்க்கிறது

source: Adds file(s) to Subversion control
ta_in: துணை கட்டுப்பாட்டுக்கு கோப்பு (களை) சேர்க்கிறது

source: Adds the selected file(s) or the filemask to the 'ignore' list
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்புகளைச் சேர்க்கவும்) அல்லது கோப்பு முகமூடி 'புறக்கணிக்கவும்' பட்டியலில்

source: Adjust the settings Settings
ta_in: அமைப்புகளை சரிசெய்யவும் அமைப்புகள்

source: Adjust to HEAD revision
ta_in: தலை திருத்தத்திற்கு சரிசெய்யவும்

source: Advanced
ta_in: மேம்பட்ட

source: Advanced Diff/Merge Settings
ta_in: மேம்பட்ட வேறுபாடு/ஒன்றிணைக்கும் அமைப்புகள்

source: Advanced diff settings
ta_in: மேம்பட்ட வேறுபாடு அமைப்புகள்

source: Advanced merge settings
ta_in: மேம்பட்ட ஒன்றிணைப்பு அமைப்புகள்

source: Affected &files:
ta_in: பாதிக்கப்பட்ட & கோப்புகள்:

source: Age
ta_in: அகவை

source: Align trees on top
ta_in: மேலே மரங்களை சீரமைக்கவும்

source: All
ta_in: முழுவதும்

source: All Files (*.*)
ta_in: அனைத்து கோப்புகள் (*.*)

source: All Files (*.*)|*.*||
ta_in: எல்லா கோப்புகளும் (*.*) |*.*||

source: Allow Editing for this view Allow Edit
ta_in: இந்த பார்வைக்கு திருத்துதல் அனுமதிக்கவும் திருத்து அனுமதிக்கவும்

source: Allow ambiguous &UUIDs
ta_in: தெளிவற்ற மற்றும் uuids ஐ அனுமதிக்கவும்

source: Allow different repositories to use the same URL, e.g. http://localhost/myrepos/
ta_in: ஒரே முகவரி ஐப் பயன்படுத்த வெவ்வேறு களஞ்சியங்களை அனுமதிக்கவும், எ.கா. http: // localhost/myrepopes/

source: Allow different repositories to use the same UUID, e.g. copied repositories
ta_in: ஒரே UUID ஐப் பயன்படுத்த வெவ்வேறு களஞ்சியங்களை அனுமதிக்கவும், எ.கா. நகலெடுத்த களஞ்சியங்கள்

source: Allow mixed revisions (not recommended)
ta_in: கலப்பு திருத்தங்களை அனுமதிக்கவும் (பரிந்துரைக்கப்படவில்லை)

source: Already merged
ta_in: ஏற்கனவே இணைக்கப்பட்டுள்ளது

source: Already reverse merged
ta_in: ஏற்கனவே தலைகீழ் ஒன்றிணைந்தது

source: Always close dialogs for local operations
ta_in: உள்ளக செயல்பாடுகளுக்கான உரையாடல்களை எப்போதும் மூடு

source: Always execute the script
ta_in: எப்போதும் ச்கிரிப்டை இயக்கவும்

source: Always use the system locale settings to show times and dates
ta_in: நேரங்களையும் தேதிகளையும் காட்ட எப்போதும் கணினி இருப்பிட அமைப்புகளைப் பயன்படுத்தவும்

source: Amount of memory required to load the cache
ta_in: தற்காலிக சேமிப்பை ஏற்ற தேவையான நினைவகத்தின் அளவு

source: An external diff program used for comparing different revisions of files You can specify the following parameters to the path: %base : the base file %mine : the modified file
ta_in: பயன்படுத்தப்படும் வெளிப்புற வேறுபாடு நிரல் கோப்புகளின் வெவ்வேறு திருத்தங்களை ஒப்பிடுவதற்கு பின்வரும் அளவுருக்களை பாதையில் குறிப்பிடலாம்: %அடிப்படை: அடிப்படை கோப்பு %என்னுடையது: மாற்றியமைக்கப்பட்ட கோப்பு

source: An external merge program used to resolve conflicted files. You can specify the following parameters to the path: %merged : the conflicted file, where to save %theirs : the file as it is in the repository %mine : your own file, with your changes %base : the original file without your changes
ta_in: பயன்படுத்தப்படும் வெளிப்புற ஒன்றிணைப்பு நிரல் முரண்பட்ட கோப்புகளைத் தீர்க்க. பின்வரும் அளவுருக்களை பாதையில் குறிப்பிடலாம்: %ஒன்றிணைந்தது: முரண்பட்ட கோப்பு, எங்கு சேமிக்க வேண்டும் %அவற்றின்: கோப்பு களஞ்சியத்தில் உள்ளது %என்னுடையது: உங்கள் சொந்த கோப்பு, உங்கள் மாற்றங்களுடன் %அடிப்படை: உங்கள் மாற்றங்கள் இல்லாமல் அசல் கோப்பு

source: An incorrect file handle was associated with %1.
ta_in: தவறான கோப்பு கைப்பிடி %1 உடன் தொடர்புடையது.

source: An unknown error has occurred.
ta_in: அறியாத தவறு ஒன்று நிகழ்ந்து உள்ளது.

source: An unknown error occurred while accessing %1.
ta_in: %1 ஐ அணுகும்போது அறியப்படாத பிழை ஏற்பட்டது.

source: An unknown line type was found in line %d!
ta_in: அறியப்படாத வரி வகை %d வரிசையில் காணப்பட்டது!

source: Another process is blocking the working copy database, or the underlying filesystem does not support file locking; if the working copy is on a network filesystem, make sure file locking has been enabled on the file server.
ta_in: மற்றொரு செயல்முறை வேலை செய்யும் நகல் தரவுத்தளத்தைத் தடுப்பது, அல்லது அடிப்படை கோப்பு முறைமை கோப்பு பூட்டுதலை ஆதரிக்காது; பணிபுரியும் நகல் பிணைய கோப்பு முறைமையில் இருந்தால், கோப்பு சேவையகத்தில் கோப்பு பூட்டுதல் இயக்கப்பட்டிருப்பதை உறுதிசெய்க.

source: Append right block
ta_in: வலது தொகுதி சேர்க்கவும்

source: Append this block to left
ta_in: இந்த தொகுதியை இடதுபுறமாக சேர்க்கவும்

source: Applies a unified diff file to the working copy
ta_in: வேலை செய்யும் நகலுக்கு ஒருங்கிணைந்த வேறுபாடு கோப்பைப் பயன்படுத்துகிறது

source: Apply &patch...
ta_in: விண்ணப்பிக்கவும் & இணைப்பு ...

source: Apply 'Power User' defaults. Those will provide a smoother experience. You should know the meaning of all the settings above.
ta_in: 'பவர் பயனர்' இயல்புநிலைகளைப் பயன்படுத்துங்கள். அவை மென்மையான அனுபவத்தை வழங்கும். மேலே உள்ள அனைத்து அமைப்புகளின் அர்த்தத்தையும் நீங்கள் அறிந்து கொள்ள வேண்டும்.

source: Apply Patch...
ta_in: பேட்சைப் பயன்படுத்துங்கள் ...

source: Apply unified diff
ta_in: ஒருங்கிணைந்த வேறுபாட்டைப் பயன்படுத்துங்கள்

source: Approve or reject client-side hook script
ta_in: கிளையன்ட் பக்க ஊக் ச்கிரிப்டை அங்கீகரிக்கவும் அல்லது நிராகரிக்கவும்

source: Approved hook scripts
ta_in: அங்கீகரிக்கப்பட்ட ஊக் ச்கிரிப்ட்கள்

source: Arb&itrary text
ta_in: ARB & itrary உரை

source: Are you sure you want to mark the conflicted file(s) as resolved?
ta_in: முரண்பட்ட கோப்பு (களை) தீர்க்கப்பட்டதாகக் குறிக்க விரும்புகிறீர்களா?

source: Are you sure you want to remove the cache of the selected %d items?
ta_in: தேர்ந்தெடுக்கப்பட்ட %d உருப்படிகளின் தற்காலிக சேமிப்பை அகற்ற விரும்புகிறீர்களா?

source: Are you sure you want to revert %d item(s)? You will lose all changes since the last update!
ta_in: %d உருப்படி (களை) மாற்ற விரும்புகிறீர்களா? கடைசி புதுப்பிப்பிலிருந்து நீங்கள் அனைத்து மாற்றங்களையும் இழப்பீர்கள்!

source: Arrange &vertical (V)
ta_in: ஏற்பாடு & செங்குத்து (வி)

source: As &is (no specific EOL)
ta_in: அச் & IS (குறிப்பிட்ட EOL இல்லை)

source: Ask the user
ta_in: பயனரிடம் கேளுங்கள்

source: Asks for a specific revision, then shows the log for that revision no matter what branch it is in.
ta_in: ஒரு குறிப்பிட்ட திருத்தத்தைக் கேட்கிறது, பின்னர் அந்த திருத்தத்திற்கான பதிவை எந்த கிளையில் இருந்தாலும் காட்டுகிறது.

source: Assigned to changelist '%ls'
ta_in: சேஞ்ச்லிச்ட் '%எல்.எச்' க்கு ஒதுக்கப்பட்டுள்ளது

source: At revision: %d
ta_in: திருத்தத்தில்: %d

source: Attempted an unsupported operation.
ta_in: ஆதரிக்கப்படாத செயல்பாட்டை முயற்சித்தது.

source: Attempted to access %1 past its end.
ta_in: அதன் முடிவைக் கடந்த %1 ஐ அணுக முயற்சித்தது.

source: Attempted to read from the writing %1.
ta_in: எழுதப்பட்ட %1 இலிருந்து படிக்க முயற்சித்தது.

source: Attempted to write to the reading %1.
ta_in: %1 வாசிப்புக்கு எழுத முயற்சித்தது.

source: Authentication
ta_in: அங்கீகார

source: Authentication data
ta_in: அங்கீகார தரவு

source: Author
ta_in: ஆசிரியர்

source: Author: Stefan Kueng
ta_in: ஆசிரியர்: Stefan Kueng

source: Authors
ta_in: ஆசிரியர்கள்

source: Authors case sensitive
ta_in: ஆசிரியர்கள் வழக்கு உணர்திறன்

source: Authors:
ta_in: ஆசிரியர்கள்:

source: Auto-Merge
ta_in: தானாக இணை

source: Auto-close if no conflicts
ta_in: எந்த மோதலும் இல்லை என்றால் தானாக மூடிமறைக்கவும்

source: Auto-close if no errors
ta_in: பிழைகள் இல்லாவிட்டால் தானாக மூடிமறைக்கவும்

source: Auto-close if no merges, adds or deletes
ta_in: ஒன்றும் ஒன்றிணைக்கவில்லை, சேர்க்கவில்லை அல்லது நீக்குகிறது என்றால் தானாக மூடிமறைக்கவும்

source: Auto-complete suggests words (usually class or member names) from the files that you have changed as you type a log message.
ta_in: ஆட்டோ-முழுமையான சொற்களைக் குறிக்கிறது (பொதுவாக வகுப்பு அல்லது உறுப்பினர் பெயர்கள்) நீங்கள் ஒரு பதிவு செய்தியைத் தட்டச்சு செய்யும் போது நீங்கள் மாற்றிய கோப்புகளிலிருந்து.

source: Auto-merge %1!ls! into %2!ls!
ta_in: ஆட்டோ-மெர்ச் %1! Ls! %2! ls!

source: Automatic
ta_in: தானியங்கி

source: Autotext Tester
ta_in: ஆட்டோடெக்ச்ட் சோதனையாளர்

source: Average
ta_in: சராசரி

source: B&rowse...
ta_in: &உலவு...

source: Background
ta_in: பின்புலம்

source: Backwards in browsing history
ta_in: உலாவல் வரலாற்றில் பின்னோக்கி

source: Bar Graph
ta_in: சட்ட வரைபடம்

source: Base file:
ta_in: தள கோப்பு:

source: Bitmap a bitmap
ta_in: பிட்மேப் ஒரு பிட்மேப்

source: Blame
ta_in: பழி

source: Blame - TortoiseSVN
ta_in: பழி - ஆமை

source: Blame...
ta_in: பழி ...

source: Blames each line of a file on an author
ta_in: ஒரு எழுத்தாளரின் கோப்பின் ஒவ்வொரு வரியையும் குற்றம் சாட்டுகிறது

source: Blend alpha
ta_in: ஆல்பாவைக் கலக்கவும்

source: Blocks
ta_in: தொகுதிகள்

source: Bookmarks
ta_in: புக்மார்க்குகள்

source: Both /logmsg and /logmsgfile were specified! Only one of those can be specified.
ta_in: /Logmsg மற்றும் /logmsgfile இரண்டும் குறிப்பிடப்பட்டன! அவற்றில் ஒன்றை மட்டுமே குறிப்பிட முடியும்.

source: Both the path to the patch file and the target path must be absolute paths!
ta_in: ஒட்டு கோப்பிற்கான பாதை மற்றும் இலக்கு பாதை இரண்டும் முழுமையான பாதைகளாக இருக்க வேண்டும்!

source: Bottom View:
ta_in: கீழே பார்வை:

source: Br&owse...
ta_in: &உலவு...

source: Branch / tag created successfully!
ta_in: கிளை / குறிச்சொல் வெற்றிகரமாக உருவாக்கப்பட்டது!

source: Branch at copy-from-rev even if there was no change in that revision
ta_in: அந்த திருத்தத்தில் எந்த மாற்றமும் இல்லாவிட்டாலும் கூட நகல்-ரெவிலிருந்து கிளை

source: Branch/&tag...
ta_in: கிளை/& குறிச்சொல் ...

source: Break loc&k
ta_in: லாக் & கே

source: Brings a shelved change back to the working copy
ta_in: வேலை செய்யும் நகலுக்கு ஒரு நிறுத்தப்பட்ட மாற்றத்தை மீண்டும் கொண்டுவருகிறது

source: Browse...
ta_in: உலவு...

source: Bug-&ID / Issue-Nr:
ta_in: பிழை- & ஐடி / வெளியீடு-என்ஆர்:

source: Bug-ID
ta_in: பிழை-ஐடி

source: Bug-ID e&xpression:
ta_in: பிழை-ஐடி இ & எக்ச்பிரசன்:

source: Bug-ID is:
ta_in: பிழை-ஐடி:

source: Bug-IDs
ta_in: பிழை-ஐ.டி.எச்

source: Bug-Urls
ta_in: பிழை-urls

source: Bugtraq Regex Tester - TortoiseSVN
ta_in: பிழைத்திருத்தம் ரீசெக்ச் சோதனையாளர் - ஆமை

source: C&heck now
ta_in: இப்போது சரிபார்க்க

source: C&heck repository
ta_in: சி & எக் களஞ்சியம்

source: C&ollapse sub-trees
ta_in: சி & ஓலாப்ச் துணை மரங்கள்

source: C&ompare URLs (content only)
ta_in: சி & ஓம்பேர் முகவரி கள் (உள்ளடக்கம் மட்டும்)

source: C&reate branch/tag from revision
ta_in: சி & மறுபரிசீலனை கிளை/குறிச்சொல் திருத்தத்திலிருந்து

source: C&reate folder...
ta_in: சி & ரீட் கோப்புறை ...

source: C&ut
ta_in: சி & யுடி

source: CAP
ta_in: தொப்பி

source: Cache size [kB]
ta_in: கேச் அளவு [கே.பி.]

source: Cached Repositories
ta_in: தற்காலிக சேமிப்பு களஞ்சியங்கள்

source: Can double-click in log list to compare with previous revision
ta_in: முந்தைய திருத்தத்துடன் ஒப்பிடுவதற்கு பதிவு பட்டியலில் இருமுறை சொடுக்கு செய்ய முடியும்

source: Can not activate a static ActiveX object.
ta_in: நிலையான ஆக்டிவ்எக்ச் பொருளை செயல்படுத்த முடியாது.

source: Can't copy %1!ls! to %2!ls!
ta_in: நகலெடுக்க முடியாது %1! Ls! பெறுநர் %2! Ls!

source: Cancel
ta_in: ரத்துசெய்

source: Cancel Change the selection for the commit.
ta_in: ரத்துசெய் உறுதிப்பாட்டிற்கான தேர்வை மாற்றவும்.

source: Cancel Don't quit TortoiseMerge
ta_in: ரத்துசெய் ஆமைகளை விட்டு வெளியேற வேண்டாம்

source: Cancel Don't switch the views
ta_in: ரத்துசெய் காட்சிகளை மாற்ற வேண்டாம்

source: Cancel Keep the empty file.
ta_in: ரத்துசெய் வெற்று கோப்பை வைத்திருங்கள்.

source: Cancel Resolve the conflicts first.
ta_in: ரத்துசெய் முதலில் மோதல்களைத் தீர்க்கவும்.

source: Cancel Stay with current files
ta_in: ரத்துசெய் தற்போதைய கோப்புகளுடன் இருங்கள்

source: Cancel Stay with current settings
ta_in: ரத்துசெய் தற்போதைய அமைப்புகளுடன் இருங்கள்

source: Cancel The items are not moved.
ta_in: ரத்துசெய் உருப்படிகள் நகர்த்தப்படவில்லை.

source: Cancel You can enter another password and try again
ta_in: ரத்துசெய் நீங்கள் மற்றொரு கடவுச்சொல்லை உள்ளிட்டு மீண்டும் முயற்சி செய்யலாம்

source: Cancelling TortoiseSVN Blame...
ta_in: ஆமைசிடெச்வன் பழியை ரத்து செய்தல் ...

source: Cancelling operation...
ta_in: செயல்பாடு ரத்துசெய்கிறது ...

source: Cannot show diff because of inconsistent newlines in the file.
ta_in: கோப்பில் சீரற்ற நியூமைன்ச் காரணமாக வேறுபாட்டைக் காட்ட முடியாது.

source: Case-sensitive
ta_in: வழக்கு உணர்திறன்

source: Certificate expired. Valid until: %ls
ta_in: சான்றிதழ் காலாவதியானது. வரை செல்லுபடியாகும்: %ls

source: Certificate not yet valid. Valid from: %ls
ta_in: சான்றிதழ் இன்னும் செல்லுபடியாகாது. இருந்து செல்லுபடியாகும்: %ls

source: Certificate validation failed
ta_in: சான்றிதழ் சரிபார்ப்பு தோல்வியடைந்தது

source: Certificates|*.p12;*.pkcs12;*.pfx|All|*.*||
ta_in: சான்றிதழ்கள் |*.P12;*. PKCS12;*. Pfx | அனைத்தும் |*.*||

source: Chan&ge the tagged revision The svn:external property of the parent folder is changed accordingly.
ta_in: குறிக்கப்பட்ட திருத்தம் சான் & சீ எச்.வி.என்: பெற்றோர் கோப்புறையின் வெளிப்புற சொத்து அதற்கேற்ப மாற்றப்படுகிறது.

source: Change the window position
ta_in: சாளர நிலையை மாற்றவும்

source: Change the window size
ta_in: சாளர அளவை மாற்றவும்

source: Changed Files
ta_in: கோப்புகளை மாற்றியது

source: Changed files between %1!ls!, %2!ls! and %3!ls!, %4!ls!
ta_in: %1! LS !, %2! LS க்கு இடையில் கோப்புகளை மாற்றியது! மற்றும் %3! ls !, %4! ls!

source: Changelist %ls moved
ta_in: சேஞ்சலிச்ட் %எல்.எச்

source: Changelist:
ta_in: சேஞ்சலிச்ட்:

source: Changes made (double-click on file for diff):
ta_in: செய்யப்பட்ட மாற்றங்கள் (வேறுபாட்டிற்கான கோப்பில் இரட்டை சொடுக்கவும்):

source: Char position where to show a border line in commit text boxes:
ta_in: கரி நிலை உரை பெட்டிகளில் எல்லைக் கோட்டைக் காண்பிப்பது எங்கே:

source: Chec&kout...
ta_in: சரிபார்...

source: Check
ta_in: சரிபார்

source: Check For Updates
ta_in: புதுப்பிப்புகளை சரிபார்க்கவும்

source: Check For Updates...
ta_in: புதுப்பிப்புகளை சரிபார்க்கவும் ...

source: Check for &modifications
ta_in: மற்றும் மாற்றங்களைச் சரிபார்க்கவும்

source: Check for modi&fications
ta_in: மாற்றங்களை சரிபார்க்கவும்

source: Check for modifications
ta_in: மாற்றங்களை சரிபார்க்கவும்

source: Check for updates
ta_in: புதுப்பிப்புகளை சரிபார்க்கவும்

source: Check out a working copy from a repository
ta_in: களஞ்சியத்திலிருந்து வேலை செய்யும் நகலைப் பாருங்கள்

source: Check project now
ta_in: திட்டத்தை இப்போது சரிபார்க்கவும்

source: Check the authentication items you want to delete below
ta_in: நீங்கள் கீழே நீக்க விரும்பும் அங்கீகார உருப்படிகளை சரிபார்க்கவும்

source: Check the path and/or URL you've entered.
ta_in: நீங்கள் உள்ளிட்ட பாதை மற்றும்/அல்லது முகவரி ஐ சரிபார்க்கவும்.

source: Check those menu entries you want to appear in the top context menu instead of the TortoiseSVN submenu
ta_in: ஆமை வி.என் துணைமெனுவுக்கு பதிலாக மேல் சூழல் பட்டியலில் நீங்கள் தோன்ற விரும்பும் அந்த பட்டியல் உள்ளீடுகளை சரிபார்க்கவும்

source: Check to use a less verbose date and time format in log messages
ta_in: பதிவு செய்திகளில் குறைந்த வாய்மொழி தேதி மற்றும் நேர வடிவமைப்பைப் பயன்படுத்த சரிபார்க்கவும்

source: Check working copy for modifications
ta_in: மாற்றங்களுக்கு வேலை நகலை சரிபார்க்கவும்

source: Check&out Checkout into the non empty folder.
ta_in: சரிபார் வெற்று அல்லாத கோப்புறையில் பாருங்கள்.

source: Check-Commit Hook
ta_in: செக்-கமிட் கொக்கி

source: Check:
ta_in: சரிபார்:

source: Checking if a newer version of TortoiseSVN is available...
ta_in: ஆமை வி.என் இன் புதிய பதிப்பு கிடைக்குமா என்பதை சரிபார்க்கவும் ...

source: Checking project '%ls' for updates...
ta_in: புதுப்பிப்புகளுக்கான திட்டத்தை '%LS' சரிபார்க்கிறது ...

source: Checking r%1!ld!...
ta_in: R%1! LD! ...

source: Checkout
ta_in: சரிபார்

source: Checkout &directory:
ta_in: புதுப்பித்து & அடைவு:

source: Checkout D&epth
ta_in: புதுப்பித்து டி & எப்த்

source: Checkout from %1!ls!, revision %2!ls!, %3!ls!, %4!ls!
ta_in: %1! LS !, திருத்தம் %2! LS !, %3! LS !, %4! LS!

source: Checksum:
ta_in: செக்சம்:

source: Choose items...
ta_in: உருப்படிகளைத் தேர்வுசெய்க ...

source: Classification Patterns
ta_in: வகைப்பாடு முறைகள்

source: Cleaning up
ta_in: தூய்மை வெற்றி

source: Cleaning up directory '%1!ls!'
ta_in: கோப்பகத்தை தூய்மை செய்தல் '%1! Ls!'

source: Cleanup
ta_in: தூய்மை வெற்றி

source: Cleanup failed to process the following paths: %ls
ta_in: பின்வரும் பாதைகளை செயலாக்க தூய்மைப்படுத்தல் தவறிவிட்டது: %ls

source: Cleanup has successfully processed the following paths: %ls
ta_in: தூய்மைப்படுத்தல் பின்வரும் பாதைகளை வெற்றிகரமாக செயலாக்கியுள்ளது: %ls
