Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: Do you want to make this working copy unversioned? This will remove all Subversion admin directories from %ls!
ta_in: இந்த வேலை நகலை மாற்றியமைக்க விரும்புகிறீர்களா? இது அனைத்து சப்வர்சன் நிர்வாக கோப்பகங்களையும் அகற்றும் %எல்.எச்!

source: Do you want to mark '%ls' as resolved?
ta_in: தீர்க்கப்பட்டபடி '%ls' ஐக் குறிக்க விரும்புகிறீர்களா?

source: Do you want to mark the file %ls as resolved?
ta_in: கோப்பைக் குறிக்க விரும்புகிறீர்களா? %ls தீர்க்கப்பட்டபடி?

source: Do you want to proceed?
ta_in: நீங்கள் தொடர விரும்புகிறீர்களா?

source: Do you want to recover these auto-saved documents?
ta_in: இந்த தானாக சேமிக்கப்பட்ட இந்த ஆவணங்களை மீட்டெடுக்க விரும்புகிறீர்களா?

source: Do you want to reload the documents to reflect the settings changes? Note: you will lose all changes you've made!
ta_in: அமைப்புகள் மாற்றங்களை பிரதிபலிக்க ஆவணங்களை மீண்டும் ஏற்ற விரும்புகிறீர்களா? குறிப்பு: நீங்கள் செய்த அனைத்து மாற்றங்களையும் இழப்பீர்கள்!

source: Do you want to remove the monitored project '%ls'?
ta_in: கண்காணிக்கப்பட்ட திட்டத்தை '%ls' ஐ அகற்ற விரும்புகிறீர்களா?

source: Do you want to remove the property %ls recursively?
ta_in: %எல்எச் சொத்தை மீண்டும் அகற்ற விரும்புகிறீர்களா?

source: Do you want to revert '%ls'?
ta_in: '%LS' ஐ மாற்ற விரும்புகிறீர்களா?

source: Do you want to revert all changes in %ls and go back to this revision?
ta_in: எல்லா மாற்றங்களையும் மாற்ற விரும்புகிறீர்களா? %ls இந்த திருத்தத்திற்குச் செல்லவா?

source: Do you want to revert all changes in %ls which were made in this revision?
ta_in: எல்லா மாற்றங்களையும் மாற்ற விரும்புகிறீர்களா? %ls இந்த திருத்தத்தில் செய்யப்பட்டவை எது?

source: Do you want to update the folder "%ls" to fetch the applied svn:externals?
ta_in: பயன்படுத்தப்பட்ட எச்.வி.என்: வெளிப்புறங்களைப் பெற "%எல்.எச்" கோப்புறையை புதுப்பிக்க விரும்புகிறீர்களா?

source: Document :
ta_in: ஆவணம் :

source: Documentation : Simon Large Code : Tobias Schäfer, Stefan Fuhrmann
ta_in: ஆவணம்: சைமன் பெரியது குறியீடு: டோபியாச் சாஃபர், ச்டீபன் புஅ்ர்மன்

source: Don't make the checkout directory a sparse working copy. Instead, all URLs get checked out into a separate working copies next to each other. This works for directory URLs only.
ta_in: புதுப்பித்து கோப்பகத்தை ஒரு சிதறிய வேலை நகலாக மாற்ற வேண்டாம். அதற்கு பதிலாக, அனைத்து முகவரி களும் தனித்தனியாக சரிபார்க்கப்படுகின்றன ஒருவருக்கொருவர் அடுத்த வேலை நகல்கள். இது அடைவு முகவரி களுக்கு மட்டுமே வேலை செய்கிறது.

source: Don't recover the auto-saved documents Use the last explicitly saved versions of the documents
ta_in: தானாக சேமிக்கப்பட்ட ஆவணங்களை மீட்டெடுக்க வேண்டாம் ஆவணங்களின் கடைசி வெளிப்படையாக சேமிக்கப்பட்ட பதிப்புகளைப் பயன்படுத்தவும்

source: Don't save Close the views without saving the modifications
ta_in: சேமிக்க வேண்டாம் மாற்றங்களைச் சேமிக்காமல் பார்வைகளை மூடு

source: Don't save Reload the views without saving the modifications
ta_in: சேமிக்க வேண்டாம் மாற்றங்களைச் சேமிக்காமல் பார்வைகளை மீண்டும் ஏற்றவும்

source: Drive Types
ta_in: இயக்கி வகைகள்

source: Drives A: and B:
ta_in: ஒரு இயக்கிகள் ஒரு: மற்றும் பி:

source: Drop not possible on %1!ls!
ta_in: %1 இல் சாத்தியமில்லை! Ls!

source: E
ta_in: இ

source: E&xact copy sources
ta_in: மின் & xact நகல் மூலங்கள்

source: E&xclude paths:
ta_in: மின் & xclude பாதைகள்:

source: E&xecutable
ta_in: மின் & xecutable

source: E&xit
ta_in: &வெளியேறு

source: E&xit (Ctrl+W)
ta_in: &வெளியேறு (Ctrl+W)

source: E&xpand all
ta_in: எல்லாவற்றையும் விரிவாக்கு

source: E&xpand sub-trees
ta_in: மின் & எக்ச்பாண்ட் துணை மரங்கள்

source: E&xport
ta_in: மின் & எக்ச்போர்ட்

source: E&xport...
ta_in: மின் & எக்ச்போர்ட் ...

source: Edit
ta_in: தொகு

source: Edit External
ta_in: வெளிப்புறத் திருத்து

source: Edit Project to monitor
ta_in: கண்காணிக்க திட்டத்தைத் திருத்து

source: Edit Properties
ta_in: பண்புகளைத் திருத்து

source: Edit Property Conflicts
ta_in: சொத்து மோதல்களைத் திருத்தவும்

source: Edit Text Conflicts
ta_in: உரை மோதல்களைத் திருத்தவும்

source: Edit Tree Conflicts
ta_in: மர மோதல்களைத் திருத்தவும்

source: Edit author
ta_in: திருத்து எழுத்தாளர்

source: Edit author name
ta_in: ஆசிரியரின் பெயரைத் திருத்து

source: Edit bugtraq properties
ta_in: பிழைத்திருத்த பண்புகளைத் திருத்தவும்

source: Edit extension specific diff program
ta_in: நீட்டிப்பு குறிப்பிட்ட வேறுபாடு நிரலைத் திருத்து

source: Edit extension specific merge program
ta_in: நீட்டிப்பு குறிப்பிட்ட ஒன்றிணைக்கும் நிரலைத் திருத்தவும்

source: Edit language properties
ta_in: மொழி பண்புகளைத் திருத்தவும்

source: Edit log message
ta_in: பதிவு செய்தியைத் திருத்தவும்

source: Edit property '%1!S!' on %2!ls!
ta_in: சொத்து '%1! கள்!' ஆன் %2! Ls!

source: Edit...
ta_in: தொகு...

source: Edit Edit text conflicts
ta_in: தொகு உரை மோதல்களைத் திருத்தவும்

source: Edit change merged property value in editor
ta_in: தொகு மாற்றியமைக்கப்பட்ட சொத்து மதிப்பை எடிட்டரில் மாற்றம்

source: Edits the selected property value
ta_in: தேர்ந்தெடுக்கப்பட்ட சொத்து மதிப்பைத் திருத்துகிறது

source: Either the name or IP of the proxy server
ta_in: பதிலாள் சேவையகத்தின் பெயர் அல்லது ஐபி

source: Eliding mergeinfo
ta_in: எலிசிங் மெர்சின்ஃபோ

source: Empty
ta_in: வெறுமை

source: Enable Auto-&Properties
ta_in: தானாக & பண்புகளை இயக்கவும்

source: Enable Auto-Properties
ta_in: ஆட்டோ-ஒப்பந்தங்களை இயக்கவும்

source: Enable Edit
ta_in: திருத்தத்தை இயக்கு

source: Enable EditorConfig
ta_in: எடிட்டர் கான்ஃபிக் இயக்கு

source: Enable drag context menu
ta_in: இழுவை சூழல் மெனுவை இயக்கவும்

source: Enable log caching to speed up log and revision graph dialogs
ta_in: பதிவு மற்றும் திருத்த வரைபட உரையாடல்களை விரைவுபடுத்த பதிவு கேச்சிங்கை இயக்கவும்

source: Enabled Overlay Handlers
ta_in: இயக்கப்பட்ட மேலடுக்கு கையாளுபவர்கள்

source: Enables the spellchecker only if the tsvn:projectlanguage property is set.
ta_in: எழுத்துப்பிழை இருந்தால் மட்டுமே டி.எச்.வி.என்: திட்ட மொழி சொத்து அமைக்கப்பட்டுள்ளது.

source: Encoding
ta_in: குறியாக்கம்

source: Encoding Convert to the specified encoding Hold down the Ctrl key to reload the file with the specified encoding.
ta_in: குறியாக்கம் குறிப்பிட்ட குறியாக்கத்திற்கு மாற்றவும் குறிப்பிட்ட குறியாக்கத்துடன் கோப்பை மீண்டும் ஏற்ற கட்டுப்பாடு விசையை அழுத்தவும்.

source: Encountered a hardware I/O error while accessing %1.
ta_in: %1 ஐ அணுகும்போது ஒரு வன்பொருள் I/O பிழையை எதிர்கொண்டது.

source: Encountered a locking violation while accessing %1.
ta_in: %1 ஐ அணுகும்போது பூட்டுதல் மீறலை எதிர்கொண்டது.

source: Encountered a sharing violation while accessing %1.
ta_in: %1 ஐ அணுகும்போது பகிர்வு மீறலை எதிர்கொண்டது.

source: Encountered an improper argument.
ta_in: முறையற்ற வாதத்தை எதிர்கொண்டது.

source: Encountered an unexpected error while reading %1.
ta_in: %1 ஐப் படிக்கும்போது எதிர்பாராத பிழையை எதிர்கொண்டது.

source: Encountered an unexpected error while writing %1.
ta_in: %1 எழுதும் போது எதிர்பாராத பிழையை எதிர்கொண்டது.

source: End Revision
ta_in: இறுதி திருத்தம்

source: End of Line Style
ta_in: வரி பாணியின் முடிவு

source: Enforce
ta_in: செயல்படுத்தவும்

source: Enlarge the window to full size
ta_in: சாளரத்தை முழு அளவிற்கு பெரிதாக்குங்கள்

source: Enter Log Message
ta_in: பதிவு செய்தியை உள்ளிடவும்

source: Enter a &name for the changelist:
ta_in: சேஞ்சலிச்டுக்கு A & பெயரை உள்ளிடவும்:

source: Enter a GUID.
ta_in: ஒரு வழிகாட்டியை உள்ளிடவும்.

source: Enter a currency.
ta_in: நாணயத்தை உள்ளிடவும்.

source: Enter a date and/or time.
ta_in: தேதி மற்றும்/அல்லது நேரத்தை உள்ளிடவும்.

source: Enter a date.
ta_in: ஒரு தேதியை உள்ளிடவும்.

source: Enter a lock message (optional):
ta_in: ஒரு பூட்டு செய்தியை உள்ளிடவும் (விரும்பினால்):

source: Enter a number between %1 and %2.
ta_in: %1 மற்றும் %2 க்கு இடையில் ஒரு எண்ணை உள்ளிடவும்.

source: Enter a number.
ta_in: ஒரு எண்ணை உள்ளிடவும்.

source: Enter a positive integer.
ta_in: நேர்மறையான முழு எண்ணை உள்ளிடவும்.

source: Enter a time.
ta_in: ஒரு நேரத்தை உள்ளிடவும்.

source: Enter an integer between %1 and %2.
ta_in: %1 மற்றும் %2 க்கு இடையில் ஒரு முழு எண்ணை உள்ளிடவும்.

source: Enter an integer between 0 and 255.
ta_in: 0 முதல் 255 வரை ஒரு முழு எண்ணை உள்ளிடவும்.

source: Enter an integer.
ta_in: ஒரு முழு எண்ணை உள்ளிடவும்.

source: Enter file content to test for below:
ta_in: கீழே சோதிக்க கோப்பு உள்ளடக்கத்தை உள்ளிடவும்:

source: Enter log &message:
ta_in: பதிவு & செய்தியை உள்ளிடவும்:

source: Enter log message:
ta_in: பதிவு செய்தியை உள்ளிடவும்:

source: Enter no more than %1 characters.
ta_in: %1 எழுத்துகளுக்கு மேல் உள்ளிட வேண்டாம்.

source: Enter the prefix|*
ta_in: முன்னொட்டை உள்ளிடவும் |*

source: Enter the regex string below:
ta_in: கீழே உள்ள ரீசெக்ச் சரத்தை உள்ளிடவும்:

source: Enter the regular expression patterns for filtering out the bug-ID from a commit message.
ta_in: ஒரு கமிட் செய்தியிலிருந்து பிழை-ஐடியை வடிகட்டுவதற்கான வழக்கமான வெளிப்பாடு வடிவங்களை உள்ளிடவும்.

source: Erase everything Erase All
ta_in: எல்லாவற்றையும் அழிக்கவும் அனைத்தையும் அழிக்கவும்

source: Erase the selection Erase
ta_in: தேர்வை அழிக்கவும் அழிக்கவும்

source: Error
ta_in: பிழை

source: Error rebuilding Shell Icon Cache!
ta_in: செல் படவுரு தற்காலிக சேமிப்பை மீண்டும் உருவாக்குவது பிழை!

source: Error validating server certificate for %ls:
ta_in: %LS க்கான சேவையக சான்றிதழை சரிபார்க்கிறது:

source: Error while reading/writing the registry key %1!ls! %2!ls!
ta_in: பதிவு விசை %1! Ls ஐப் படிக்கும்போது/எழுதும் போது பிழை! %2! Ls!

source: Every commit should be assigned to an issue.
ta_in: ஒவ்வொரு உறுதிப்பாடும் ஒரு பிரச்சினைக்கு ஒதுக்கப்பட வேண்டும்.

source: Ex&ternals
ta_in: முன்னாள் & டெர்னல்ச்

source: Exceptions:
ta_in: விதிவிலக்குகள்:

source: Exclude
ta_in: விலக்கு

source: Exit
ta_in: வெளியேறு

source: Exp&and source tree
ta_in: எக்ச்ப் & மற்றும் மூல மரம்

source: Expand &following tree
ta_in: மரத்தை விரிவாக்கு மற்றும் பின்பற்றுதல்

source: Expert settings
ta_in: வல்லுநர் அமைப்புகள்

source: Explore to
ta_in: ஆராயுங்கள்

source: Export
ta_in: ஏற்றுமதி

source: Export &directory:
ta_in: ஏற்றுமதி மற்றும் அடைவு:

source: Export files (*.tsex)|*.tsex|All Files (*.*)|*.*||
ta_in: கோப்புகளை ஏற்றுமதி (*.tsex) |*.tsex | அனைத்து கோப்புகளும் (*.*) |*.*||

source: Export from %1!ls!
ta_in: %1! Ls இலிருந்து ஏற்றுமதி!

source: Export settings to file...
ta_in: தாக்கல் செய்ய அமைப்புகளை ஏற்றுமதி செய்யுங்கள் ...

source: Export the selected cache as a set of Comma Separated Value (CSV) files
ta_in: தேர்ந்தெடுக்கப்பட்ட தற்காலிக சேமிப்பை கமா பிரிக்கப்பட்ட மதிப்பு (சி.எச்.வி) கோப்புகளின் தொகுப்பாக ஏற்றுமதி செய்யுங்கள்

source: Export unversioned files too
ta_in: மாற்றப்படாத கோப்புகளையும் ஏற்றுமதி செய்யுங்கள்

source: Exporting %1!ls!
ta_in: ஏற்றுமதி %1! Ls!

source: Exporting...
ta_in: ஏற்றுமதி ...

source: Exporting: Target folder exists.
ta_in: ஏற்றுமதி: இலக்கு கோப்புறை உள்ளது.

source: Exports a set of properties to a file
ta_in: ஒரு கோப்பிற்கு பண்புகளின் தொகுப்பை ஏற்றுமதி செய்கிறது

source: Exports a versioned folder as a separate unversioned folder
ta_in: பதிப்பு செய்யப்பட்ட கோப்புறையை ஒரு தனி மாற்றப்படாத கோப்புறையாக ஏற்றுமதி செய்கிறது

source: Extension
ta_in: நீட்டிப்பு

source: Extension/mime-type specific programs
ta_in: நீட்டிப்பு/மைம்-வகை குறிப்பிட்ட நிரல்கள்

source: External
ta_in: வெளிப்புறம்

source: External Program:
ta_in: வெளிப்புற நிரல்:

source: External "%1!ls!" Revision %2!ls!
ta_in: வெளிப்புற "%1! Ls!" திருத்தம் %2! Ls!

source: External failed
ta_in: வெளிப்புற தோல்வியுற்றது

source: Externals excluded
ta_in: வெளிப்புறங்கள் விலக்கப்பட்டுள்ளன

source: Externals included
ta_in: வெளிப்புறங்கள் சேர்க்கப்பட்டுள்ளன

source: F&orce the merge
ta_in: எஃப் & ஓர்ச் தி ஃபார்ச்

source: Failed revert
ta_in: தோல்வியுற்றது

source: Failed to connect. Link may be broken.
ta_in: இணைக்கத் தவறிவிட்டது. இணைப்பு உடைக்கப்படலாம்.

source: Failed to convert ActiveX object.
ta_in: ஆக்டிவ்எக்ச் பொருளை மாற்றுவதில் தோல்வி.

source: Failed to copy the file '%ls' to '%ls'. %ls
ta_in: '%Ls' கோப்பை '%LS' க்கு நகலெடுப்பதில் தோல்வி. %ls

source: Failed to create empty document.
ta_in: வெற்று ஆவணத்தை உருவாக்கத் தவறிவிட்டது.

source: Failed to create object. Make sure the application is entered in the system registry.
ta_in: பொருளை உருவாக்குவதில் தோல்வி. கணினி பதிவேட்டில் விண்ணப்பம் உள்ளிடப்பட்டுள்ளதா என்பதை உறுதிப்படுத்தவும்.

source: Failed to launch help.
ta_in: உதவியைத் தொடங்கத் தவறிவிட்டது.

source: Failed to launch server application.
ta_in: சேவையக பயன்பாட்டைத் தொடங்குவதில் தோல்வி.

source: Failed to load the configuration file for the project monitor!
ta_in: திட்ட மானிட்டருக்கான உள்ளமைவு கோப்பை ஏற்றுவதில் தோல்வி!

source: Failed to open document.
ta_in: ஆவணத்தைத் திறக்கத் தவறிவிட்டது.

source: Failed to perform server operation.
ta_in: சேவையக செயல்பாட்டைச் செய்யத் தவறிவிட்டது.

source: Failed to save document.
ta_in: ஆவணத்தை சேமிப்பதில் தோல்வி.

source: Failed to start the issue tracker COM provider '%1!ls!'. %2!ls!
ta_in: வெளியீடு டிராக்கர் காம் வழங்குநர் '%1! LS!' %2! Ls!

source: Failed!
ta_in: தோல்வி!

source: Failed: target required
ta_in: தோல்வியுற்றது: இலக்கு தேவை

source: Fetch HEAD revision and adjust to it
ta_in: தலை திருத்தத்தைப் பெற்று அதை சரிசெய்யவும்

source: Fetches the contents of folders in the background so browsing is faster
ta_in: பின்னணியில் கோப்புறைகளின் உள்ளடக்கங்களைப் பெறுகிறது, எனவே உலாவல் வேகமாக இருக்கும்

source: Fetching file list of source
ta_in: மூலத்தின் கோப்பு பட்டியலைப் பெறுதல்

source: Fetching file list of target
ta_in: இலக்கின் கோப்பு பட்டியலைப் பெறுதல்

source: Fetching file...
ta_in: கோப்பைப் பெறுதல் ...

source: Fetching revision %ls of file:
ta_in: கோப்பின் திருத்தம் %ls ஐப் பெறுதல்:

source: Fetching status of %1!ls!
ta_in: %1! LS இன் நிலையைப் பெறுதல்!

source: Fetching text bases
ta_in: உரை தளங்களைப் பெறுதல்

source: Fetching tree conflict information...
ta_in: மர மோதல் தகவல்களைப் பெறுதல் ...

source: File
ta_in: கோப்பு

source: File Encoding
ta_in: கோப்பு குறியாக்கம்

source: File already exists
ta_in: கோப்பு ஏற்கனவே உள்ளது

source: File changes each %ls:
ta_in: கோப்பு ஒவ்வொரு %LS ஐ மாற்றுகிறது:

source: File changes each week:
ta_in: ஒவ்வொரு வாரமும் கோப்பு மாற்றங்கள்:

source: File contains conflict markers
ta_in: கோப்பில் மோதல் குறிப்பான்கள் உள்ளன

source: File diffs
ta_in: கோப்பு வேறுபாடு

source: File has no conflicts
ta_in: கோப்பில் எந்த மோதல்களும் இல்லை

source: File is empty.
ta_in: கோப்பு காலியாக உள்ளது.

source: File list is empty
ta_in: கோப்பு பட்டியல் காலியாக உள்ளது

source: File patches
ta_in: கோப்பு திட்டுகள்

source: File size: %ls (%ls) Width: %ld pixel Height: %ld pixel Horizontal Resolution: %.1f dpi Vertical Resolution: %.1f dpi Depth: %d bit Zoom: %d%%
ta_in: கோப்பு அளவு: %LS ( %LS) அகலம்: %எல்.டி படப்புள்ளி உயரம்: %எல்.டி படப்புள்ளி கிடைமட்ட தீர்மானம்: %.1F டிபிஐ செங்குத்து தீர்மானம்: %.1F டிபிஐ ஆழம்: %d பிட் பெரிதாக்கு:%d %%

source: File size: %ls (%ls) Width: %ld pixel Height: %ld pixel Horizontal Resolution: %.1f dpi Vertical Resolution: %.1f dpi Depth: %d bit Zoom: %d%% File size: %ls (%ls) Width: %ld pixel Height: %ld pixel Horizontal Resolution: %.1f dpi Vertical Resolution: %.1f dpi Depth: %d bit Zoom: %d%%
ta_in: கோப்பு அளவு: %LS ( %LS) அகலம்: %எல்.டி படப்புள்ளி உயரம்: %எல்.டி படப்புள்ளி கிடைமட்ட தீர்மானம்: %.1F டிபிஐ செங்குத்து தீர்மானம்: %.1F டிபிஐ ஆழம்: %d பிட் பெரிதாக்கு:%d %% கோப்பு அளவு: %LS ( %LS) அகலம்: %எல்.டி படப்புள்ளி உயரம்: %எல்.டி படப்புள்ளி கிடைமட்ட தீர்மானம்: %.1F டிபிஐ செங்குத்து தீர்மானம்: %.1F டிபிஐ ஆழம்: %d பிட் பெரிதாக்கு:%d %%

source: File size: %ls (%ls) Width: %ld pixel Height: %ld pixel Horizontal Resolution: %.1f dpi Vertical Resolution: %.1f dpi Depth: %d bit Zoom: %d%%
ta_in: கோப்பு அளவு: %LS ( %LS) அகலம்: %எல்.டி படப்புள்ளி உயரம்: %எல்.டி படப்புள்ளி கிடைமட்ட தீர்மானம்: %.1F டிபிஐ செங்குத்து தீர்மானம்: %.1F டிபிஐ ஆழம்: %d பிட் பெரிதாக்கு:%d %%

source: File size: %ls (%ls) Width: %ld pixel Height: %ld pixel Horizontal Resolution: %.1f dpi Vertical Resolution: %.1f dpi Depth: %d bit Zoom: %d%% File size: %ls (%ls) Width: %ld pixel Height: %ld pixel Horizontal Resolution: %.1f dpi Vertical Resolution: %.1f dpi Depth: %d bit Zoom: %d%%
ta_in: கோப்பு அளவு: %LS ( %LS) அகலம்: %எல்.டி படப்புள்ளி உயரம்: %எல்.டி படப்புள்ளி கிடைமட்ட தீர்மானம்: %.1F டிபிஐ செங்குத்து தீர்மானம்: %.1F டிபிஐ ஆழம்: %d பிட் பெரிதாக்கு:%d %% கோப்பு அளவு: %LS ( %LS) அகலம்: %எல்.டி படப்புள்ளி உயரம்: %எல்.டி படப்புள்ளி கிடைமட்ட தீர்மானம்: %.1F டிபிஐ செங்குத்து தீர்மானம்: %.1F டிபிஐ ஆழம்: %d பிட் பெரிதாக்கு:%d %%

source: Filename
ta_in: கோப்புப்பெயர்

source: Filename, extension or mime-type:
ta_in: கோப்பு பெயர், நீட்டிப்பு அல்லது மைம் வகை:

source: Filename/Extension
ta_in: கோப்பு பெயர்/நீட்டிப்பு

source: Filenames
ta_in: கோப்பு பெயர்கள்

source: Files
ta_in: கோப்புகள்

source: Filter by
ta_in: மூலம் வடிகட்டவும்

source: Filter match
ta_in: வடிகட்டி பொருத்தம்

source: Filter out paths that contain one of the following strings (separate multiple paths with the '*' char):
ta_in: பின்வரும் சரங்களில் ஒன்றைக் கொண்ட பாதைகளை வடிகட்டவும் ('*' கரி உடன் பல பாதைகளை பிரிக்கவும்):

source: Filter paths
ta_in: பாதைகளை வடிகட்டவும்

source: Filter:
ta_in: வடிகட்டு:

source: Filtered
ta_in: வடிகட்டப்பட்டது

source: Find
ta_in: தேடு

source: Find &HEAD-Revision
ta_in: கண்டுபிடி & தலை-மறுபரிசீலனை

source: Find HEAD revisions
ta_in: தலை திருத்தங்களைக் கண்டறியவும்

source: Find Next
ta_in: அடுத்ததை தேடு

source: Find Previous
ta_in: முந்தையதைக் கண்டறியவும்

source: Find the last occurrence of the selected text Search Previous
ta_in: தேர்ந்தெடுக்கப்பட்ட உரையின் கடைசி நிகழ்வைக் கண்டறியவும் முன்பு தேடுங்கள்

source: Find the next occurrence of the selected text Search Next
ta_in: தேர்ந்தெடுக்கப்பட்ட உரையின் அடுத்த நிகழ்வைக் கண்டறியவும் அடுத்து தேடுங்கள்

source: Find the specified text Find
ta_in: குறிப்பிட்ட உரையைக் கண்டறியவும் கண்டுபிடி

source: Find: Can't find the text "%ls"
ta_in: கண்டுபிடி: "%ls" என்ற உரையை கண்டுபிடிக்க முடியவில்லை

source: Find: First occurrence from the bottom found. Beginning of document reached.
ta_in: கண்டுபிடி: கீழே இருந்து முதல் நிகழ்வு காணப்படுகிறது. ஆவணத்தின் துவக்கம்.

source: Find: First occurrence from the top found. End of document reached.
ta_in: கண்டுபிடி: மேலே இருந்து முதல் நிகழ்வு. ஆவணத்தின் முடிவு அடைந்தது.

source: Finished!
ta_in: முடிந்தது!

source: Fit graph
ta_in: வரைபடத்தை பொருத்தம்

source: Fit height
ta_in: பொருத்தமான உயரத்திற்கு

source: Fit image &heights (H)
ta_in: படம் & உயரங்கள் (எச்)

source: Fit image &widths (W)
ta_in: படம் & அகலங்கள் (W)

source: Fit width
ta_in: பொருந்தக்கூடிய அகலம்

source: Fixed at rev
ta_in: ரெவ் இல் சரி செய்யப்பட்டது

source: Fold &tags
ta_in: மடிப்பு & குறிச்சொற்கள்

source: Folded tag
ta_in: மடிந்த குறிச்சொல்

source: Font
ta_in: எழுத்துரு

source: For Help, press F1. Scroll horizontally with Ctrl-Scrollwheel
ta_in: உதவிக்கு, F1 ஐ அழுத்தவும். Ctrl-scrollwheel உடன் கிடைமட்டமாக உருட்டவும்

source: For complete history deselect 'Stop on copy/rename'
ta_in: முழுமையான வரலாற்றுக்கு 'நகலில் நிறுத்துங்கள்/மறுபெயரிடுங்கள்'

source: Force
ta_in: ஆற்றல்

source: Force removal
ta_in: படை அகற்றுதல்

source: Foreground
ta_in: முன்புறம்

source: Forwards in browsing history
ta_in: உலாவல் வரலாற்றில் முன்னோக்கி

source: Found auto words:
ta_in: ஆட்டோ சொற்கள் கிடைத்தன:

source: From:
ta_in: இருந்து:

source: Full data
ta_in: முழு தரவு

source: Full revision data without changed paths
ta_in: மாற்றப்பட்ட பாதைகள் இல்லாமல் முழு திருத்த தரவு

source: Fully recursive
ta_in: முழுமையாக சுழல்நிலை

source: GDI+ couldn't be initialized!
ta_in: சி.டி.ஐ+ ஐ துவக்க முடியவில்லை!

source: GDI+ couldn't create a bitmap object. You probably don't have enough memory.
ta_in: GDI+ ஒரு பிட்மேப் பொருளை உருவாக்க முடியவில்லை. உங்களிடம் போதுமான நினைவகம் இல்லை.

source: Gathering information. Please wait...
ta_in: தகவலை சேகரித்தல். தயவுசெய்து காத்திருங்கள் ...

source: General
ta_in: பொது

source: Generating patchfile...
ta_in: ஒட்டுவட்டத்தை உருவாக்குதல் ...

source: Get loc&k...
ta_in: லாக் & கே கிடைக்கும் ...

source: Get merge logs
ta_in: ஒன்றிணைக்கும் பதிவுகளைப் பெறுங்கள்

source: Getting BASE of file %1!ls!
ta_in: கோப்பு %1! Ls இன் அடிப்படை பெறுதல்!

source: Getting file %1!ls!
ta_in: கோப்பு %1! Ls!

source: Getting file %1!ls!, revision %2!ls!
ta_in: கோப்பு %1! Ls !, திருத்தம் %2! LS!

source: Getting file info...
ta_in: கோப்பு தகவலைப் பெறுதல் ...

source: Getting information from repository...
ta_in: களஞ்சியத்திலிருந்து தகவல்களைப் பெறுதல் ...

source: Getting information...
ta_in: செய்தி பெறுதல் ...

source: Getting required information...
ta_in: தேவையான தகவல்களைப் பெறுதல் ...

source: Getting unified diff
ta_in: ஒருங்கிணைந்த வேறுபாட்டைப் பெறுதல்

source: Global ignore &pattern:
ta_in: உலகளாவிய புறக்கணிப்பு மற்றும் முறை:

source: Global settings
ta_in: உலகளாவிய அமைப்புகள்

source: Go To Line
ta_in: வரிக்குச் செல்லுங்கள்

source: Go to line
ta_in: வரிக்குச் செல்லுங்கள்

source: Go to the next conflict Next conflict
ta_in: அடுத்த மோதலுக்குச் செல்லுங்கள் அடுத்த மோதல்

source: Go to the next difference Next difference
ta_in: அடுத்த வித்தியாசத்திற்குச் செல்லுங்கள் அடுத்த வேறுபாடு

source: Go to the next inline difference Next inline difference
ta_in: அடுத்த இன்லைன் வித்தியாசத்திற்குச் செல்லுங்கள் அடுத்த இன்லைன் வேறுபாடு

source: Go to the previous conflict Previous conflict
ta_in: முந்தைய மோதலுக்குச் செல்லுங்கள் முந்தைய மோதல்

source: Go to the previous difference Previous difference
ta_in: முந்தைய வித்தியாசத்திற்குச் செல்லுங்கள் முந்தைய வேறுபாடு

source: Go to the previous inline difference Previous inline difference
ta_in: முந்தைய இன்லைன் வேறுபாட்டிற்குச் செல்லுங்கள் முந்தைய இன்லைன் வேறுபாடு

source: Goto Line
ta_in: கோட்டோ வரி

source: Graph type:
ta_in: வரைபட வகை:

source: Graphs for repository roots are always empty!
ta_in: களஞ்சிய வேர்களுக்கான வரைபடங்கள் எப்போதும் காலியாக இருக்கும்!

source: Group by branch
ta_in: கிளை மூலம் குழு

source: Group changelists
ta_in: குழு மாற்றிகள்

source: H&EAD Revision
ta_in: எச் & ஈட் திருத்தம்

source: HEAD
ta_in: தலை

source: HEAD node
ta_in: தலை முனை

source: HEAD revision is %ls
ta_in: தலை திருத்தம் %ls

source: Header
ta_in: தலைப்பி

source: Help
ta_in: உதவி

source: Hide &deleted paths
ta_in: பாதைகளை மறைத்து நீக்குகிறது

source: Hide Menus for unversioned paths
ta_in: மாற்றப்படாத பாதைகளுக்கு மெனுக்களை மறைக்கவும்

source: Hide all branches that did not modify the item
ta_in: உருப்படியை மாற்றாத அனைத்து கிளைகளையும் மறைக்கவும்

source: Hide all tags
ta_in: எல்லா குறிச்சொற்களையும் மறைக்கவும்

source: Hide deleted branches and tags
ta_in: நீக்கப்பட்ட கிளைகள் மற்றும் குறிச்சொற்களை மறைக்கவும்

source: Hide non-mergeable revisions
ta_in: இணைக்கப்படாத திருத்தங்களை மறைக்கவும்

source: Hide ta&gs
ta_in: Ta & gs ஐ மறைக்கவும்

source: Hide the script while running
ta_in: இயங்கும் போது ச்கிரிப்டை மறைக்கவும்

source: Hide unused &branches
ta_in: பயன்படுத்தப்படாத & கிளைகளை மறைக்கவும்

source: Hide/Show the patch file list
ta_in: ஒட்டு கோப்பு பட்டியலை மறைக்க/காட்டு

source: Hide/Show the patch file list Hides or shows the patch file list
ta_in: ஒட்டு கோப்பு பட்டியலை மறைக்க/காட்டு ஒட்டு கோப்பு பட்டியலை மறைக்கிறது அல்லது காட்டுகிறது

source: Highest revision number in the cache
ta_in: தற்காலிக சேமிப்பில் அதிக திருத்தம் எண்

source: Hook Scripts
ta_in: ஊக் ச்கிரிப்ட்கள்

source: Hook Type
ta_in: கொக்கி வகை

source: Hook Type:
ta_in: கொக்கி வகை:

source: Hook script failed
ta_in: ஊக் ச்கிரிப்ட் தோல்வியடைந்தது

source: Hook script failed!
ta_in: ஊக் ச்கிரிப்ட் தோல்வியடைந்தது!

source: Hostname mismatch (%ls)
ta_in: ஓச்ட்பெயர் பொருந்தாத தன்மை (%எல்.எச்)

source: I&gnore all whitespaces
ta_in: அனைத்து இடைவெளிகளையும் புறக்கணிக்கவும்

source: I&gnored
ta_in: நான் & கின்ட்

source: I&nclude paths:
ta_in: நான் & nclude பாதைகள்:

source: ID
ta_in: ஐடி

source: ID:105:V C +W
ta_in: ஐடி: 105: வி சி +டபிள்யூ

source: ID:32771:V C +F
ta_in: ஐடி: 32771: வி சி +எஃப்

source: ID:32772:V +O
ta_in: ஐடி: 32772: வி +ஓ

source: ID:32773:V C +O
ta_in: ஐடி: 32773: வி சி +ஓ

source: ID:32774:V C +T
ta_in: ஐடி: 32774: வி சி +டி

source: ID:32775:V C +D
ta_in: ஐடி: 32775: வி சி +டி

source: ID:32778:V +F
ta_in: ஐடி: 32778: வி +எஃப்

source: ID:32779:V +S
ta_in: ஐடி: 32779: வி +எச்

source: ID:32779:V C +G
ta_in: ஐடி: 32779: வி சி +சி
