Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: Cleanup interrupted operations, locked files, ...
ta_in: தூய்மைப்படுத்தும் குறுக்கிடப்பட்ட செயல்பாடுகள், பூட்டப்பட்ட கோப்புகள், ...

source: Clear
ta_in: தெளிவான

source: Clear all
ta_in: அனைத்தையும் அழி

source: Clear...
ta_in: தெளிவுபடுத்துதல் ...

source: Clears %1!ld! URLs stored for %2!ld! working copies
ta_in: %1! LD ஐ அழிக்கிறது! %2! LD க்கு முகவரி கள் சேமிக்கப்பட்டுள்ளன! வேலை செய்யும் பிரதிகள்

source: Clears %1!ld! log messages stored for %2!ld! working copies
ta_in: %1! LD ஐ அழிக்கிறது! பதிவு செய்திகள் %2! LD க்கு சேமிக்கப்பட்டுள்ளன! வேலை செய்யும் பிரதிகள்

source: Clears %1!ld! username/password pairs, %2!ld! ssl certificates and %3!ld! usernames
ta_in: %1! LD ஐ அழிக்கிறது! பயனர்பெயர்/கடவுச்சொல் சோடிகள், %2! எல்.டி! எச்எச்எல் சான்றிதழ்கள் மற்றும் %3! எல்.டி! பயனர்பெயர்கள்

source: Clears all %ld approved client-side hook scripts
ta_in: அனைத்து %எல்.டி அங்கீகரிக்கப்பட்ட கிளையன்ட்-சைட் ஊக் ச்கிரிப்ட்களை அழிக்கிறது

source: Clears cached logs from %ld repositories
ta_in: %அனைத்து களஞ்சியங்களிலிருந்தும் கேச் பதிவுகளை அழிக்கவும்

source: Clears the stored sizes and positions of %ld dialogs
ta_in: %எல்.டி உரையாடலின் சேமிக்கப்பட்ட அளவுகள் மற்றும் நிலைகளை அழிக்கவும்

source: Click here to go to the website
ta_in: வலைத்தளத்திற்குச் செல்ல இங்கே சொடுக்கு செய்க

source: Click here to select a recently typed message
ta_in: அண்மைக் காலத்தில் தட்டச்சு செய்த செய்தியைத் தேர்ந்தெடுக்க இங்கே சொடுக்கு செய்க

source: Click on "Advanced" to specify alternate diff programs based on file extension
ta_in: கோப்பு நீட்டிப்பின் அடிப்படையில் மாற்று வேறுபாடு நிரல்களைக் குறிப்பிட "மேம்பட்டது" என்பதைக் சொடுக்கு செய்க

source: Click on "Advanced" to specify alternate merge programs based on file extension
ta_in: கோப்பு நீட்டிப்பின் அடிப்படையில் மாற்று ஒன்றிணைக்கும் நிரல்களைக் குறிப்பிட "மேம்பட்டது" என்பதைக் சொடுக்கு செய்க

source: Click to see commands to move blocks of text Use text blocks
ta_in: உரையின் தொகுதிகளை நகர்த்த கட்டளைகளைக் காண சொடுக்கு செய்க உரை தொகுதிகள் பயன்படுத்தவும்

source: Clipboard
ta_in: இடைநிலைப் பலகை

source: Close manually
ta_in: கைமுறையாக மூடு

source: Close the active window and prompts to save the documents
ta_in: செயலில் உள்ள சாளரத்தை மூடு மற்றும் ஆவணங்களை சேமிக்க தூண்டுகிறது

source: Code Collaborator Settings
ta_in: குறியீடு ஒத்துழைப்பாளர் அமைப்புகள்

source: Coll&apse source tree
ta_in: கோல் & அப்சே மூல மரம்

source: Collaborator &password
ta_in: ஒத்துழைப்பாளர் & கடவுச்சொல்

source: Collapse
ta_in: சரிவு

source: Collapse &following tree
ta_in: சரிவு மற்றும் பின்வரும் மரம்

source: Collapse unchanged sections Collapse
ta_in: மாறாத பிரிவுகளை சரிவு சரிவு

source: Color 1
ta_in: நிறம் 1

source: Color 2
ta_in: நிறம் 2

source: Color by &age, indexed
ta_in: வண்ணம் & அகவை, குறியீட்டு

source: Color by age, &continuous
ta_in: வயதுக்கு ஏற்ப வண்ணம், & தொடர்ச்சியானது

source: Color by au&thor
ta_in: அயு & தோர் மூலம் வண்ணம்

source: Colors
ta_in: வண்ணங்கள்

source: Column: %d
ta_in: நெடுவரிசை: %d

source: Command
ta_in: கட்டளை

source: Command Line
ta_in: கட்டளை வரி

source: Command Line To Execute:
ta_in: செயல்படுத்த கட்டளை வரி:

source: Command Line To Execute: To specify a path inside a working copy, specify the url in the repository with the repository root url as %REPOROOT%, or %REPOROOT+% deeper down the working copy root.
ta_in: செயல்படுத்த கட்டளை வரி: வேலை செய்யும் நகலுக்குள் ஒரு பாதையை குறிப்பிட, களஞ்சியத்தில் உள்ள முகவரி ஐ களஞ்சிய ரூட் முகவரி உடன் %ரெபோரூட் %எனக் குறிப்பிடவும், அல்லது %reporoot+ %வேலை நகல் மூலத்தில் ஆழமாக இருக்கும்.

source: Command failed - Update needed
ta_in: கட்டளை தோல்வியுற்றது - புதுப்பிப்பு தேவை

source: Command failed.
ta_in: கட்டளை தோல்வியடைந்தது.

source: Commi&t only the folder Files inside the folder won't get committed.
ta_in: கமி & டி கோப்புறை மட்டுமே கோப்புறையில் உள்ள கோப்புகள் உறுதியற்றதாக இருக்காது.

source: Commi&t Commit the changes to the target.
ta_in: கமி & டி இலக்கில் மாற்றங்களைச் செய்யுங்கள்.

source: Commit
ta_in: கமிட்

source: Commit to %1!ls!
ta_in: %1! Ls க்கு உறுதியளிக்கவும்!

source: Commit to:
ta_in: இதற்கு உறுதியளிக்கவும்:

source: Commit...
ta_in: கமிட் ...

source: Commits by author
ta_in: ஆசிரியரால் காம்

source: Commits by date
ta_in: தேதியின்படி

source: Commits each %ls:
ta_in: ஒவ்வொரு %எல்.எச்.

source: Commits each week:
ta_in: ஒவ்வொரு வாரமும் கமிட் செய்கிறது:

source: Commits your changes to the repository
ta_in: களஞ்சியத்தில் உங்கள் மாற்றங்களைச் செய்கிறது

source: Committing an unversioned folder will not recursively add its child items! You might want to add these folders recursively by using the 'Add...' context menu item.
ta_in: மாற்றப்படாத கோப்புறையைச் செய்வது அதன் குழந்தை பொருட்களை மீண்டும் சேர்க்காது! 'சேர் ...' சூழல் பட்டியல் உருப்படியைப் பயன்படுத்தி இந்த கோப்புறைகளை மீண்டும் சேர்க்க விரும்பலாம்.

source: Committing to a tag
ta_in: ஒரு குறிச்சொல்லில் ஈடுபடுவது

source: Committing transaction...
ta_in: பரிவர்த்தனை செய்யும் ...

source: Compare &HEAD revisions
ta_in: ஒப்பிட்டு மற்றும் தலை திருத்தங்கள்

source: Compare and &blame with working BASE
ta_in: வேலை செய்யும் தளத்துடன் ஒப்பிட்டுப் பாருங்கள்

source: Compare and blame with previous revision
ta_in: முந்தைய திருத்தத்துடன் ஒப்பிட்டுப் பாருங்கள்

source: Compare revisions (&properties only)
ta_in: திருத்தங்களை ஒப்பிடுக (& பண்புகள் மட்டும்)

source: Compare revisions (conten&t only)
ta_in: திருத்தங்களை ஒப்பிடுக (கான்டன் & டி மட்டும்)

source: Compare two files
ta_in: இரண்டு கோப்புகளை ஒப்பிடுக

source: Compare whitespaces
ta_in: வைட்ச்பேச்களை ஒப்பிடுக

source: Compare with &HEAD and BASE
ta_in: தலை மற்றும் தளத்துடன் ஒப்பிடுக

source: Compare with &working copy
ta_in: & வேலை நகலுடன் ஒப்பிடுக

source: Compare with b&ase
ta_in: B & ASE உடன் ஒப்பிடுக

source: Compare with base (content only)
ta_in: தளத்துடன் ஒப்பிடுக (உள்ளடக்கம் மட்டும்)

source: Compare with previous revision
ta_in: முந்தைய திருத்தத்துடன் ஒப்பிடுக

source: Compares all whitespaces when diffing Compare whitespaces
ta_in: வேறுபடும்போது அனைத்து விடுபடல்களையும் ஒப்பிடுகிறது வைட்ச்பேச்களை ஒப்பிடுக

source: Compares the file with the last committed revision to show you the changes you made
ta_in: நீங்கள் செய்த மாற்றங்களைக் காண்பிப்பதற்காக கோப்பை கடைசியாக உறுதியான திருத்தத்துடன் ஒப்பிடுகிறது

source: Compares the selected file with a file in the repository
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்பை களஞ்சியத்தில் ஒரு கோப்புடன் ஒப்பிடுகிறது

source: Completed
ta_in: முடிந்தது

source: Completed!
ta_in: நிறைவு!

source: Configure &TortoiseSVN to never use the recycle bin
ta_in: மறுசுழற்சி தொட்டியை ஒருபோதும் பயன்படுத்த வேண்டாம் என்று உள்ளமைக்கவும் & ஆமை

source: Configure Filter Regex
ta_in: வடிகட்டி ரெசெக்சை உள்ளமைக்கவும்

source: Configure Filter Regexes
ta_in: வடிகட்டி ரெசெக்ச்களை உள்ளமைக்கவும்

source: Configure Hook Scripts
ta_in: ஊக் ச்கிரிப்ட்களை உள்ளமைக்கவும்

source: Configure Issue Tracker Integration
ta_in: வெளியீடு டிராக்கர் ஒருங்கிணைப்பை உள்ளமைக்கவும்

source: Configure the program used for comparing different revisions of files
ta_in: கோப்புகளின் வெவ்வேறு திருத்தங்களை ஒப்பிடுவதற்குப் பயன்படுத்தப்படும் நிரலை உள்ளமைக்கவும்

source: Configure the program used for comparing different revisions of properties
ta_in: பண்புகளின் வெவ்வேறு திருத்தங்களை ஒப்பிடுவதற்குப் பயன்படுத்தப்படும் நிரலை உள்ளமைக்கவும்

source: Configure the program used to resolve conflicted files.
ta_in: முரண்பட்ட கோப்புகளைத் தீர்க்கப் பயன்படுத்தப்படும் நிரலை உள்ளமைக்கவும்.

source: Configure viewer program for GNU diff files (patch files).
ta_in: குனு டிஃப் கோப்புகளுக்கான பார்வையாளர் நிரலை உள்ளமைக்கவும் (பேட்ச் கோப்புகள்).

source: Confirm revert
ta_in: மாற்றியமைக்கவும்

source: Conflict for property "%s" discovered
ta_in: "%s" என்ற சொத்துக்கான மோதல் கண்டுபிடிக்கப்பட்டது

source: Conflict resolved
ta_in: மோதல் தீர்க்கப்பட்டது

source: Conflicted
ta_in: சண்டையிட்டனர்

source: Conflicted (maybe)
ta_in: முரண்பட்ட (ஒருவேளை)

source: Conflicts: %d
ta_in: மோதல்கள்: %d

source: Connect to the repository server and download missing log data
ta_in: களஞ்சிய சேவையகத்துடன் இணைத்து காணாமல் போன பதிவு தரவைப் பதிவிறக்கவும்

source: Container sizes
ta_in: கொள்கலன் அளவுகள்

source: Context Menu
ta_in: சூழல் பட்டியல்

source: Context lines for patches
ta_in: திட்டுகளுக்கான சூழல் கோடுகள்

source: Context menu successfully registered!
ta_in: சூழல் பட்டியல் வெற்றிகரமாக பதிவு செய்யப்பட்டது!

source: Continue &Merge
ta_in: தொடரவும் ஒன்றிணைக்கவும்

source: Convert spaces to tabs
ta_in: இடங்களை தாவல்களாக மாற்றவும்

source: Convert tabs to spaces
ta_in: தாவல்களை இடைவெளிகளாக மாற்றவும்

source: Converts the working copy format to the new version
ta_in: வேலை செய்யும் நகல் வடிவமைப்பை புதிய பதிப்பிற்கு மாற்றுகிறது

source: Cop&y
ta_in: காப் & ஒய்

source: Copied
ta_in: நகலெடுக்கப்பட்டது

source: Copied from: %1!ls!@%2!ld!
ta_in: நகலெடுக்கப்பட்டது: %1! Ls!@ %2! LD!

source: Copies the URLs of all selected items to the clipboard
ta_in: தேர்ந்தெடுக்கப்பட்ட அனைத்து பொருட்களின் முகவரி களையும் கிளிப்போர்டுக்கு நகலெடுக்கிறது

source: Copy
ta_in: நகலெடு

source: Copy %1!ld! items to %2!ls!
ta_in: %1! LD! உருப்படிகள் %2! Ls!

source: Copy %1!ls! to %2!ls!, Revision %3!ls!
ta_in: %1! Ls! பெறுநர் %2! ls !, திருத்தம் %3! ls!

source: Copy %1!ls! to %2!ls!
ta_in: %1! Ls! பெறுநர் %2! ls!

source: Copy &revision number to clipboard
ta_in: கிளிப்போர்டுக்கு நகலெடுக்கவும் திருத்தவும்

source: Copy (Branch / Tag)
ta_in: நகலெடு (கிளை / குறிச்சொல்)

source: Copy URL to clipboard
ta_in: கிளிப்போர்டுக்கு முகவரி ஐ நகலெடுக்கவும்

source: Copy and add The file is copied to the destination and added to version control.
ta_in: நகலெடுத்து சேர்க்கவும் கோப்பு இலக்குக்கு நகலெடுக்கப்பட்டு பதிப்பு கட்டுப்பாட்டில் சேர்க்கப்பட்டுள்ளது.

source: Copy and rename
ta_in: நகலெடுத்து மறுபெயரிடுங்கள்

source: Copy and rename item to here
ta_in: உருப்படியை இங்கே நகலெடுத்து மறுபெயரிடுங்கள்

source: Copy from path
ta_in: பாதையிலிருந்து நகலெடுக்கவும்

source: Copy items to here
ta_in: உருப்படிகளை இங்கே நகலெடுக்கவும்

source: Copy selection to cli&pboard
ta_in: கிளிப்போர்டுக்கு தேர்வை நகலெடுக்கவும்

source: Copy the selection and put it on the Clipboard Copy
ta_in: தேர்வை நகலெடுத்து கிளிப்போர்டில் வைக்கவும் நகலெடு

source: Copy to %1
ta_in: %1 க்கு நகலெடுக்கவும்

source: Copy to clipboard
ta_in: கிளிப்போர்டுக்கு நகலெடுக்கவும்

source: Copy to working copy...
ta_in: வேலை நகலுக்கு நகலெடுக்கவும் ...

source: Copy: New name for %ls
ta_in: நகல்: %ls க்கு புதிய பெயர்

source: Copy The file is copied to the destination and left unversioned.
ta_in: நகலெடு கோப்பு இலக்குக்கு நகலெடுக்கப்பட்டு மாற்றாமல் விடப்படுகிறது.

source: Copying %1!ls!
ta_in: %1 ஐ நகலெடுக்கிறது! Ls!

source: Copying from foreign repository URL
ta_in: வெளிநாட்டு களஞ்சிய முகவரி இலிருந்து நகலெடுக்கும்

source: Copying...
ta_in: நகலெடுக்கும் ...

source: Could not add %ls to the ignore list!
ta_in: புறக்கணிப்பு பட்டியலில் %LS ஐ சேர்க்க முடியவில்லை!

source: Could not add '%ls' because
ta_in: '%Ls' ஐ சேர்க்க முடியவில்லை

source: Could not add property '%1!ls!' on '%2!ls!' because
ta_in: சொத்து '%1! Ls!' '%2! ls!' ஏனெனில்

source: Could not check for a newer version!
ta_in: புதிய பதிப்பை சரிபார்க்க முடியவில்லை!

source: Could not copy the files! %ls
ta_in: கோப்புகளை நகலெடுக்க முடியவில்லை! %ls

source: Could not create %1 because the directory is full.
ta_in: அடைவு நிரம்பியுள்ளதால் %1 ஐ உருவாக்க முடியவில்லை.

source: Could not create temp folder!
ta_in: தற்காலிக கோப்புறையை உருவாக்க முடியவில்லை!

source: Could not delete '%ls' because
ta_in: '%Ls' ஐ நீக்க முடியவில்லை

source: Could not delete property '%1!ls!' on '%2!ls!' because
ta_in: சொத்தை நீக்க முடியவில்லை '%1! Ls!' '%2! ls!' ஏனெனில்

source: Could not determine the last committed revision!
ta_in: கடைசியாக உறுதியான திருத்தத்தை தீர்மானிக்க முடியவில்லை!

source: Could not find a parent folder for %ls
ta_in: பெற்றோர் கோப்புறையைக் கண்டுபிடிக்க முடியவில்லை %ls

source: Could not get the status!
ta_in: அந்தச்தைப் பெற முடியவில்லை!

source: Could not merge '%ls' because
ta_in: '%Ls' ஐ ஒன்றிணைக்க முடியவில்லை

source: Could not merge property '%1!ls!' on '%2!ls!' because
ta_in: சொத்து '%1! Ls!' '%2! ls!' ஏனெனில்

source: Could not open %1 because there are too many open files.
ta_in: திறந்த கோப்புகள் அதிகமானவை இருப்பதால் %1 ஐ திறக்க முடியவில்லை.

source: Could not open the file %ls
ta_in: கோப்பைத் திறக்க முடியவில்லை %ls

source: Could not remove %1 because it is the current directory.
ta_in: %1 ஐ அகற்ற முடியவில்லை, ஏனெனில் இது தற்போதைய அடைவு.

source: Could not remove %ls from the ignore list
ta_in: புறக்கணிப்பு பட்டியலிலிருந்து %LS ஐ அகற்ற முடியவில்லை

source: Could not replace '%ls' because
ta_in: '%LS' ஐ மாற்ற முடியவில்லை

source: Could not replace property '%1!ls!' on '%2!ls!' because
ta_in: சொத்து '%1! Ls!' '%2! ls!' ஏனெனில்

source: Could not retrieve URL of the file! %ls
ta_in: கோப்பின் முகவரி ஐ மீட்டெடுக்க முடியவில்லை! %ls

source: Could not retrieve revision %1!ls! of the file %2!ls!. Patching is not possible!
ta_in: திருத்தத்தை மீட்டெடுக்க முடியவில்லை %1! Ls! கோப்பில் %2! ls !. ஒட்டுதல் சாத்தியமில்லை!

source: Could not start diff viewer! %ls
ta_in: வேறுபட்ட பார்வையாளரைத் தொடங்க முடியவில்லை! %ls

source: Could not start external diff program! %ls
ta_in: வெளிப்புற வேறுபாடு நிரலைத் தொடங்க முடியவில்லை! %ls

source: Could not start external merge program! %ls
ta_in: வெளிப்புற ஒன்றிணைப்பு திட்டத்தைத் தொடங்க முடியவில்லை! %ls

source: Could not start print job.
ta_in: அச்சு வேலையைத் தொடங்க முடியவில்லை.

source: Could not start text viewer! %ls
ta_in: உரை பார்வையாளரைத் தொடங்க முடியவில்லை! %ls

source: Could not start thread!
ta_in: நூல் தொடங்க முடியவில்லை!

source: Coun&t
ta_in: கவுன் & டி

source: Count: %u matches.
ta_in: எண்ணிக்கை: %u போட்டிகள்.

source: Create &Library
ta_in: உருவாக்கு & நூலகம்

source: Create &patch file
ta_in: கோப்பை உருவாக்கு

source: Create &patch...
ta_in: உருவாக்கு & இணைப்பு ...

source: Create Changelist
ta_in: சேஞ்சலிச்ட்டை உருவாக்கவும்

source: Create Patch
ta_in: பேட்சை உருவாக்கவும்

source: Create a checkpoint. The selected modifications are saved to a shelf, but the local modifications are kept.
ta_in: சோதனைச் சாவடியை உருவாக்கவும். தேர்ந்தெடுக்கப்பட்ட மாற்றங்கள் ஒரு அலமாரியில் சேமிக்கப்படுகின்றன, ஆனால் உள்ளக மாற்றங்கள் வைக்கப்படுகின்றன.

source: Create code collaborator revie&w...
ta_in: குறியீடு ஒத்துழைப்பாளர் ரெவி & டபிள்யூ ...

source: Create copy in the repository from:
ta_in: இதிலிருந்து களஞ்சியத்தில் நகலை உருவாக்கவும்:

source: Create intermediate folders
ta_in: இடைநிலை கோப்புறைகளை உருவாக்கவும்

source: Create new directory: %ls
ta_in: புதிய கோப்பகத்தை உருவாக்கவும்: %ls

source: Create patch file
ta_in: இணைப்பு கோப்பை உருவாக்கவும்

source: Create repositor&y here
ta_in: களஞ்சியத்தை இங்கே உருவாக்கவும்

source: Create shortcut
ta_in: குறுக்குவழியை உருவாக்க

source: Creates a 'cheap' copy inside the repository used for branches or tagging
ta_in: கிளைகளுக்கு பயன்படுத்தப்படும் களஞ்சியத்திற்குள் ஒரு 'மலிவான' நகலை உருவாக்குகிறது

source: Creates a library folder with special settings for Subversion working copies
ta_in: கீழ்ப்படிதல் வேலை நகல்களுக்கான சிறப்பு அமைப்புகளுடன் நூலக கோப்புறையை உருவாக்குகிறது

source: Creates a patch file from the differences of the two files Create patch file
ta_in: இரண்டு கோப்புகளின் வேறுபாடுகளிலிருந்து ஒரு இணைப்பு கோப்பை உருவாக்குகிறது இணைப்பு கோப்பை உருவாக்கவும்

source: Creates a repository database at the current location
ta_in: தற்போதைய இடத்தில் ஒரு களஞ்சிய தரவுத்தளத்தை உருவாக்குகிறது

source: Creates a unified diff file with all changes you made
ta_in: நீங்கள் செய்த அனைத்து மாற்றங்களுடனும் ஒரு ஒருங்கிணைந்த வேறுபாடு கோப்பை உருவாக்குகிறது

source: Creating checkpoint "%s"
ta_in: சோதனைச் சாவடியை உருவாக்குதல் "%s"

source: Credits:
ta_in: வரவு:

source: Cu&t
ta_in: வெட்டு (&t)

source: Current version is:
ta_in: தற்போதைய பதிப்பு:

source: Current version is: %ls
ta_in: தற்போதைய பதிப்பு: %ls

source: Custom depths
ta_in: தனிப்பயன் ஆழம்

source: Custom title string. Available keywords are: {mergeurl}: the source url of the merge {revisions}: A comma separated list of the merged revisions, e.g., 3, 5, 6, 7 {revisionsr}: Like {revisions} but with an 'r' in front of the revisions {revrange}: A comma separated list of the merged revisions, grouped into ranges if possible, e.g., 3, 5-7
ta_in: தனிப்பயன் தலைப்பு சரம். கிடைக்கக்கூடிய முக்கிய வார்த்தைகள்: {மெர்சூர்ல்}: ஒன்றிணைப்பின் மூல முகவரி {திருத்தங்கள்}: ஒன்றிணைக்கப்பட்ட திருத்தங்களின் கமா பிரிக்கப்பட்ட பட்டியல், எ.கா., 3, 5, 6, 7 {திருத்தங்கள்}: {திருத்தங்கள்} ஆனால் திருத்தங்களுக்கு முன்னால் ஒரு 'r' உடன் {மறுபரிசீலனை}: இணைக்கப்பட்ட திருத்தங்களின் கமாவைப் பிரித்து, முடிந்தால் வரம்புகளாக தொகுக்கப்பட்டுள்ளது, எ.கா., 3, 5-7

source: Cut the selection and put it on the Clipboard Cut
ta_in: தேர்வை வெட்டி கிளிப்போர்டில் வைக்கவும் வெட்டு

source: D&etails
ta_in: விவரங்கள்

source: Dark theme
ta_in: இருண்ட கருப்பொருள்

source: Dark theme requires at least Win10 1803, and it must be enabled in the Windows system settings.
ta_in: இருண்ட கருப்பொருளுக்கு குறைந்தபட்சம் வின் 10 1803 தேவைப்படுகிறது, மேலும் இது சாளரங்கள் சிச்டம் அமைப்புகளில் இயக்கப்பட வேண்டும்.

source: Date
ta_in: தேதி

source: Date Range
ta_in: தேதி வரம்பு

source: Default
ta_in: இயல்புநிலை

source: Default &number of log messages
ta_in: இயல்புநிலை மற்றும் பதிவு செய்திகளின் எண்ணிக்கை

source: Default URL:
ta_in: இயல்புநிலை URL:

source: Default directory structure successfully created!
ta_in: இயல்புநிலை அடைவு அமைப்பு வெற்றிகரமாக உருவாக்கப்பட்டது!

source: Default monitor interval in minutes:
ta_in: நிமிடங்களில் இயல்புநிலை மானிட்டர் இடைவெளி:

source: Default path:
ta_in: இயல்புநிலை பாதை:

source: Default to UTF-8 encoding
ta_in: UTF-8 குறியாக்கத்திற்கு இயல்புநிலை

source: Delete
ta_in: நீக்கு

source: Delete &ignored files and folders
ta_in: கோப்புகள் மற்றும் கோப்புறைகளை நீக்கு மற்றும் புறக்கணிக்கவும்

source: Delete &unversioned files and folders
ta_in: நீக்குதல் மற்றும் மாற்றப்பட்ட கோப்புகள் மற்றும் கோப்புறைகள்

source: Delete Repository cache
ta_in: களஞ்சிய தற்காலிக சேமிப்பை நீக்கு

source: Delete Unversioned Items
ta_in: மாற்றப்படாத பொருட்களை நீக்கு

source: Delete and &ignore %d items by name
ta_in: பெயரால் %d உருப்படிகளை நீக்கவும் & புறக்கணிக்கவும்

source: Delete and &ignore multiple items by name
ta_in: பெயரால் பல உருப்படிகளை நீக்கவும் புறக்கணிக்கவும்

source: Delete and ignore %d items by &extension
ta_in: & நீட்டிப்பு மூலம் %d உருப்படிகளை நீக்கி புறக்கணிக்கவும்

source: Delete and ignore multiple items by &extension
ta_in: & நீட்டிப்பு மூலம் பல உருப்படிகளை நீக்கி புறக்கணிக்கவும்

source: Delete unversioned items
ta_in: மாற்றப்படாத பொருட்களை நீக்கு

source: Delete unversioned items...
ta_in: மாற்றப்படாத பொருட்களை நீக்கு ...

source: Delete The file is removed.
ta_in: அழி கோப்பு அகற்றப்பட்டது.

source: Deleted
ta_in: நீக்கப்பட்டது

source: Deleted node
ta_in: நீக்கப்பட்ட முனை

source: Deletes and adds the selected file(s) or the filemask to the 'ignore' list
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்பு (கள்) அல்லது ஃபைல்மாச்கை 'புறக்கணிக்கவும்' பட்டியலில் நீக்கிவிட்டு சேர்க்கிறது

source: Deletes files / folders from version control
ta_in: பதிப்பு கட்டுப்பாட்டிலிருந்து கோப்புகள் / கோப்புறைகளை நீக்குகிறது

source: Deletes files / folders from version control but keeps the file
ta_in: பதிப்பு கட்டுப்பாட்டிலிருந்து கோப்புகள் / கோப்புறைகளை நீக்குகிறது, ஆனால் கோப்பை வைத்திருக்கிறது

source: Deletes the action log file
ta_in: செயல் பதிவு கோப்பை நீக்குகிறது

source: Deleting
ta_in: நீக்குதல்

source: Deleting cached data
ta_in: தற்காலிக சேமிப்பு தரவை நீக்குகிறது

source: Deleting file
ta_in: கோப்பை நீக்குதல்

source: Depth
ta_in: ஆழம்

source: Depth:
ta_in: ஆழம்:

source: Deselect changelist
ta_in: சேஞ்சலிச்ட்டைத் தேர்வுசெய்க

source: Destination URL:
ta_in: இலக்கு URL:

source: Destination disk drive is full.
ta_in: இலக்கு வட்டு இயக்கி நிரம்பியுள்ளது.

source: Detect and highlight moved blocks
ta_in: நகர்த்தப்பட்ட தொகுதிகளைக் கண்டறிந்து முன்னிலைப்படுத்தவும்

source: Device Independent Bitmap a device independent bitmap
ta_in: சாதனம் சுயாதீன பிட்மேப் ஒரு சாதனம் சுயாதீன பிட்மேப்

source: Dialog sizes and positions
ta_in: உரையாடல் அளவுகள் மற்றும் நிலைகள்

source: Dialogs 1
ta_in: உரையாடல்கள் 1

source: Dialogs 2
ta_in: உரையாடல்கள் 2

source: Dialogs 3
ta_in: உரையாடல்கள் 3

source: Diff
ta_in: வேறுபாடு

source: Diff &Options
ta_in: வேறுபாடு & விருப்பங்கள்

source: Diff Options
ta_in: வேறுபட்ட விருப்பங்கள்

source: Diff Viewer
ta_in: வேறுபட்ட பார்வையாளர்

source: Diff added lines
ta_in: டிஃப் சேர்க்கப்பட்ட கோடுகள்

source: Diff command
ta_in: வேறுபட்ட கட்டளை

source: Diff comment
ta_in: கருத்து வேறுபாடு

source: Diff file:
ta_in: டிஃப் கோப்பு:

source: Diff header
ta_in: வேறுபட்ட தலைப்பு

source: Diff later
ta_in: பின்னர் வேறுபடுங்கள்

source: Diff options
ta_in: வேறுபட்ட விருப்பங்கள்

source: Diff position
ta_in: வேறுபட்ட நிலை

source: Diff removed lines
ta_in: அகற்றப்பட்ட கோடுகள்

source: Diff with URL
ta_in: முகவரி உடன் வேறுபடுகிறது

source: Diff with "%ls"
ta_in: "%LS" உடன் வேறுபடுகிறது

source: Difference between
ta_in: இடையே உள்ள வேறுபாடு

source: Differential path &names
ta_in: வேறுபட்ட பாதை மற்றும் பெயர்கள்

source: Diffing
ta_in: பரவல்

source: Diffs the working copy file with the one before the last commit.
ta_in: வேலை செய்யும் நகல் கோப்பை கடைசி உறுதிப்பாட்டிற்கு முன் வேறுபடுத்துகிறது.

source: Directories
ta_in: அடைவுகள்

source: Directory:
ta_in: அடைவு:

source: Disable status cache for elevated processes
ta_in: உயர்ந்த செயல்முறைகளுக்கு நிலை தற்காலிக சேமிப்பை முடக்கு

source: Discards local changes upon incoming deletes
ta_in: உள்வரும் நீக்குதலின் போது உள்ளக மாற்றங்களை நிராகரிக்கவும்

source: Disk full while accessing %1.
ta_in: %1 ஐ அணுகும்போது வட்டு நிரம்பியுள்ளது.

source: Dispatch exception: %1
ta_in: அனுப்பும் விதிவிலக்கு: %1

source: Display help for clicked on buttons, menus and windows Help
ta_in: பொத்தான்கள், மெனுக்கள் மற்றும் சாளரங்களில் சொடுக்கு செய்ய உதவியைக் காண்பி உதவி

source: Display help for current task or command Help
ta_in: தற்போதைய பணி அல்லது கட்டளைக்கான உதவியைக் காண்பி உதவி

source: Display instructions about how to use help Help
ta_in: உதவியை எவ்வாறு பயன்படுத்துவது என்பது பற்றிய வழிமுறைகளைக் காண்பி உதவி

source: Display program information, version number and copyright About
ta_in: நிரல் செய்தி, பதிப்பு எண் மற்றும் பதிப்புரிமை ஆகியவற்றைக் காண்பி பற்றி

source: Do not ask again for this script
ta_in: இந்த ச்கிரிப்டை மீண்டும் கேட்க வேண்டாம்

source: Do not expand keywords
ta_in: முக்கிய வார்த்தைகளை விரிவாக்க வேண்டாம்

source: Do not show the context menu for the following paths:
ta_in: பின்வரும் பாதைகளுக்கான சூழல் மெனுவைக் காட்ட வேண்டாம்:

source: Do reintegrate instead of automatic merge (old style)
ta_in: தானியங்கி ஒன்றிணைப்புக்கு பதிலாக மீண்டும் ஒருங்கிணைக்கவும் (பழைய பாணி)

source: Do this for all existing files
ta_in: தற்போதுள்ள அனைத்து கோப்புகளுக்கும் இதைச் செய்யுங்கள்

source: Do this for all existing folders
ta_in: தற்போதுள்ள அனைத்து கோப்புறைகளுக்கும் இதைச் செய்யுங்கள்

source: Do this for all existing items
ta_in: தற்போதுள்ள அனைத்து பொருட்களுக்கும் இதைச் செய்யுங்கள்

source: Do this for all selected items
ta_in: தேர்ந்தெடுக்கப்பட்ட அனைத்து பொருட்களுக்கும் இதைச் செய்யுங்கள்

source: Do this for all selected unversioned folders
ta_in: தேர்ந்தெடுக்கப்பட்ட அனைத்து மாற்றப்படாத கோப்புறைகளுக்கும் இதைச் செய்யுங்கள்

source: Do this for all unversioned items
ta_in: மாற்றப்படாத அனைத்து பொருட்களுக்கும் இதைச் செய்யுங்கள்

source: Do this for all unversioned/modified items
ta_in: மாற்றப்பட்ட/மாற்றியமைக்கப்பட்ட அனைத்து பொருட்களுக்கும் இதைச் செய்யுங்கள்

source: Do you really want to delete the shelf "%s"?
ta_in: நீங்கள் உண்மையில் அலமாரியை "%s" நீக்க விரும்புகிறீர்களா?

source: Do you want to drop the vendor branch into the working copy "%ls"?
ta_in: விற்பனையாளர் கிளையை "%LS" என்ற நகலில் கைவிட விரும்புகிறீர்களா?

source: Do you want to load the changed files?
ta_in: மாற்றப்பட்ட கோப்புகளை ஏற்ற விரும்புகிறீர்களா?
