Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: Updates the working copy to the current revision
ta_in: வேலை நகலை தற்போதைய திருத்தத்திற்கு புதுப்பிக்கிறது

source: Updating
ta_in: புதுப்பித்தல்

source: Updating ActiveX objects
ta_in: ஆக்டிவ்எக்ச் பொருள்களைப் புதுப்பித்தல்

source: Updating and retrying the lock...
ta_in: பூட்டைப் புதுப்பித்தல் மற்றும் மீண்டும் முயற்சித்தல் ...

source: Updating log cache
ta_in: பதிவு தற்காலிக சேமிப்பை புதுப்பித்தல்

source: Upgrade the working copy to the new 1.8 format.
ta_in: வேலை நகலை மேம்படுத்தவும் புதிய 1.8 வடிவத்திற்கு.

source: Upgrade working copy
ta_in: வேலை நகலை மேம்படுத்தவும்

source: Upgrading '%1!ls!'
ta_in: '%1! Ls!'

source: Url points to SVNParentPath list
ta_in: முகவரி SVNPARENTPATH பட்டியலை சுட்டிக்காட்டுகிறது

source: Urls
ta_in: முகவரி கள்

source: Use &one-pane view as default for 2-file diff
ta_in: 2-கோப்பு வேறுபாட்டிற்கான இயல்புநிலையாக & ஒரு பலகக் காட்சியைப் பயன்படுத்தவும்

source: Use &other text block
ta_in: பயன்படுத்த & பிற உரை தொகுதி

source: Use &text viewer to view blames
ta_in: குற்றவாளிகளைக் காண பார்வையாளரைப் பயன்படுத்தவும்

source: Use '*' as a wildcard character when specifying an exception. To separate multiple exceptions, use commas (','). Example: *.mylan.com, *.company.com
ta_in: விதிவிலக்கைக் குறிப்பிடும்போது வைல்டு அட்டை எழுத்தாக '*' ஐப் பயன்படுத்தவும். பல விதிவிலக்குகளை பிரிக்க, காற்புள்ளிகளைப் பயன்படுத்தவும் (','). எடுத்துக்காட்டு: *.mylan.com, *.company.com

source: Use 'mine' text block
ta_in: 'என்னுடைய' உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use 'mine' text block then 'theirs'
ta_in: 'என்னுடைய' உரைத் தொகுதியை 'அவர்களுடையது' பயன்படுத்தவும்

source: Use 'theirs' text block
ta_in: 'அவர்களுடைய' உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use 'theirs' text block then 'mine'
ta_in: 'அவர்களுடைய' உரை தொகுதி பின்னர் 'என்னுடையது' பயன்படுத்தவும்

source: Use Aero dialogs
ta_in: ஏரோ உரையாடல்களைப் பயன்படுத்தவும்

source: Use Ribbons
ta_in: ரிப்பன்களைப் பயன்படுத்துங்கள்

source: Use URL of &WC as the default "From:" URL
ta_in: இயல்புநிலையாக "முகவரி இன் முகவரி ஐப் பயன்படுத்தவும்:" முகவரி

source: Use Unified Diff from &clipboard
ta_in: & கிளிப்போர்டில் இருந்து ஒருங்கிணைந்த வேறுபாட்டைப் பயன்படுத்தவும்

source: Use all content from the left view Use left file
ta_in: இடது பார்வையில் இருந்து அனைத்து உள்ளடக்கங்களையும் பயன்படுத்தவும் இடது கோப்பைப் பயன்படுத்தவும்

source: Use block from left before right
ta_in: வலதுபுறத்தில் இடமிருந்து தொகுதியைப் பயன்படுத்தவும்

source: Use block from left view before block from right view Use block from left before right
ta_in: வலது பார்வையில் இருந்து தடுப்பதற்கு முன் இடது பார்வையில் இருந்து தொகுதியைப் பயன்படுத்தவும் வலதுபுறத்தில் இடமிருந்து தொகுதியைப் பயன்படுத்தவும்

source: Use block from right before left
ta_in: இடதுபுறத்தில் வலதுபுறத்திலிருந்து தொகுதியைப் பயன்படுத்தவும்

source: Use block from right view before block from left view Use block from right before left
ta_in: இடது பார்வையில் இருந்து தொகுதிக்கு முன் வலது பார்வையில் இருந்து தொகுதியைப் பயன்படுத்தவும் இடதுபுறத்தில் வலதுபுறத்திலிருந்து தொகுதியைப் பயன்படுத்தவும்

source: Use both text blocks (this one first)
ta_in: இரண்டு உரை தொகுதிகளையும் பயன்படுத்தவும் (இது முதலில்)

source: Use both text blocks (this one last)
ta_in: இரண்டு உரை தொகுதிகளையும் பயன்படுத்தவும் (இது கடைசியாக)

source: Use dark mode
ta_in: இருண்ட பயன்முறையைப் பயன்படுத்தவும்

source: Use left block
ta_in: இடது தொகுதி பயன்படுத்தவும்

source: Use left file
ta_in: இடது கோப்பைப் பயன்படுத்தவும்

source: Use recycle bin when reverting
ta_in: மாற்றும் போது மறுசுழற்சி தொட்டியைப் பயன்படுத்தவும்

source: Use regular expression
ta_in: வழக்கமான வெளிப்பாட்டைப் பயன்படுத்தவும்

source: Use right block
ta_in: வலது தொகுதி பயன்படுத்தவும்

source: Use spaces
ta_in: இடைவெளிகளைப் பயன்படுத்துங்கள்

source: Use system locale for date/time
ta_in: தேதி/நேரத்திற்கு கணினி இருப்பிடத்தைப் பயன்படுத்தவும்

source: Use text block from '&mine'
ta_in: '& என்னுடையது' இலிருந்து உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use text block from '&theirs'
ta_in: '& அவர்களுடைய' இலிருந்து உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use text block from 'm&ine' before 'theirs'
ta_in: 'அவர்களுடைய' முன் 'எம் & இன்' இலிருந்து உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use text block from 'mine' before 'theirs' Use 'mine' text block then 'theirs'
ta_in: 'என்னுடையது' என்பதிலிருந்து 'என்னுடையது' முன் உரைத் தொகுதியைப் பயன்படுத்தவும் 'என்னுடைய' உரைத் தொகுதியை 'அவர்களுடையது' பயன்படுத்தவும்

source: Use text block from 'mine' Use 'mine' text block
ta_in: 'என்னுடையது' என்பதிலிருந்து உரைத் தொகுதியைப் பயன்படுத்தவும் 'என்னுடைய' உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use text block from 't&heirs' before 'mine'
ta_in: 'என்னுடையது' முன் 'டி & வாரிசுகள்' இலிருந்து உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use text block from 'theirs' before 'mine' Use 'theirs' text block then 'mine'
ta_in: 'என்னுடையது' முன் 'அவர்களுடையது' என்பதிலிருந்து உரைத் தொகுதியைப் பயன்படுத்தவும் 'அவர்களுடைய' உரைத் தொகுதி பின்னர் 'என்னுடையது' பயன்படுத்தவும்

source: Use text block from 'theirs' Use 'theirs' text block
ta_in: 'அவர்களுடைய' இலிருந்து உரைத் தொகுதியைப் பயன்படுத்தவும் 'அவர்களுடைய' உரைத் தொகுதியைப் பயன்படுத்தவும்

source: Use text block from the left view Use left block
ta_in: இடது பார்வையில் இருந்து உரைத் தொகுதியைப் பயன்படுத்தவும் இடது தொகுதி பயன்படுத்தவும்

source: Use th&is text block
ta_in: TH & IS உரை தொகுதி பயன்படுத்தவும்

source: Use the found path. Apply the patch to %ls
ta_in: கண்டுபிடிக்கப்பட்ட பாதையைப் பயன்படுத்தவும். பேட்சைப் பயன்படுத்துங்கள் %ls

source: Use the log dialog to select the revisions you want to merge, or enter the revisions to merge, separated by commas. A revision range can be specified by a dash. Example: 4-7,9,11,15-HEAD@pegrevision To merge all revisions (reintegrate/automatic merge), leave the box empty.
ta_in: நீங்கள் ஒன்றிணைக்க விரும்பும் திருத்தங்களைத் தேர்ந்தெடுக்க பதிவு உரையாடலைப் பயன்படுத்தவும் அல்லது ஒன்றிணைக்க திருத்தங்களை உள்ளிடவும், காற்புள்ளிகளால் பிரிக்கப்பட்டுள்ளது. திருத்த வரம்பை ஒரு கோடு மூலம் குறிப்பிடலாம். எடுத்துக்காட்டு: 4-7,9,11,15-தலை@பெக்ரெவிசன் அனைத்து திருத்தங்களையும் ஒன்றிணைக்க (மீண்டும் ஒருங்கிணைக்க/தானியங்கி ஒன்றிணைப்பு), பெட்டியை காலியாக விடவும்.

source: Use the original path. Apply the patch to %ls
ta_in: அசல் பாதையைப் பயன்படுத்தவும். பேட்சைப் பயன்படுத்துங்கள் %ls

source: Use this &whole file
ta_in: இந்த மற்றும் முழு கோப்பைப் பயன்படுத்தவும்

source: Use this block on left
ta_in: இடதுபுறத்தில் இந்த தொகுதியைப் பயன்படுத்தவும்

source: Use this if the URL of the repository has changed
ta_in: களஞ்சியத்தின் முகவரி மாறிவிட்டால் இதைப் பயன்படுத்தவும்

source: Use whole other &file
ta_in: முழு கோப்பையும் பயன்படுத்தவும்

source: User cancelled
ta_in: பயனர் ரத்து செய்யப்பட்டது

source: Username
ta_in: பயனர்பெயர்

source: Username:
ta_in: பயனர்பெயர்:

source: Users to ignore:
ta_in: புறக்கணிக்க பயனர்கள்:

source: Uses the status cache type 'none' for elevated processes
ta_in: உயர்ந்த செயல்முறைகளுக்கு நிலை கேச் வகை 'எதுவுமில்லை' பயன்படுத்துகிறது

source: V2: Faster, no server connection required (recommended)
ta_in: வி 2: வேகமாக, சேவையக இணைப்பு தேவையில்லை (பரிந்துரைக்கப்படுகிறது)

source: V3: Slower, requires server connection.
ta_in: வி 3: மெதுவாக, சேவையக இணைப்பு தேவை.

source: Valid command line options are: /base:<path to base file> /basename:<name to show on the view title> /theirs:<path to their file> /theirsname:<name to show on the view title> /mine:<path to your file> /minename:<name to show on the view title> /merged:<path to resulting merged file> /mergedname:<name to show on the view title> /diff:<path to unified diff file> /patchpath:<path to folder> /saverequired /saverequiredonconflicts /oneway <forces the one-way view> /line:<line number to jump to>
ta_in: செல்லுபடியாகும் கட்டளை வரி விருப்பங்கள்: /அடிப்படை: <அடிப்படை கோப்பிற்கான பாதை> /அடிப்படை பெயர்: <பார்வை தலைப்பில் காட்ட பெயர்> /அவர்களுடையது: <அவர்களின் கோப்பிற்கான பாதை> /அவர்களின் பெயர்: <பார்வை தலைப்பில் காட்ட பெயர்> /என்னுடையது: <உங்கள் கோப்பிற்கான பாதை> /minename: <பார்வை தலைப்பில் காட்ட பெயர்> /ஒன்றிணைக்கப்பட்டது: <விளைவாக இணைக்கப்பட்ட கோப்பிற்கான பாதை> /இணைக்கப்பட்ட பெயர்: <பார்வை தலைப்பில் காட்ட பெயர்> /வேறுபாடு: <ஒருங்கிணைந்த வேறுபாடு கோப்புக்கான பாதை> /பேட்ச்பாத்: <கோப்புறைக்கு பாதை> /saverequired /savereciedonconflicts /ஒன்வே <ஒரு வழி பார்வையை கட்டாயப்படுத்துகிறது> /வரி: <வரி செல்ல வரி எண்>

source: Validation of the property value failed!
ta_in: சொத்து மதிப்பின் சரிபார்ப்பு தோல்வியடைந்தது!

source: Value
ta_in: மதிப்பு

source: Vendor branch
ta_in: விற்பனையாளர் கிளை

source: Version
ta_in: பதிப்பு

source: Version %d - %s
ta_in: பதிப்பு %d - %s

source: Version %d.%d.%d.%d
ta_in: பதிப்பு%d.%d.%d.%d

source: Version Information
ta_in: பதிப்பு செய்தி

source: Versioned
ta_in: பதிப்பு

source: View
ta_in: பார்வை

source: View Bars
ta_in: பார்களைக் காண்க

source: View revision for path in &webviewer
ta_in: பாத் இன் & வெப்வியூவருக்கான திருத்தத்தைக் காண்க

source: View revision in &webviewer
ta_in: & வெப்வியூவரில் திருத்தத்தைக் காண்க

source: Visit our website
ta_in: எங்கள் வலைத்தளத்தைப் பார்வையிடவும்

source: WARNING: Only change these settings if you are absolutely sure what you are doing! To set the values to their default, delete the value text.
ta_in: எச்சரிக்கை: நீங்கள் என்ன செய்கிறீர்கள் என்று உறுதியாக இருந்தால் மட்டுமே இந்த அமைப்புகளை மாற்றவும்! மதிப்புகளை இயல்புநிலைக்கு அமைக்க, மதிப்பு உரையை நீக்கவும்.

source: WC Revision:
ta_in: WC திருத்தம்:

source: WC node
ta_in: WC முனை

source: WC node border
ta_in: WC முனை எல்லை

source: Wait
ta_in: காத்திரு

source: Wait for the script to finish
ta_in: ச்கிரிப்ட் முடிவடையும் வரை காத்திருங்கள்

source: Waiting for monitoring thread to finish...
ta_in: நூல் முடிக்க காத்திருக்கிறது ...

source: Want to go offline?
ta_in: ஆஃப்லைனில் செல்ல வேண்டுமா?

source: Warning
ta_in: எச்சரிக்கை

source: Warning!
ta_in: எச்சரிக்கை!

source: When a small log cache has not been used for the given number of days, it will be removed automatically.
ta_in: கொடுக்கப்பட்ட ஒரு சிறிய பதிவு தற்காலிக சேமிப்பு பயன்படுத்தப்படாதபோது நாட்களின் எண்ணிக்கை, அது தானாக அகற்றப்படும்.

source: When activated, hold down the SHIFT key when right-clicking to get the TortoiseSVN menus added to the context menu
ta_in: செயல்படுத்தும்போது, சூழல் பட்டியலில் சேர்க்கப்பட்ட ஆமை மற்றும் மெனுக்களைப் பெற வலது சொடுக்கு செய்யும் போது சிப்ட் விசையை அழுத்திப் பிடிக்கவும்

source: When connecting to the repository server is not possible, TSVN can switch to using cached data only. Select the default behaviour here.
ta_in: களஞ்சிய சேவையகத்துடன் இணைக்கும்போது சாத்தியமில்லை, டி.எச்.வி.என் தற்காலிக சேமிப்பு தரவைப் பயன்படுத்த முடியும். இயல்புநிலை நடத்தை இங்கே தேர்ந்தெடுக்கவும்.

source: When enabled, TortoiseSVN move/copy context menu items will be available when dragging folders / files
ta_in: இயக்கப்பட்டால், கோப்புறைகள் / கோப்புகளை இழுக்கும்போது ஆமை வேன் நகர்வு / நகல் சூழல் பட்டியல் உருப்படிகள் கிடைக்கும்

source: When enabled, the versioned items listed in the commit dialog are automatically selected
ta_in: இயக்கப்பட்டால், கமிட் உரையாடலில் பட்டியலிடப்பட்ட பதிப்பு உருப்படிகள் தானாகவே தேர்ந்தெடுக்கப்படுகின்றன

source: When locking one or more selected files, shows a dialog asking for a descriptive message about the locking
ta_in: ஒன்று அல்லது அதற்கு மேற்பட்ட தேர்ந்தெடுக்கப்பட்ட கோப்புகளைப் பூட்டும்போது, உரையாடலைக் காட்டுகிறது பூட்டுதல் பற்றிய விளக்கமான செய்தியைக் கேட்பது

source: Whitespace changes (tabs, spaces)
ta_in: வைட்ச்பேச் மாற்றங்கள் (தாவல்கள், இடைவெளிகள்)

source: Whitespaces
ta_in: வெள்ளை

source: Win 11 Context Menu
ta_in: செய் 11 சூழல் பட்டியல்

source: Working Copy
ta_in: வேலை நகல்

source: Working Copy Path:
ta_in: வேலை நகல் பாதை:

source: Working copy
ta_in: வேலை நகல்

source: Working copy relocated to %ls
ta_in: வேலை நகல் இடமாற்றம் செய்யப்பட்டது %ls

source: Working copy: %ls
ta_in: வேலை நகல்: %ls

source: Wrap Lines
ta_in: மடக்கு கோடுகள்

source: Wrap long lines
ta_in: நீண்ட கோடுகளை மடிக்கவும்

source: Wrap long lines at the right border of the view Wrap long lines
ta_in: பார்வையின் வலது எல்லையில் நீண்ட கோடுகளை மடிக்கவும் நீண்ட கோடுகளை மடிக்கவும்

source: Y
ta_in: ஒய்

source: You already have the latest version installed.
ta_in: நீங்கள் ஏற்கனவே அண்மைக் கால பதிப்பை நிறுவியுள்ளீர்கள்.

source: You can disable specific Overlay handlers here. Disabled handlers won't use up an overlay slot and give other shell extensions a chance to show their overlays.
ta_in: குறிப்பிட்ட மேலடுக்கு கையாளுபவர்களை இங்கே முடக்கலாம். ஊனமுற்ற கையாளுபவர்கள் மேலடுக்கு ச்லாட்டைப் பயன்படுத்த மாட்டார்கள் மற்றும் பிற செல் நீட்டிப்புகளுக்கு தங்கள் மேலடுக்குகளைக் காண்பிக்க வாய்ப்பளிக்கிறார்கள்.

source: You can only edit one file at a time from the repository browser. Please finish editing a file before editing another one.
ta_in: களஞ்சிய உலாவியில் இருந்து ஒரு நேரத்தில் ஒரு கோப்பை மட்டுமே நீங்கள் திருத்த முடியும். இன்னொன்றைத் திருத்துவதற்கு முன் ஒரு கோப்பைத் திருத்துவதை முடிக்கவும்.

source: You can't set this property on folders, only on files! If you want to set it on all files within that folder, you must activate the 'recursive' checkbox.
ta_in: இந்த சொத்தை கோப்புறைகளில் அமைக்க முடியாது, கோப்புகளில் மட்டுமே! அந்த கோப்புறையில் உள்ள எல்லா கோப்புகளிலும் நீங்கள் அதை அமைக்க விரும்பினால், நீங்கள் 'சுழல்நிலை' தேர்வுப்பெட்டியை செயல்படுத்த வேண்டும்.

source: You dropped more than one file or folder to add to the repository. It's not possible to do that in one step, so TortoiseSVN will add each file/folder individually, creating a new revision for every added item.
ta_in: களஞ்சியத்தில் சேர்க்க நீங்கள் ஒன்றுக்கு மேற்பட்ட கோப்புகள் அல்லது கோப்புறையை கைவிட்டீர்கள். ஒரு கட்டத்தில் அதைச் செய்ய முடியாது, எனவே ஆமை வி.என் ஒவ்வொரு கோப்பு/கோப்புறையையும் சேர்க்கும் தனித்தனியாக, ஒவ்வொரு கூடுதல் பொருளுக்கும் புதிய திருத்தத்தை உருவாக்குதல்.

source: You have marked changed blocks. How should those blocks be saved?
ta_in: மாற்றப்பட்ட தொகுதிகளை நீங்கள் குறித்துள்ளீர்கள். அந்த தொகுதிகள் எவ்வாறு சேமிக்கப்பட வேண்டும்?

source: You have modified properties without saving them first. Do you want to save them now?
ta_in: முதலில் பண்புகளை சேமிக்காமல் மாற்றியமைத்துள்ளீர்கள். இப்போது அவற்றைக் காப்பாற்ற விரும்புகிறீர்களா?

source: You have selected %d items to show the diff for. For every of these items a new instance of the diff viewer will be started. Do you really want to show the diff for so many items at once?
ta_in: மாறுபாட்டைக் காட்ட %d உருப்படிகளைத் தேர்ந்தெடுத்துள்ளீர்கள். இந்த ஒவ்வொரு உருப்படிகளுக்கும் வேறுபட்ட பார்வையாளரின் புதிய நிகழ்வு தொடங்கப்படும். ஒரே நேரத்தில் பல பொருட்களுக்கான வேறுபாட்டை நீங்கள் உண்மையில் காட்ட விரும்புகிறீர்களா?

source: You have to update your working copy first.
ta_in: உங்கள் பணி நகலை முதலில் புதுப்பிக்க வேண்டும்.

source: You haven't entered an issue number.
ta_in: நீங்கள் வெளியீட்டு எண்ணை உள்ளிடவில்லை.

source: You must restart your system for the changes to take effect.
ta_in: மாற்றங்கள் நடைமுறைக்கு வர உங்கள் கணினியை மறுதொடக்கம் செய்ய வேண்டும்.

source: You selected an unversioned folder for a commit!
ta_in: ஒரு உறுதிப்பாட்டிற்காக மாற்றப்படாத கோப்புறையைத் தேர்ந்தெடுத்தீர்கள்!

source: You will lose all data of the shelf. This action cannot be undone.
ta_in: நீங்கள் அலமாரியின் எல்லா தரவையும் இழப்பீர்கள். இந்த செயலை செயல்தவிர்க்க முடியாது.

source: You're trying to add the item '%1!ls!', but the item '%2!ls!' already exists. It seems the item got renamed outside Subversion but only with case changes. Do you really want to add it?
ta_in: நீங்கள் உருப்படியைச் சேர்க்க முயற்சிக்கிறீர்கள் '%1! Ls!', ஆனால் உருப்படி '%2! Ls!' ஏற்கனவே இருக்கிறது. உருப்படி வெளியே கீழ்ப்படிதலில் மறுபெயரிடப்பட்டதாகத் தெரிகிறது, ஆனால் வழக்கு மாற்றங்களுடன் மட்டுமே. நீங்கள் உண்மையில் அதைச் சேர்க்க விரும்புகிறீர்களா?

source: You've committed changes to external item that is tagged to a specific revision. Do you want to change the tagged revision now to the just committed revision?
ta_in: ஒரு குறிப்பிட்ட திருத்தத்திற்கு குறிக்கப்பட்ட வெளிப்புற உருப்படியில் மாற்றங்களை நீங்கள் செய்துள்ளீர்கள். குறிக்கப்பட்ட திருத்தத்தை இப்போது நியாயமான திருத்தத்திற்கு மாற்ற விரும்புகிறீர்களா?

source: Your previously entered log messages have been saved. Click here to read and insert them again.
ta_in: நீங்கள் முன்னர் உள்ளிட்ட பதிவு செய்திகள் சேமிக்கப்பட்டுள்ளன. அவற்றை மீண்டும் படிக்கவும் செருகவும் இங்கே சொடுக்கு செய்க.

source: Your version is:
ta_in: உங்கள் பதிப்பு:

source: Your version is: %d.%d.%d.%d
ta_in: உங்கள் பதிப்பு:%d.%d.%d.%d

source: Your working copy contains modifications. Lowest revision in working copy: %1!ld! Path: %2!ls!
ta_in: உங்கள் வேலை நகலில் மாற்றங்கள் உள்ளன. வேலை நகலில் மிகக் குறைந்த திருத்தம்: %1! LD! பாதை: %2! Ls!

source: Your working copy has local modifications. If you branch/tag from the HEAD revision, your local changes won't show up in the branch/tag!
ta_in: உங்கள் வேலை நகலில் உள்ளக மாற்றங்கள் உள்ளன. தலை திருத்தத்திலிருந்து நீங்கள் கிளை/குறிச்சொல் செய்தால், உங்கள் உள்ளக மாற்றங்கள் செய்யாது கிளை/குறிச்சொல்லில் காண்பி!

source: Your working copy points to %ls which appears to be a tag! You should first switch to a branch or the main trunk before committing.
ta_in: உங்கள் வேலை நகல் %LS ஐ சுட்டிக்காட்டுகிறது, இது ஒரு குறிச்சொல்லாகத் தோன்றுகிறது! நீங்கள் முதலில் ஒரு கிளைக்கு அல்லது முதன்மையான உடற்பகுதிக்கு மாற வேண்டும்.

source: Z
ta_in: சட்

source: Zoo&m out (-)
ta_in: பெரிதாக்கவும் (-)

source: Zoom &In
ta_in: பெரிதாக்க

source: Zoom &Out
ta_in: பெரிதாக்கவும்

source: Zoom &in Ctrl-+
ta_in: Ctrl-+ இல் பெரிதாக்கு

source: Zoom &out Ctrl--
ta_in: சூம் & அவுட் ctrl--

source: Zoom 100%
ta_in: 100% பெரிதாக்கவும்

source: Zoom i&n (+)
ta_in: பெரிதாக்க I & n (+)

source: Zoom in
ta_in: பெரிதாக்க

source: Zoom out
ta_in: சிறிதாக்கு

source: Zoom to &100%
ta_in: பெரிதாக்க & 100%

source: Zoom to fit
ta_in: பொருத்த பெரிதாக்க

source: Zoom to fit in height
ta_in: உயரத்தில் பொருத்த பெரிதாக்கவும்

source: Zoom to fit in width
ta_in: அகலத்தில் பொருந்தும் பெரிதாக்கவும்

source: "ignore-on-commit" files do not mark parent folder modified
ta_in: "கட்டளையை புறக்கணிக்கவும்" கோப்புகள் பெற்றோர் கோப்புறையை மாற்றியமைக்காது

source: Patterns match case-insensitively and must be specified in lower-case. Whitespaces will become part of the pattern. Allowed wildcards are '?' and '*'. Separate patterns using ';'
ta_in: வடிவங்கள் வழக்கு-அழுத்தத்துடன் பொருந்துகின்றன, மேலும் அவை கீழ்நோக்கி குறிப்பிடப்பட வேண்டும். ஒயிட்ச்பேச்கள் வடிவத்தின் ஒரு பகுதியாக மாறும். அனுமதிக்கப்பட்ட வைல்டு கார்டுகள் '?' மற்றும் '*'. ';' ஐப் பயன்படுத்தி தனி வடிவங்கள்;

source: added
ta_in: சேர்க்கப்பட்டது

source: added files
ta_in: கோப்புகள் சேர்க்கப்பட்டன

source: alias (%1!ls!): %2!ls!
ta_in: மாற்றுப்பெயர் ( %1! ls!): %2! ls!

source: alias: %ls
ta_in: மாற்றுப்பெயர்: %எல்.எச்

source: all &revisions
ta_in: அனைத்து & திருத்தங்கள்

source: all information
ta_in: அனைத்து தகவல்களும்

source: an unnamed file
ta_in: பெயரிடப்படாத கோப்பு

source: and
ta_in: மற்றும்

source: and support the developers
ta_in: மற்றும் டெவலப்பர்களை ஆதரிக்கவும்

source: another item already exists in its place.
ta_in: மற்றொரு உருப்படி ஏற்கனவே அதன் இடத்தில் உள்ளது.

source: ask repository first if 'online' - work entirely from cache if 'offline'
ta_in: 'நிகழ்நிலை' என்றால் முதலில் களஞ்சியத்தைக் கேளுங்கள் - 'இணைப்பில்லாத' என்றால் கேச் இருந்து முழுமையாக வேலை செய்யுங்கள்

source: at this revision
ta_in: இந்த திருத்தத்தில்

source: author
ta_in: ஆசிரியர்

source: authors:
ta_in: ஆசிரியர்கள்:

source: bugtraq:append Set to 'false' if you want the bugtracking ID to be inserted at the top of the log message. The default is 'true' which means the bugtracking ID is appended to the log message.
ta_in: gugtraq: சேர்க்கவும் பிழைத்திருத்தம் ஐடி செருகப்பட வேண்டும் என்று நீங்கள் விரும்பினால் 'பொய்' என அமைக்கவும் பதிவு செய்தி. இயல்புநிலை 'உண்மை', அதாவது பிழைத்திருத்தம் ஐடி பதிவு செய்தியுடன் சேர்க்கப்பட்டுள்ளது.

source: bugtraq:label Label text to show for the edit box where the user enters the issue number.
ta_in: புக்ட்ராக்: சிட்டை சிட்டை உரை பயனர் வெளியீட்டு எண்ணில் நுழையும் பெட்டியைக் காண்பிக்க.

source: bugtraq:logregex two regular expressions separated by a newline. The first expression is used to find a string referring to an issue, the second expression is used to extract the bare bug ID from that string.
ta_in: bugtraq: logregex இரண்டு வழக்கமான வெளிப்பாடுகள் ஒரு புதிய வரியால் பிரிக்கப்பட்டன. முதல் வெளிப்பாடு ஒரு சிக்கலைக் குறிக்கும் ஒரு சரத்தைக் கண்டுபிடிக்கப் பயன்படுகிறது, இரண்டாவது வெளிப்பாடு அந்த சரத்திலிருந்து வெற்று பிழை ஐடியைப் பிரித்தெடுக்கப் பயன்படுகிறது.

source: bugtraq:message String which is appended to a log message when an issue number is entered. The string must contain '%BUGID%' which gets replaced with the issue number.
ta_in: பிழைத்திருத்தம்: செய்தி சிக்கல் எண் உள்ளிடும்போது பதிவு செய்தியுடன் சேர்க்கப்படும் சரம். சரத்தில் '%bugid%' இருக்க வேண்டும், இது வெளியீட்டு எண்ணுடன் மாற்றப்படுகிறது.

source: bugtraq:number Set to 'false' if your bugtracking system has issues which are referenced not by numbers.
ta_in: பிழைத்திருத்தம்: எண் உங்கள் பிழைத்திருத்த அமைப்பில் எண்களால் குறிப்பிடப்படாத சிக்கல்கள் இருந்தால் 'பொய்' என அமைக்கவும்.

source: bugtraq:providerparams the parameters passed to the IBugTraqProvider
ta_in: புக்ட்ராக்: வழங்குநர்கள் அளவுருக்கள் iBugtraqProvider க்கு அனுப்பப்பட்டன

source: bugtraq:provideruuid the COM uuid of the IBugTraqProvider
ta_in: பிழைத்திருத்தம்: வழங்குநர் ibugtraqprovider இன் com uuid

source: bugtraq:url URL pointing to the issue tracker. It must contain '%BUGID%' which gets replaced with the issue number.
ta_in: பிழைத்திருத்தம்: முகவரி வெளியீடு டிராக்கரை சுட்டிக்காட்டும் முகவரி. அதில் '%bugid%' இருக்க வேண்டும் வெளியீட்டு எண்ணுடன் மாற்றப்படுகிறது.

source: changes total:
ta_in: மொத்த மாற்றங்கள்:

source: column '%ls'
ta_in: '%LS' நெடுவரிசை

source: commits
ta_in: ஒப்புவி

source: committed revision
ta_in: உறுதியான திருத்தம்

source: conflicted
ta_in: சண்டையிட்டனர்

source: connection:
ta_in: இணைப்பு:

source: copied from %1!ls! - revision %2!ld!
ta_in: இருந்து நகலெடுக்கப்பட்டது %1! Ls! - திருத்தம் %2! எல்.டி!

source: copied:
ta_in: நகலெடுக்கப்பட்டது:

source: current size: %1!ls! old size: %2!ls! change: %3!ls!
ta_in: தற்போதைய அளவு: %1! ls! பழைய அளவு: %2! ls! மாற்றம்: %3! ls!

source: day
ta_in: நாள்

source: days
ta_in: நாட்கள்

source: deleted
ta_in: நீக்கப்பட்டது

source: disk [kB]:
ta_in: வட்டு [KB]:

source: en
ta_in: என்

source: eol style
ta_in: EOL நடை

source: external
ta_in: வெளிப்புறம்

source: failed hunks: %d
ta_in: தோல்வியுற்ற அங்க்ச்: %d

source: file external:
ta_in: வெளிப்புற கோப்பு:

source: file/foldernames
ta_in: கோப்பு/கோப்புறை பெயர்கள்

source: full paths
ta_in: முழு பாதைகள்

source: get HEAD revision:
ta_in: தலை திருத்தத்தைப் பெறுங்கள்:

source: get repository root URLs:
ta_in: களஞ்சிய ரூட் முகவரி களைப் பெறுங்கள்:

source: ignored
ta_in: புறக்கணிக்கப்பட்டது

source: ignoring ancestry
ta_in: வம்சாவளியை புறக்கணித்தல்

source: include properties
ta_in: பண்புகள் அடங்கும்

source: incomplete
ta_in: முழுமையற்ற

source: inherited from
ta_in: இருந்து மரபு

source: it does not exist (missing or moved away?).
ta_in: அது இல்லை (காணவில்லை அல்லது விலகிச் சென்றதா?).

source: it is already deleted.
ta_in: இது ஏற்கனவே நீக்கப்பட்டுள்ளது.

source: it is unversioned.
ta_in: அது மாற்றப்பட்டுள்ளது.

source: keep the file lists in English
ta_in: கோப்பு பட்டியல்களை ஆங்கிலத்தில் வைத்திருங்கள்

source: last HEAD update:
ta_in: கடைசி தலை புதுப்பிப்பு:

source: last read:
ta_in: கடைசியாக படியுங்கள்:

source: last update:
ta_in: கடைசியாக புதுப்பிக்கப்பட்டது:

source: leave username and password empty if the repository allows anonymous access, or if the authentication is stored already
ta_in: களஞ்சியம் அநாமதேய அணுகலை அனுமதித்தால், அல்லது ஏற்பு ஏற்கனவே சேமிக்கப்பட்டால் பயனர்பெயர் மற்றும் கடவுச்சொல்லை காலியாக விடுங்கள்

source: locked
ta_in: பூட்டப்பட்டுள்ளது

source: locked (cleanup required):
ta_in: பூட்டப்பட்ட (தூய்மைப்படுத்தல் தேவை):

source: log text &editor
ta_in: பதிவு உரை எடிட்டர்

source: max revision:
ta_in: அதிகபட்ச திருத்தம்:

source: max. at this revision
ta_in: அதிகபட்சம். இந்த திருத்தத்தில்
