Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: The path/URL you've entered seems to be illegal on Windows! You can try it anyway, but you might get an error later. A valid path on windows must not contain '<>|"?*:' or one of the following device names: com1-com9, lpt1-lpt9, prn, aux, con, nul, clock$ Do you want to proceed anyway?
ta_in: நீங்கள் நுழைந்த பாதை/URL சாளரங்களில் சட்டவிரோதமானது என்று தெரிகிறது! நீங்கள் எப்படியும் முயற்சி செய்யலாம், ஆனால் பின்னர் பிழையைப் பெறலாம். சாளரங்களில் செல்லுபடியாகும் பாதையில் '<> | "?*:' அல்லது பின்வரும் சாதன பெயர்களில் ஒன்று இருக்கக்கூடாது: COM1-COM9, LPT1-LPT9, PRN, AUX, CON, NUL, கடிகை $ நீங்கள் எப்படியும் தொடர விரும்புகிறீர்களா?

source: The path %1!ls! seems not to match the paths in the patchfile. But TortoiseMerge found the path %2!ls! matches it better. Do you want to use the suggested path instead?
ta_in: பாதை %1! Ls! பேட்ச்ஃபைலில் உள்ள பாதைகளுடன் பொருந்தவில்லை என்று தெரிகிறது. ஆனால் ஆமை பாதையை கண்டுபிடித்தது %2! Ls! அதை சிறப்பாக பொருத்துகிறது. அதற்கு பதிலாக பரிந்துரைக்கப்பட்ட பாதையைப் பயன்படுத்த விரும்புகிறீர்களா?

source: The regular expression is invalid! Please enter a valid regular expression.
ta_in: வழக்கமான வெளிப்பாடு தவறானது! சரியான வழக்கமான வெளிப்பாட்டை உள்ளிடவும்.

source: The repository was successfully created. Do you want to create the default folder structure (trunk/branches/tags) now?
ta_in: களஞ்சியம் வெற்றிகரமாக உருவாக்கப்பட்டது. இயல்புநிலை கோப்புறை கட்டமைப்பை (தண்டு/கிளைகள்/குறிச்சொற்கள்) இப்போது உருவாக்க விரும்புகிறீர்களா?

source: The returned error was: %ls
ta_in: திரும்பிய பிழை: %ls

source: The selected file appears to still have one or more conflict markers in it. Are you sure you want to mark the file resolved?
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்பில் இன்னும் ஒன்று அல்லது அதற்கு மேற்பட்ட மோதல் குறிப்பான்கள் இருப்பதாகத் தெரிகிறது. தீர்க்கப்பட்ட கோப்பை நீங்கள் நிச்சயமாகக் குறிக்க விரும்புகிறீர்களா?

source: The settings file can not be decrypted with the specified password! Do you want to overwrite the sync file?
ta_in: அமைப்புகள் கோப்பை குறிப்பிட்ட கடவுச்சொல்லுடன் மறைகுறியாக்க முடியாது! ஒத்திசைவு கோப்பை மேலெழுத விரும்புகிறீர்களா?

source: The specified path/url %ls is invalid!
ta_in: குறிப்பிட்ட பாதை/url %ls தவறானது!

source: The target already exists.
ta_in: இலக்கு ஏற்கனவே உள்ளது.

source: The target file %ls already exists. Do you want to replace the file?
ta_in: இலக்கு கோப்பு %ls ஏற்கனவே இருக்கிறது. கோப்பை மாற்ற விரும்புகிறீர்களா?

source: The target folder %ls is not empty! Are you sure you want to checkout/export into that folder?
ta_in: இலக்கு கோப்புறை %ls காலியாக இல்லை! அந்த கோப்புறையில் புதுப்பிக்க/ஏற்றுமதி செய்ய விரும்புகிறீர்களா?

source: The target has local modifications
ta_in: இலக்கு உள்ளக மாற்றங்களைக் கொண்டுள்ளது

source: The target working copy '%ls' has local modifications. It is recommended to commit those changes first before merging new changes.
ta_in: இலக்கு வேலை நகல் '%LS' உள்ளக மாற்றங்களைக் கொண்டுள்ளது. புதிய மாற்றங்களை இணைப்பதற்கு முன் அந்த மாற்றங்களை முதலில் செய்ய பரிந்துரைக்கப்படுகிறது.

source: The target working copy has local modifications!
ta_in: இலக்கு வேலை நகலில் உள்ளக மாற்றங்கள் உள்ளன!

source: The text is identical, but the files do not match! The following differences were found:
ta_in: உரை ஒரே மாதிரியானது, ஆனால் கோப்புகள் பொருந்தவில்லை! பின்வரும் வேறுபாடுகள் காணப்பட்டன:

source: The time in seconds after which the parsing of the selected files stops. A lower value will make the auto-completion list available sooner, but maybe not scan all files.
ta_in: தேர்ந்தெடுக்கப்பட்ட கோப்புகளின் பாகுபடுத்தல் நிறுத்தப்படும் விநாடிகளில் நேரம். குறைந்த மதிப்பு தானாக நிறைவு பட்டியலை விரைவில் கிடைக்கச் செய்யும், ஆனால் எல்லா கோப்புகளையும் ச்கேன் செய்யக்கூடாது.

source: The two selected URL's are not created from the same root. It's not possible to show the log messages between them!
ta_in: தேர்ந்தெடுக்கப்பட்ட இரண்டு முகவரி கள் ஒரே மூலத்திலிருந்து உருவாக்கப்படவில்லை. அவற்றுக்கிடையே பதிவு செய்திகளைக் காண்பிக்க முடியாது!

source: The user who did the last commit
ta_in: கடைசியாக செய்த பயனர்

source: The user who owns the lock of the file
ta_in: கோப்பின் பூட்டு வைத்திருக்கும் பயனர்

source: Their file:
ta_in: அவர்களின் கோப்பு:

source: Theirs
ta_in: அவர்களுடையது

source: There are changes or unversioned items inside one or more directories which you have included with svn:externals. Those files are not listed for commit. You need to commit those files separately.
ta_in: ஒன்று அல்லது அதற்கு மேற்பட்ட கோப்பகங்களுக்குள் மாற்றங்கள் அல்லது மாற்றப்படாத உருப்படிகள் உள்ளன, அவை எச்.வி.என்: வெளிப்புறங்களுடன் நீங்கள் சேர்த்துள்ளன. அந்த கோப்புகள் கமிட்டத்திற்காக பட்டியலிடப்படவில்லை. நீங்கள் அந்தக் கோப்புகளை தனித்தனியாக செய்ய வேண்டும்.

source: There are currently %d overlay handlers installed besides the ones Tortoise uses.
ta_in: ஆமை பயன்படுத்தும் நபர்களைத் தவிர தற்போது %d மேலடுக்கு கையாளுபவர்கள் நிறுவப்பட்டுள்ளனர்.

source: There are more editable views. What view do you want to save?
ta_in: இன்னும் திருத்தக்கூடிய காட்சிகள் உள்ளன. நீங்கள் என்ன பார்வையை சேமிக்க விரும்புகிறீர்கள்?

source: There are no issue-tracker providers available.
ta_in: சிக்கல்-கண்காணிப்பு வழங்குநர்கள் எதுவும் கிடைக்கவில்லை.

source: There are still unresolved conflicts in line %d! You should resolve those conflicts first before saving. Do you want to save the file with the conflicts still there? If you click YES, then you have to manually resolve the conflicts in another editor!
ta_in: %d வரிசையில் இன்னும் தீர்க்கப்படாத மோதல்கள் உள்ளன! சேமிப்பதற்கு முன் அந்த மோதல்களை நீங்கள் முதலில் தீர்க்க வேண்டும். இன்னும் அங்குள்ள மோதல்களுடன் கோப்பை சேமிக்க விரும்புகிறீர்களா? நீங்கள் ஆம் என்பதைக் சொடுக்கு செய்தால், மற்றொரு எடிட்டரில் உள்ள மோதல்களை நீங்கள் கைமுறையாக தீர்க்க வேண்டும்!

source: There are unsaved modifications! Do you want to save your changes?
ta_in: சேமிக்கப்படாத மாற்றங்கள் உள்ளன! உங்கள் மாற்றங்களைச் சேமிக்க விரும்புகிறீர்களா?

source: There has been a problem contacting the server. Do you want to see the cached data instead? Please understand that the cached data may be outdated, incomplete or even misleading due to incomplete history data. The error was:
ta_in: சேவையகத்தைத் தொடர்புகொள்வதில் சிக்கல் உள்ளது. அதற்கு பதிலாக தற்காலிக சேமிப்பு தரவைப் பார்க்க விரும்புகிறீர்களா? தற்காலிக சேமிப்பு தரவு காலாவதியானதாக இருக்கலாம் என்பதை புரிந்து கொள்ளுங்கள், முழுமையற்ற வரலாற்றுத் தரவு காரணமாக முழுமையற்ற அல்லது தவறாக வழிநடத்தும். பிழை:

source: There is nothing to add. All the files and folders are either under version control or have been ignored using the svn:ignore property or the global ignore configuration setting.
ta_in: சேர்க்க எதுவும் இல்லை. அனைத்து கோப்புகள் மற்றும் கோப்புறைகள் பதிப்பு கட்டுப்பாட்டின் கீழ் உள்ளன அல்லது எச்.வி.என் ஐப் பயன்படுத்தி புறக்கணிக்கப்பட்டுள்ளன: சொத்து அல்லது உலகளாவிய புறக்கணிப்பு உள்ளமைவு அமைப்பை புறக்கணிக்கவும்.

source: There's already a plugin configured for this path
ta_in: இந்த பாதைக்கு ஏற்கனவே ஒரு சொருகி கட்டமைக்கப்பட்டுள்ளது

source: There's nothing to unlock. No file has a lock in this working copy.
ta_in: திறக்க எதுவும் இல்லை. இந்த வேலை நகலில் எந்த கோப்பிலும் ஒரு பூட்டு இல்லை.

source: These are more recently saved than the currently open documents and contain changes that were made before the application closed.
ta_in: தற்போது திறந்த ஆவணங்களை விட இவை அண்மைக் காலத்தில் சேமிக்கப்படுகின்றன மற்றும் விண்ணப்பம் மூடப்படுவதற்கு முன்பு செய்யப்பட்ட மாற்றங்கள் உள்ளன.

source: This commit is not recursive, and there are moved/renamed/copied folders selected for commit. Such moves/renames are always performed recursively in the repository. Do you want to commit anyway?
ta_in: இந்த கமிட் சுழல்நிலை அல்ல, மேலும் கமிட்டிற்காக தேர்ந்தெடுக்கப்பட்ட/மறுபெயரிடப்பட்ட/நகலெடுக்கப்பட்ட கோப்புறைகள் உள்ளன. இத்தகைய நகர்வுகள்/மறுபெயரிடங்கள் எப்போதும் களஞ்சியத்தில் மீண்டும் செய்யப்படுகின்றன. நீங்கள் எப்படியும் செய்ய விரும்புகிறீர்களா?

source: This error was generated by a custom hook script on the Subversion server. Please contact your server administrator for help with resolving this issue.
ta_in: இந்த பிழை துணைப்பிரிவு சேவையகத்தில் தனிப்பயன் ஊக் ச்கிரிப்ட் மூலம் உருவாக்கப்பட்டது. இந்த சிக்கலைத் தீர்க்க உதவ உங்கள் சேவையக நிர்வாகியை தொடர்பு கொள்ளவும்.

source: This error was generated by a custom post-commit hook script on the Subversion server. Please contact your server administrator for help with resolving this issue.
ta_in: இந்த பிழை துணை சேவையகத்தில் தனிப்பயன் போச்ட்-கமிட் ஊக் ச்கிரிப்ட் மூலம் உருவாக்கப்பட்டது. இந்த சிக்கலைத் தீர்க்க உதவ உங்கள் சேவையக நிர்வாகியை தொடர்பு கொள்ளவும்.

source: This error was generated by a custom post-lock hook script on the Subversion server. Please contact your server administrator for help with resolving this issue.
ta_in: இந்த பிழை துணை சேவையகத்தில் தனிப்பயன் போச்ட்-லாக் ஊக் ச்கிரிப்ட் மூலம் உருவாக்கப்பட்டது. இந்த சிக்கலைத் தீர்க்க உதவ உங்கள் சேவையக நிர்வாகியை தொடர்பு கொள்ளவும்.

source: This error was generated by a custom post-unlock hook script on the Subversion server. Please contact your server administrator for help with resolving this issue.
ta_in: இந்த பிழை துணை சேவையகத்தில் தனிப்பயன் போச்ட்-அன் லாக் ஊக் ச்கிரிப்ட் மூலம் உருவாக்கப்பட்டது. இந்த சிக்கலைத் தீர்க்க உதவ உங்கள் சேவையக நிர்வாகியை தொடர்பு கொள்ளவும்.

source: This file already exists!
ta_in: இந்த கோப்பு ஏற்கனவே உள்ளது!

source: This is not a valid URL. Please enter an URL here.
ta_in: இது சரியான முகவரி அல்ல. தயவுசெய்து இங்கே ஒரு முகவரி ஐ உள்ளிடவும்.

source: This is not a valid path! A valid path must not contain '<>|"?*:' or one of the following device names: com1-com9, lpt1-lpt9, prn, aux, con, nul, clock$
ta_in: இது சரியான பாதை அல்ல! செல்லுபடியாகும் பாதையில் '<> | "?*:' அல்லது பின்வரும் சாதன பெயர்களில் ஒன்று இருக்கக்கூடாது: COM1-COM9, LPT1-LPT9, PRN, AUX, CON, NUL, கடிகை $

source: This method covers the case when you have made one or more revisions to a branch (or to the trunk) and you want to port those changes across to a different branch.
ta_in: நீங்கள் ஒரு கிளைக்கு (அல்லது உடற்பகுதிக்கு) ஒன்று அல்லது அதற்கு மேற்பட்ட திருத்தங்களைச் செய்தபோது இந்த முறை வழக்கை உள்ளடக்கியது, மேலும் அந்த மாற்றங்களை வேறு கிளைக்கு அனுப்ப விரும்புகிறீர்கள்.

source: This method covers the case when you want to merge the differences of two different branches into your working copy.
ta_in: இரண்டு வெவ்வேறு கிளைகளின் வேறுபாடுகளை உங்கள் வேலை நகலில் ஒன்றிணைக்க விரும்பும் போது இந்த முறை வழக்கை உள்ளடக்கியது.

source: This product includes software developed by the OpenSSL Project for use in the OpenSSL Toolkit (https://www.openssl.org/)
ta_in: இந்த தயாரிப்பில் OpenSSL கருவித்தொகுப்பில் (https://www.openssl.org/) பயன்படுத்த OpenSSL திட்டத்தால் உருவாக்கப்பட்ட மென்பொருள் அடங்கும்.

source: This product includes software from Apache™ Subversion® (https://subversion.apache.org)
ta_in: இந்த தயாரிப்பில் அப்பாச்சி ™ சப்வர்சன் ® (https://subversion.apache.org) இன் மென்பொருள் அடங்கும்

source: This program is linked to the missing export %Ts in the file %Ts. This machine may have an incompatible version of %Ts.
ta_in: இந்த திட்டம் %TS கோப்பில் காணாமல் போன ஏற்றுமதி %TS உடன் இணைக்கப்பட்டுள்ளது. இந்த இயந்திரத்தில் %TS இன் பொருந்தாத பதிப்பு இருக்கலாம்.

source: This program requires the file %Ts, which was not found on this system.
ta_in: இந்த நிரலுக்கு %TS கோப்பு தேவைப்படுகிறது, இது இந்த அமைப்பில் காணப்படவில்லை.

source: This property is only allowed on folders, not files.
ta_in: இந்த சொத்து கோப்புறைகளில் மட்டுமே அனுமதிக்கப்படுகிறது, கோப்புகள் அல்ல.

source: This property must not have multiple lines. Only one line is allowed.
ta_in: இந்த சொத்தில் பல வரிகள் இருக்கக்கூடாது. ஒரு வரி மட்டுமே அனுமதிக்கப்படுகிறது.

source: This will upgrade your working copy to the new 1.8 format and make it unusable for older clients.
ta_in: இது உங்கள் வேலை நகலை புதிய 1.8 வடிவத்திற்கு மேம்படுத்தி பழைய வாடிக்கையாளர்களுக்கு பயன்படுத்த முடியாததாக மாற்றும்.

source: This working copy has a client-side hook script configured. Do you want this script to run? The command line to run is: %ls
ta_in: இந்த வேலை நகலில் கிளையன்ட் பக்க ஊக் ச்கிரிப்ட் கட்டமைக்கப்பட்டுள்ளது. இந்த ச்கிரிப்ட் இயங்க விரும்புகிறீர்களா? இயக்க கட்டளை வரி: %ls

source: Timeouts
ta_in: நேரம் முடிந்தது

source: Tip
ta_in: உதவிக்குறிப்பு

source: To add projects to be monitored, click the "Add" button above
ta_in: கண்காணிக்க வேண்டிய திட்டங்களைச் சேர்க்க, மேலே உள்ள "சேர்" பொத்தானைக் சொடுக்கு செய்க

source: To commit recursively and work around this error, make sure that all child items of a checked folder are also checked in the commit dialog. Otherwise, TortoiseSVN must do a non-recursive commit which does not allow directory deletion.
ta_in: இந்த பிழையைச் சுற்றி மீண்டும் செய்யவும், வேலை செய்யவும், சரிபார்க்கப்பட்ட கோப்புறையின் அனைத்து குழந்தை பொருட்களும் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் கமிட் உரையாடலிலும் சரிபார்க்கப்படுகின்றன. இல்லையெனில், ஆமை வி.என் ஒரு மறுசீரமைக்காத உறுதிப்பாட்டை செய்ய வேண்டும் இது அடைவு நீக்குவதை அனுமதிக்காது.

source: To steal the lock, right-click on the parent folder of this item and select 'Get Lock' from the context menu. This will bring up the locking dialog where you can enforce the lock, i.e., 'steal' it from the one currently holding it.
ta_in: பூட்டைத் திருட, இந்த உருப்படியின் பெற்றோர் கோப்புறையில் வலது சொடுக்கு செய்து சூழல் மெனுவிலிருந்து 'பூட்டு' என்பதைத் தேர்ந்தெடுக்கவும். இது பூட்டுதலை நீங்கள் செயல்படுத்தக்கூடிய பூட்டுதல் உரையாடலைக் கொண்டு வரும், அதாவது, தற்போது அதை வைத்திருக்கும் ஒன்றிலிருந்து 'திருட'.

source: To:
ta_in: இதற்கு:

source: Top context menu on Windows 11
ta_in: சாளரங்கள் 11 இல் சிறந்த சூழல் பட்டியல்

source: TortoiseBlame
ta_in: ஆமை

source: TortoiseBlame should not be started directly! Use TortoiseProc.exe /command:blame /path:"path\to\file" instead. TortoiseBlame.exe blamefile [logfile [viewtitle]] [/line:linenumber] [/path:originalpath] [/pegrev:peg] [/revrange:text] [/ignoreeol] [/ignorespaces] [/ignoreallspaces]
ta_in: ஆமை பிளேமை நேரடியாக தொடங்கக்கூடாது! பயன்படுத்தவும் ஆமை ப்ரோக். அதற்கு பதிலாக. Adtoiseblame.

source: TortoiseIDiff
ta_in: ஆமை எச்டிஃப்

source: TortoiseIDiff - An image diff tool, part of TortoiseSVN
ta_in: ஆமை எய்டிஃப் - ஒரு பட வேறுபாடு கருவி, ஆமைசிவின் ஒரு பகுதி

source: TortoiseIDiff: the image diff viewer for TortoiseSVN Available command line parameters are: /left:"path to left picture" /lefttitle:"title to show for the left picture" /right:"path to right picture" /righttitle:"title to show for the right picture" /overlay to enable overlay mode /fit to fit the images sizes /showinfo to show the image info boxes
ta_in: ஆமை எய்டிஃப்: ஆமைசிவ்சிற்கான பட வேறுபாடு பார்வையாளர் கிடைக்கக்கூடிய கட்டளை வரி அளவுருக்கள்: /இடது: "இடது படத்திற்கு பாதை" /இடதுசாரி: "இடது படத்தைக் காட்ட தலைப்பு" /வலது: "சரியான படத்திற்கான பாதை" /righttitle: "சரியான படத்தைக் காட்ட தலைப்பு" /மேலடுக்கு பயன்முறையை இயக்க மேலடுக்கு /படங்களின் அளவுகளுக்கு ஏற்றவாறு பொருந்தும் பட செய்தி பெட்டிகளைக் காட்ட /சோஇன்ஃபோ

source: TortoiseMerge
ta_in: ஆமை

source: TortoiseMerge %d.%d.%d, Build %d - %ls, %ls
ta_in: ஆமை %d. %d. %d, உருவாக்கு %d - %ls, %ls

source: TortoiseMerge %d.%d.%d, Build %d - %ls, %ls libsvn_diff %d.%d.%d, %ls apr %d.%d.%d apr-util %d.%d.%d
ta_in: ஆமை %d. %d. %d, உருவாக்கு %d - %ls, %ls libsvn_diff %d. %d. %d, %ls apr%d.%d.%d apr-util%d.%d.%d

source: TortoiseSVN
ta_in: ஆமை

source: TortoiseSVN %d.%d.%d, Build %d - %ls, %ls%ls Subversion %d.%d.%d, %ls apr %d.%d.%d apr-util %d.%d.%d serf %d.%d.%d %ls zlib %ls SQLite %ls
ta_in: ஆமை vn %d. %d. %d, %d - %ls, %ls %ls கீழ்ப்படிதல் %d. %d. %d, %ls apr%d.%d.%d apr-util%d.%d.%d serf%d.%d.%d %ls ச்லிப் %எல்.எச் Sqlite %ls

source: TortoiseSVN Project Monitor
ta_in: ஆமை வி.என் திட்ட மானிட்டர்

source: TortoiseSVN Project Monitor Options
ta_in: ஆமை வி.என் திட்ட கண்காணிப்பு விருப்பங்கள்

source: TortoiseSVN Project Monitor %d new commit in %d project
ta_in: ஆமை வி.என் திட்ட மானிட்டர் %d திட்டத்தில் %d புதிய உறுதிப்பாடு

source: TortoiseSVN Project Monitor %d new commits in %d projects
ta_in: ஆமை வி.என் திட்ட மானிட்டர் %d திட்டங்களில் %d புதிய கமிட்டுகள்

source: TortoiseSVN auto commit: changed externals to fixed revision.
ta_in: ஆமை மற்றும் ஆட்டோ கமிட்: வெளிப்புறங்களை நிலையான திருத்தத்திற்கு மாற்றியது.

source: TortoiseSVN detected a serious slowdown when moving %1!ld! items to the recycle bin. The recycle bin currently contains %2!ld! items, which most likely is the reason for this slowdown. To fix this, you should empty the recycle bin now.
ta_in: %1! எல்.டி. மறுசுழற்சி தொட்டியில் உருப்படிகள். மறுசுழற்சி தொட்டியில் தற்போது %2! LD உள்ளது! உருப்படிகள், இந்த மந்தநிலைக்கு பெரும்பாலும் காரணம். இதை சரிசெய்ய, நீங்கள் இப்போது மறுசுழற்சி தொட்டியை வெறுமை செய்ய வேண்டும்.

source: TortoiseSVN has detected similar filenames. Do you want the files:%ls to be renamed too?
ta_in: ஆமை வி.என் இதே போன்ற கோப்பு பெயர்களைக் கண்டறிந்துள்ளது. நீங்கள் கோப்புகளை விரும்புகிறீர்களா:%ls மறுபெயரிடப்பட வேண்டுமா?

source: TortoiseSVN is a shell extension. That means it is integrated into the Windows explorer. To use TortoiseSVN please open the explorer and right-click on any folder you like to bring up the context menu where you will find all TortoiseSVN commands. And read the manual!
ta_in: ஆமை வி.என் ஒரு செல் நீட்டிப்பு. அதாவது இது சாளரங்கள் எக்ச்ப்ளோரரில் ஒருங்கிணைக்கப்பட்டுள்ளது. ஆமைசிவ்னைப் பயன்படுத்த தயவுசெய்து நீங்கள் விரும்பும் எந்த கோப்புறையிலும் எக்ச்ப்ளோரரைத் திறந்து வலது சொடுக்கு செய்யவும் சூழல் மெனுவைக் கொண்டு வர நீங்கள் அனைத்து ஆமை வி.என் கட்டளைகளையும் காணலாம். கையேட்டைப் படியுங்கள்!

source: TortoiseSVN will not show the following overlays: %ls
ta_in: ஆமை வி.என் பின்வரும் மேலடுக்குகளைக் காட்டாது: %எல்.எச்

source: TortoiseUDiff
ta_in: ஆமை

source: Total commits analyzed:
ta_in: பகுப்பாய்வு செய்யப்பட்ட மொத்த கமிட்டுகள்:

source: Total file changes:
ta_in: மொத்த கோப்பு மாற்றங்கள்:

source: Total number of changes over all cached revisions
ta_in: தற்காலிக சேமிப்பு திருத்தங்கள் மீதும் மொத்த மாற்றங்களின் எண்ணிக்கை

source: Total number of merged revisions
ta_in: இணைக்கப்பட்ட திருத்தங்களின் மொத்த எண்ணிக்கை

source: Total number of user revision properties
ta_in: பயனர் திருத்த பண்புகளின் மொத்த எண்ணிக்கை

source: Tr&ee stripes
ta_in: Tr & ee கோடுகள்

source: Transferring at %ls
ta_in: %Ls இல் மாற்றுகிறது

source: Transparent &color...
ta_in: வெளிப்படையான நிறம் ...

source: Tree conflict
ta_in: மர மோதல்

source: Tree merge
ta_in: மரம் ஒன்றிணைத்தல்

source: Trim right
ta_in: வலதுபுறம் ஒழுங்கமைக்கவும்

source: Trunk nodes
ta_in: தண்டு முனைகள்

source: Try a 'Cleanup'. If that doesn't work you need to do a fresh checkout.
ta_in: 'தூய்மைப்படுத்தும்' முயற்சிக்கவும். அது வேலை செய்யவில்லை என்றால் நீங்கள் ஒரு புதிய புதுப்பித்தலை செய்ய வேண்டும்.

source: Try enabling the "Break write locks" option for the cleanup.
ta_in: தூய்மைப்படுத்துவதற்கான "பிரேக் ரைட் லாக்ச்" விருப்பத்தை இயக்க முயற்சிக்கவும்.

source: Tweak TortoiseSVN
ta_in: ஆமைசிவ்னை மாற்றவும்

source: U&pdate
ta_in: உ & pdate

source: URL
ta_in: முகவரி

source: URL '%s' non-existent in revision %ld
ta_in: முகவரி ' %s' திருத்தத்தில் %எல்.டி.

source: URL history
ta_in: முகவரி வரலாறு

source: URL of Subversion items
ta_in: சப்வர்சன் உருப்படிகளின் முகவரி

source: URL to merge &from
ta_in: ஒன்றிணைக்க முகவரி & இருந்து

source: URLs to TortoiseSvn compare
ta_in: முகவரி கள் ஆமைசிவ்ன் ஒப்பிடுக

source: URLs to view revision for path in webviewer
ta_in: வெப்வியூயரில் பாதைக்கான திருத்தத்தைக் காண முகவரி கள்

source: URLs to view revision in webviewer
ta_in: வெப்வியூவரில் திருத்தத்தைக் காண முகவரி கள்

source: URLs with revision
ta_in: திருத்தத்துடன் முகவரி கள்

source: Un&modified
ta_in: அன் & மாற்றியமைக்கப்பட்ட

source: Un&versioned
ta_in: அன் & பதிப்பு

source: Unable to determine merge source for %ls Please use the main merge dialog.
ta_in: ஒன்றிணைக்கும் மூலத்தை தீர்மானிக்க முடியவில்லை %ls முக்கிய ஒன்றிணைப்பு உரையாடலைப் பயன்படுத்தவும்.

source: Unable to load mail system support.
ta_in: அஞ்சல் கணினி ஆதரவை ஏற்ற முடியவில்லை.

source: Unable to process command, server busy.
ta_in: கட்டளையை செயலாக்க முடியவில்லை, சேவையகம் பிசியாக உள்ளது.

source: Unable to read from %1, it is opened by someone else.
ta_in: %1 இலிருந்து படிக்க முடியவில்லை, இது வேறொருவரால் திறக்கப்படுகிறது.

source: Unable to read write-only property.
ta_in: எழுதும் மட்டும் சொத்தை படிக்க முடியவில்லை.

source: Unable to reconstruct working copy path! This can happen if the file has been renamed. Please start the log dialog on this specific file alone and then revert the changes from the top pane in the log dialog.
ta_in: வேலை செய்யும் நகல் பாதையை புனரமைக்க முடியவில்லை! கோப்பு மறுபெயரிடப்பட்டிருந்தால் இது நிகழலாம். தயவுசெய்து இந்த குறிப்பிட்ட கோப்பில் பதிவு உரையாடலைத் தொடங்கவும், பின்னர் மாற்றங்களை மாற்றவும் பதிவு உரையாடலில் மேல் பலகத்தில் இருந்து.

source: Unable to write read-only property.
ta_in: படிக்க மட்டும் சொத்து எழுத முடியவில்லை.

source: Unable to write to %1, it is read-only or opened by someone else.
ta_in: %1 க்கு எழுத முடியவில்லை, இது வேறு ஒருவரால் படிக்க மட்டுமே அல்லது திறக்கப்படுகிறது.

source: Unchanged node
ta_in: மாறாத முனை

source: Uncheck
ta_in: தேர்வு செய்யுங்கள்

source: Unchecked items are not shown in the top menu but only in the original menu
ta_in: தேர்வு செய்யப்படாத உருப்படிகள் மேல் பட்டியலில் காட்டப்படவில்லை, ஆனால் அசல் பட்டியலில் மட்டுமே

source: Unchecked items are shown in the submenu, checked items on the main context menu
ta_in: தேர்வு செய்யப்படாத உருப்படிகள் துணைமெனுவில் காட்டப்பட்டுள்ளன, முதன்மையான சூழல் பட்டியலில் சரிபார்க்கப்பட்ட உருப்படிகள்

source: Undo
ta_in: செயல்தவிர்

source: Undo Add...
ta_in: சேர்க்கவும் ...

source: Undo the last modifications Undo
ta_in: கடைசி மாற்றங்களை செயல்தவிர்க்கவும் செயல்தவிர்க்கவும்

source: Unexpected file format.
ta_in: எதிர்பாராத கோப்பு வடிவம்.

source: Unformatted Text text without any formatting
ta_in: வடிவமைக்கப்படாத உரை எந்த வடிவமைப்பும் இல்லாமல் உரை

source: Unified &diff of HEAD revisions
ta_in: தலை திருத்தங்களின் ஒருங்கிணைந்த மற்றும் வேறுபாடு

source: Unified Diff
ta_in: ஒருங்கிணைந்த வேறுபாடு

source: Unknown certificate issuer. Fingerprint: %1!ls! Distinguished name: %2!ls!
ta_in: அறியப்படாத சான்றிதழ் வழங்குபவர். கைரேகை: %1! Ls! புகழ்பெற்ற பெயர்: %2! Ls!

source: Unknown depth
ta_in: தெரியாத ஆழம்

source: Unknown failure in SVN::List
ta_in: எச்.வி.என் :: பட்டியலில் தெரியாத தோல்வி

source: Unlock
ta_in: திறக்க

source: Unlock failed
ta_in: திறத்தல் தோல்வியடைந்தது

source: Unlocked
ta_in: திறக்கப்பட்டது

source: Unmark this change
ta_in: இந்த மாற்றத்தை குறிக்கவும்

source: Unrecognized or invalid property file format!
ta_in: அங்கீகரிக்கப்படாத அல்லது தவறான சொத்து கோப்பு வடிவம்!

source: Unresolved conflicts!
ta_in: தீர்க்கப்படாத மோதல்கள்!

source: Unshelve
ta_in: செல்வ்

source: Unshelve...
ta_in: அன்செல்வ் ...

source: Untitled
ta_in: தலைப்பிடப்படாத

source: Unused log caches will only be removed if the respective file is smaller than the given size in kBytes.
ta_in: பயன்படுத்தப்படாத பதிவு தற்காலிக சேமிப்புகள் அந்தந்தால் மட்டுமே அகற்றப்படும் KBytes இல் கொடுக்கப்பட்ட அளவை விட கோப்பு சிறியது.

source: Unversion
ta_in: மறைத்தல்

source: Unversion and add to &ignore list
ta_in: மாற்றியமைத்தல் மற்றும் புறக்கணிப்பு பட்டியலில் சேர்க்கவும்

source: Unversion working copy
ta_in: Undersion வேலை நகல்

source: Unversioned
ta_in: மாற்றப்பட்ட

source: Unversioned files mark parent folder as modified
ta_in: மாற்றப்பட்ட கோப்புகள் மாற்றியமைக்கப்பட்டபடி பெற்றோர் கோப்புறையைக் குறிக்கின்றன

source: Unversioning %1!ls!
ta_in: %1! Ls ஐ மாற்றுதல்!

source: Up one folder
ta_in: ஒரு கோப்புறை வரை

source: Update
ta_in: புதுப்பிப்பு

source: Update Depth
ta_in: ஆழத்தைப் புதுப்பிக்கவும்

source: Update WC to revision
ta_in: திருத்தத்திற்கு WC ஐப் புதுப்பிக்கவும்

source: Update check is currently running!
ta_in: புதுப்பிப்பு சோதனை தற்போது இயங்குகிறது!

source: Update externals
ta_in: வெளிப்புறங்களைப் புதுப்பிக்கவும்

source: Updated
ta_in: புதுப்பிக்கப்பட்டது

source: Updates all monitored working copies
ta_in: கண்காணிக்கப்பட்ட அனைத்து வேலை நகல்களையும் புதுப்பிக்கிறது

source: Updates the working copy to a specific revision
ta_in: வேலை நகலை ஒரு குறிப்பிட்ட திருத்தத்திற்கு புதுப்பிக்கிறது
