Repository: nbyzh/SVN
Catalog: Languages/*/TortoiseUI.po
Languages: ta_in

source: Merged revision(s) {revrange} from {mergeurl}:
ta_in: {Mergeurl இருந்து இலிருந்து ஒன்றிணைக்கப்பட்ட திருத்தம் (கள்) {retrange}:

source: Merges all missing revisions from trunk into the working copy of a feature branch using merge-tracking information
ta_in: ஒன்றிணைக்கும்-கண்காணிப்பு தகவல்களைப் பயன்படுத்தி ஒரு அம்சக் கிளையின் வேலை நகலில் டிரங்கிலிருந்து காணாமல் போன அனைத்து திருத்தங்களையும் ஒன்றிணைக்கிறது

source: Merging
ta_in: ஒன்றிணைத்தல்

source: Merging %1!ls! into %2!ls!, %3!ls!%4!ls!
ta_in: இணைத்தல் %1! Ls! %2! LS !, %3! LS! %4! LS!

source: Merging differences between repository URLs
ta_in: களஞ்சிய முகவரி களுக்கு இடையிலான வேறுபாடுகளை ஒன்றிணைத்தல்

source: Merging from %1!ls!, revision %2!ls! to %3!ls!, revision %4!ls! into %5!ls!, %6!ls!%7!ls!%8!ls!
ta_in: %1! LS !, திருத்தம் %2! LS! பெறுநர் %3! ls !, திருத்தம் %4! ls! %5! LS !, %6! LS! %7! LS! %8! LS!

source: Merging r%1!ld! through r%2!ld!
ta_in: R%1! LD ஐ இணைத்தல்! r%2! ld!

source: Merging r%ld
ta_in: R%ld ஐ இணைத்தல்

source: Merging revisions %1!ls! of %2!ls! into %3!ls!, %4!ls!%5!ls!%6!ls!
ta_in: திருத்தங்களை ஒன்றிணைத்தல் %1! Ls! of %2! ls! %3! LS !, %4! LS! %5! LS! %6! LS!

source: Message
ta_in: செய்தி

source: Message &label:
ta_in: செய்தி & லேபிள்:

source: Message &pattern:
ta_in: செய்தி & முறை:

source: Message part &expression:
ta_in: செய்தி பகுதி & வெளிப்பாடு:

source: Message:
ta_in: செய்தி:

source: Messages
ta_in: செய்திகள்

source: Mime type
ta_in: மைம் வகை

source: Min
ta_in: மணித்துளி

source: Mine
ta_in: என்னுடையது

source: Minimum number of chars for a commit message:
ta_in: ஒரு கமிட் செய்திக்கான குறைந்தபட்ச எழுத்துக்களின் எண்ணிக்கை:

source: Minimum number of chars for a lock message:
ta_in: பூட்டு செய்திக்கான குறைந்தபட்ச எழுத்துக்களின் எண்ணிக்கை:

source: Misc
ta_in: இதர

source: Mixed
ta_in: கலப்பு

source: Modification date
ta_in: மாற்றும் தேதி

source: Modified
ta_in: மாற்றியமைக்கப்பட்ட

source: Modified node
ta_in: மாற்றியமைக்கப்பட்ட முனை

source: Monitor interval in minutes:
ta_in: நிமிடங்களில் இடைவெளியைக் கண்காணிக்கவும்:

source: More colors...
ta_in: மேலும் வண்ணங்கள் ...

source: More than one item dropped.
ta_in: ஒன்றுக்கு மேற்பட்ட உருப்படிகள் கைவிடப்பட்டன.

source: More...
ta_in: மேலும்...

source: Most active author:
ta_in: மிகவும் செயலில் உள்ள ஆசிரியர்:

source: Move %1!ld! items to %2!ls!
ta_in: %1! LD ஐ நகர்த்தவும்! உருப்படிகள் %2! Ls!

source: Move %1!ls! to %2!ls!
ta_in: %1! Ls ஐ நகர்த்தவும்! பெறுநர் %2! ls!

source: Move and add The file is moved to the destination and added to version control.
ta_in: நகர்ந்து சேர்க்கவும் கோப்பு இலக்குக்கு நகர்த்தப்பட்டு பதிப்பு கட்டுப்பாட்டில் சேர்க்கப்பட்டுள்ளது.

source: Move and rename
ta_in: நகர்த்தவும் மறுபெயரிடவும்

source: Move and rename item to here
ta_in: உருப்படியை இங்கே நகர்த்தவும் மறுபெயரிடவும்

source: Move broken
ta_in: உடைந்த நகர்த்தல்

source: Move items to here
ta_in: பொருட்களை இங்கே நகர்த்தவும்

source: Move special file or directory
ta_in: சிறப்பு கோப்பு அல்லது கோப்பகத்தை நகர்த்தவும்

source: Move to %1
ta_in: %1 க்கு நகர்த்தவும்

source: Move to changelist
ta_in: சேஞ்சலிச்டுக்கு செல்லுங்கள்

source: Move-Replaced
ta_in: நகரும்-மாற்றப்பட்டது

source: Move/Rename
ta_in: நகர்த்தவும்/மறுபெயரிடவும்

source: Move: New name for %ls
ta_in: நகர்த்து: %LS க்கு புதிய பெயர்

source: Move The file is moved to the destination and left unversioned.
ta_in: நகர்வு கோப்பு இலக்குக்கு நகர்த்தப்பட்டு மாற்றாமல் விடப்படுகிறது.

source: Move The items are moved to the target path.
ta_in: நகர்வு உருப்படிகள் இலக்கு பாதைக்கு நகர்த்தப்படுகின்றன.

source: Moved
ta_in: நகர்த்தப்பட்டது

source: Moved from %ls
ta_in: இருந்து நகர்த்தப்பட்டது %ls

source: Moved to %ls
ta_in: நகர்த்தப்பட்டது %ls

source: Moves the modified files to the recycle bin first before reverting
ta_in: மாற்றியமைக்கப்பட்ட கோப்புகளை மாற்றுவதற்கு முன் முதலில் மறுசுழற்சி தொட்டியில் நகர்த்துகிறது

source: Moving %1!ls!
ta_in: நகரும் %1! Ls!

source: Moving...
ta_in: நகரும் ...

source: Multiple, &independent working copies
ta_in: பல, மற்றும் சுயாதீனமான வேலை பிரதிகள்

source: My file:
ta_in: எனது கோப்பு:

source: NI
ta_in: நி

source: NUM
ta_in: எண்

source: Name:
ta_in: பெயர்:

source: Navigate
ta_in: செல்லவும்

source: Navigate to a specific line in the view Goto Line
ta_in: பார்வையில் ஒரு குறிப்பிட்ட வரிக்கு செல்லவும் கோட்டோ வரி

source: Needs-&Lock
ta_in: தேவைகள்- & பூட்டு

source: Needs-lock
ta_in: தேவை-பூட்டு

source: Neither /path nor /pathfile was specified or does not contain a valid path!
ta_in: /பாதை அல்லது /பாத்ஃபைல் குறிப்பிடப்படவில்லை அல்லது சரியான பாதையைக் கொண்டிருக்கவில்லை!

source: Nested
ta_in: கூடு

source: Network
ta_in: பிணையம்

source: Never try to contact the repository again
ta_in: மீண்டும் களஞ்சியத்தை தொடர்பு கொள்ள முயற்சிக்காதீர்கள்

source: New
ta_in: புதிய

source: New &name:
ta_in: புதிய & பெயர்:

source: New branch/tag is not ready yet, retrying switch...
ta_in: புதிய கிளை/குறிச்சொல் இன்னும் தயாராக இல்லை, சுவிட்சை மீண்டும் முயற்சிக்கிறது ...

source: New name must not be empty or the same as the original name!
ta_in: புதிய பெயர் காலியாக இருக்கக்கூடாது அல்லது அசல் பெயரைப் போலவே இருக்கக்கூடாது!

source: Newlines
ta_in: புதிய லைன்ச்

source: Next conflict
ta_in: அடுத்த மோதல்

source: Next difference
ta_in: அடுத்த வேறுபாடு

source: Next inline difference
ta_in: அடுத்த இன்லைன் வேறுபாடு

source: No command specified! TortoiseProc.exe is used by the Shell extension and should not be called directly!
ta_in: கட்டளை குறிப்பிடப்படவில்லை! Doiriseproc.exe செல் நீட்டிப்பால் பயன்படுத்தப்படுகிறது, மேலும் அவை நேரடியாக அழைக்கப்படக்கூடாது!

source: No differences found!
ta_in: வேறுபாடுகள் எதுவும் கிடைக்கவில்லை!

source: No error message is available.
ta_in: பிழை செய்தி எதுவும் கிடைக்கவில்லை.

source: No error occurred.
ta_in: பிழை எதுவும் ஏற்படவில்லை.

source: No externals found
ta_in: வெளிப்புறங்கள் எதுவும் கிடைக்கவில்லை

source: No externals: For URLs, no externals are gathered. If you want to tag externals, start the command directly from a working copy.
ta_in: வெளிப்புறங்கள் இல்லை: முகவரி களுக்கு, வெளிப்புறங்கள் எதுவும் சேகரிக்கப்படவில்லை. நீங்கள் வெளிப்புறங்களைக் குறிக்க விரும்பினால், கட்டளையை நேரடியாக வேலை செய்யும் நகலிலிருந்து தொடங்கவும்.

source: No files to show with the current setting. Check one or more settings below to see unversioned, ignored and/or unmodified files. To see remote changes, click on 'Check Repository'
ta_in: தற்போதைய அமைப்பைக் காண்பிக்க கோப்புகள் இல்லை. மாற்றப்படாத, புறக்கணிக்கப்பட்ட மற்றும்/அல்லது மாற்றப்படாத கோப்புகளைக் காண கீழே ஒன்று அல்லது அதற்கு மேற்பட்ட அமைப்புகளைச் சரிபார்க்கவும். தொலை மாற்றங்களைக் காண, 'களஞ்சியத்தை சரிபார்க்கவும்' என்பதைக் சொடுக்கு செய்க

source: No files were changed or added since the last commit. There's nothing for TortoiseSVN to do here... You can show the unversioned items by enabling them with the checkbox at the bottom.
ta_in: கடைசி உறுதிப்பாட்டிலிருந்து கோப்புகள் எதுவும் மாற்றப்படவில்லை அல்லது சேர்க்கப்படவில்லை. ஆமைசிவ்ன் இங்கே செய்ய எதுவும் இல்லை ... மாற்றப்படாத உருப்படிகளை இயக்குவதன் மூலம் அவற்றைக் காட்டலாம் கீழே உள்ள தேர்வுப்பெட்டியுடன்.

source: No files were changed or added since the last commit. There's nothing for TortoiseSVN to do here...
ta_in: கோப்புகள் எதுவும் மாற்றப்படவில்லை அல்லது சேர்க்கப்படவில்லை கடைசி கமிட். ஒன்றுமில்லை ஆமைசிவ்ன் இங்கே செய்ய ...

source: No filter
ta_in: வடிகட்டி இல்லை

source: No graph available
ta_in: வரைபடம் எதுவும் கிடைக்கவில்லை

source: No image encoder found for %ls.
ta_in: %LS க்கு எந்த பட குறியாக்கி கிடைக்கவில்லை.

source: No path or pathfile specified on the command line!
ta_in: கட்டளை வரியில் எந்த பாதையும் பாதையும் குறிப்பிடப்படவில்லை!

source: No path was shelved.
ta_in: எந்த பாதையும் நிறுத்தப்படவில்லை.

source: No status cache. Only versioned folders get an overlay, files don't get an overlay
ta_in: நிலை கேச் இல்லை. பதிப்பு செய்யப்பட்ட கோப்புறைகள் மட்டுமே மேலடுக்கு கிடைக்கும், கோப்புகளுக்கு மேலடுக்கு கிடைக்காது

source: No such revision '%1!ls!'
ta_in: அத்தகைய திருத்தம் இல்லை '%1! Ls!'

source: Node Status:
ta_in: முனை நிலை:

source: Node colors
ta_in: முனை வண்ணங்கள்

source: Non-recursive commit of moved/renamed folders.
ta_in: நகர்த்தப்படாத/மறுபெயரிடப்பட்ட கோப்புறைகளின் இரகசியமற்ற கமிட்.

source: Non-versioned
ta_in: மாற்றப்படாத

source: None
ta_in: எதுவுமில்லை

source: Normal
ta_in: சாதாரண

source: Not all of the system registry entries (or INI file) were removed.
ta_in: கணினி பதிவு உள்ளீடுகள் (அல்லது ஐ.என்.ஐ கோப்பு) அனைத்தும் அகற்றப்படவில்லை.

source: Not enough memory! Try reducing the size of the revision graph by either collapsing nodes or reducing the zoom factor.
ta_in: போதுமான சேமிப்பிடம் இல்லை! திருத்த வரைபடத்தின் அளவைக் குறைக்க முயற்சிக்கவும் முனைகளை சட்டை அல்லது சூம் காரணியைக் குறைத்தல்.

source: Not under version control
ta_in: பதிப்பு கட்டுப்பாட்டின் கீழ் இல்லை

source: Note that if you choose to recover the auto-saved documents, you must explicitly save them to overwrite the original documents. If you choose to not recover the auto-saved versions, they will be deleted.
ta_in: தானாக சேமிக்கப்பட்ட ஆவணங்களை மீட்டெடுக்க நீங்கள் தேர்வுசெய்தால், அசல் ஆவணங்களை மேலெழுத அவற்றை வெளிப்படையாக சேமிக்க வேண்டும் என்பதை நினைவில் கொள்க. தானாக சேமிக்கப்பட்ட பதிப்புகளை மீட்டெடுக்க நீங்கள் தேர்வுசெய்தால், அவை நீக்கப்படும்.

source: Note: the folder contains unversioned items
ta_in: குறிப்பு: கோப்புறையில் மாற்றப்படாத உருப்படிகள் உள்ளன

source: Note: this affects all Tortoise clients, not just TortoiseSVN!
ta_in: குறிப்பு: இது ஆமை வாடிக்கையாளர்களை பாதிக்கிறது, ஆமை வி.என் மட்டுமல்ல!

source: Note: this property has no effect on Windows
ta_in: குறிப்பு: இந்த சொத்து சாளரங்களில் எந்த விளைவையும் ஏற்படுத்தாது

source: Nothing is selected for commit!
ta_in: உறுதிப்பாட்டிற்கு எதுவும் தேர்ந்தெடுக்கப்படவில்லை!

source: Nothing is shelved!
ta_in: எதுவும் நிறுத்தப்படவில்லை!

source: Notice
ta_in: அறிவிப்பு

source: Number of %ls:
ta_in: %LS இன் எண்ணிக்கை:

source: Number of authors in the cache
ta_in: தற்காலிக சேமிப்பில் ஆசிரியர்களின் எண்ணிக்கை

source: Number of authors:
ta_in: ஆசிரியர்களின் எண்ணிக்கை:

source: Number of cached merged revisions
ta_in: தற்காலிக சேமிக்கப்பட்ட திருத்தங்களின் எண்ணிக்கை

source: Number of cached revisions
ta_in: தற்காலிக சேமிப்பு திருத்தங்களின் எண்ணிக்கை

source: Number of cached revisions that have a non-empty change list
ta_in: காலியாக இல்லாத மாற்ற பட்டியலைக் கொண்ட தற்காலிக சேமிப்பு திருத்தங்களின் எண்ணிக்கை

source: Number of cached revisions that have user revision properties
ta_in: பயனர் திருத்த பண்புகளைக் கொண்ட தற்காலிக சேமிப்பு திருத்தங்களின் எண்ணிக்கை

source: Number of cached revisions whose change list is not cached yet
ta_in: தற்காலிகமாக சேமிக்கப்பட்ட திருத்தங்களின் எண்ணிக்கை, அதன் மாற்ற பட்டியல் இன்னும் தற்காலிகமாக சேமிக்கப்படவில்லை

source: Number of cached revisions whose user revision properties are not cached yet
ta_in: பயனர் திருத்த பண்புகள் இன்னும் தற்காலிகமாக சேமிக்கப்படாத தற்காலிக சேமிப்பு திருத்தங்களின் எண்ணிக்கை

source: Number of different paths shown in the log dialog, including parent paths
ta_in: பெற்றோர் பாதைகள் உட்பட பதிவு உரையாடலில் காட்டப்பட்டுள்ள வெவ்வேறு பாதைகளின் எண்ணிக்கை

source: Number of different words used in log messages
ta_in: பதிவு செய்திகளில் பயன்படுத்தப்படும் வெவ்வேறு சொற்களின் எண்ணிக்கை

source: Number of merged revisions that are not cached yet
ta_in: இன்னும் தற்காலிக சேமிப்பு செய்யப்படாத இணைக்கப்பட்ட திருத்தங்களின் எண்ணிக்கை

source: Number of path elements. A path element is a folder or file name like 'foo.txt' or 'mybranch'.
ta_in: பாதை கூறுகளின் எண்ணிக்கை. ஒரு பாதை உறுப்பு என்பது 'foo.txt' அல்லது 'MyBranch' போன்ற கோப்புறை அல்லது கோப்பு பெயர்.

source: Number of times a log cache can fail to close properly due to crashes etc. until it gets deleted automatically.
ta_in: ஒரு பதிவு தற்காலிக சேமிப்பு எத்தனை முறை சரியாக மூடத் தவறிவிடும் விபத்துக்கள் காரணமாக அது தானாக நீக்கப்படும் வரை.

source: Number of weeks:
ta_in: வாரங்களின் எண்ணிக்கை:

source: O&ptions
ta_in: விருப்பங்கள்

source: OK
ta_in: சரி

source: OVR
ta_in: ஒவிஆர்

source: Older lines
ta_in: பழைய கோடுகள்

source: Oldest on to&p
ta_in: மேலே பழமையானது

source: Omit e&xternals
ta_in: இ & Xternals ஐ தவிர்க்கவும்

source: Omit externals
ta_in: வெளிப்புறங்களை தவிர்க்கவும்

source: One of the paths you are attempting to move appears to be a special path (one of 'branches', 'tags' or 'trunk').
ta_in: நீங்கள் நகர்த்த முயற்சிக்கும் பாதைகளில் ஒன்று ஒரு சிறப்பு பாதையாகத் தோன்றுகிறது ('கிளைகள்', 'குறிச்சொற்கள்' அல்லது 'தண்டு' ஒன்று).

source: One or more auto-saved documents were found.
ta_in: ஒன்று அல்லது அதற்கு மேற்பட்ட தானாக சேமிக்கப்பட்ட ஆவணங்கள் காணப்பட்டன.

source: One or more files are in a conflicted state.
ta_in: ஒன்று அல்லது அதற்கு மேற்பட்ட கோப்புகள் முரண்பட்ட நிலையில் உள்ளன.

source: One or more paths could not be shelved. The following paths failed: %s
ta_in: ஒன்று அல்லது அதற்கு மேற்பட்ட பாதைகளை நிறுத்த முடியவில்லை. பின்வரும் பாதைகள் தோல்வியடைந்தன: %s

source: One project has updates:
ta_in: ஒரு திட்டத்திற்கு புதுப்பிப்புகள் உள்ளன:

source: Onl&y record the merge (block revisions from getting merged)
ta_in: ONL & ஒய் ஒன்றிணைப்பைப் பதிவுசெய்க (ஒன்றிணைக்கப்படுவதிலிருந்து தொகுதி திருத்தங்கள்)

source: Only file children
ta_in: குழந்தைகளை மட்டுமே தாக்கல் செய்யுங்கள்

source: Only numbers (optionally separated by commas) are allowed!
ta_in: எண்கள் மட்டுமே (விருப்பமாக காற்புள்ளிகளால் பிரிக்கப்படுகின்றன) அனுமதிக்கப்படுகிறது!

source: Only properties changed
ta_in: பண்புகள் மட்டுமே மாற்றப்பட்டன

source: Only this item
ta_in: இந்த உருப்படி மட்டுமே

source: Only use s&pellchecker when tsvn:projectlanguage is set
ta_in: TSVN: ProjectLanguage அமைக்கப்படும்போது S & PELLCHECKER ஐ மட்டுமே பயன்படுத்தவும்

source: Opacity
ta_in: ஒளிபுகாநிலை

source: Open
ta_in: திற

source: Open &local
ta_in: திறந்த & உள்ளக

source: Open &with local...
ta_in: திறந்த & உள்ளக ...

source: Open client certificate file
ta_in: கிளையன்ட் சான்றிதழ் கோப்பைத் திறக்கவும்

source: Open files for diff or to apply a patch Open files
ta_in: வேறுபாட்டிற்கான கோப்புகளைத் திறக்கவும் அல்லது ஒரு பேட்சைப் பயன்படுத்தவும் கோப்புகளைத் திறக்கவும்

source: Open from clipboard
ta_in: கிளிப்போர்டில் இருந்து திறக்கவும்

source: Open image file...
ta_in: படக் கோப்பைத் திறக்கவும் ...

source: Open multiple &local...
ta_in: பல & உள்ளக திறக்க ...

source: Open parent folder
ta_in: திறந்த பெற்றோர் கோப்புறை

source: Open repository &Url
ta_in: திறந்த களஞ்சியம் & முகவரி

source: Open with...
ta_in: உடன் திறந்திருக்கும் ...

source: Open working copy in &explorer
ta_in: & எக்ச்ப்ளோரரில் வேலை நகல்

source: Opens Help Help Topics
ta_in: உதவியைத் திறக்கிறது தலைப்புகளுக்கு உதவுங்கள்

source: Opens the repository browser to tweak the repository online
ta_in: களஞ்சியத்தை ஆன்லைனில் மாற்றுவதற்கு களஞ்சிய உலாவியைத் திறக்கிறது

source: Operate from log cache for now only
ta_in: இப்போது பதிவு தற்காலிக சேமிப்பிலிருந்து மட்டுமே செயல்படுங்கள்

source: Operative
ta_in: செயல்பாட்டு

source: Option
ta_in: விருப்பம்

source: Ori&ginal size (S)
ta_in: ஓரி & சினல் அளவு (கள்)

source: Others
ta_in: வேறு

source: Out of memory.
ta_in: நினைவகத்திற்கு வெளியே.

source: Overlay Handlers
ta_in: மேலடுக்கு கையாளுபவர்கள்

source: Overlays
ta_in: மேலடுக்குகள்

source: Override the svn:eol-style property setting. Files which don't have this property set are not affected.
ta_in: எச்.வி.என்: ஈல்-பாணி சொத்து அமைப்பை மீறவும். இந்த சொத்து தொகுப்பு இல்லாத கோப்புகள் பாதிக்கப்படவில்லை.

source: Overwrite The settings are overwritten
ta_in: மேலெழுதும் அமைப்புகள் மேலெழுதப்பட்டுள்ளன

source: PC
ta_in: பிசி

source: PD
ta_in: பி.டி.

source: POPUP
ta_in: பாப் அப்

source: Page %u
ta_in: பக்கம் %u

source: Page %u Pages %u-%u
ta_in: பக்கம் %u பக்கங்கள் %u- %u

source: Page :
ta_in: பக்கம் :

source: Parameters
ta_in: அளவுருக்கள்

source: Parameters:
ta_in: அளவுருக்கள்:

source: Password
ta_in: கடவுச்சொல்

source: Password is wrong
ta_in: கடவுச்சொல் தவறு

source: Password/phrase
ta_in: கடவுச்சொல்/சொற்றொடர்

source: Password:
ta_in: கடவுச்சொல்:

source: Paste
ta_in: ஒட்டு

source: Paste filename list
ta_in: பேச்ட் கோப்பு பெயர் பட்டியல்

source: Pastes the svn path from the clipboard, resulting in a move (cut) or copy operation
ta_in: கிளிப்போர்டிலிருந்து எச்.வி.என் பாதையை ஒட்டுகிறது, இதன் விளைவாக ஒரு நகர்வு (வெட்டு) அல்லது நகல் செயல்பாடு

source: Patch &all items
ta_in: எல்லா பொருட்களையும் இணைக்கவும்

source: Patch &selected item
ta_in: ஒட்டு தேர்ந்தெடுக்கப்பட்ட உருப்படி

source: Patch all files
ta_in: எல்லா கோப்புகளையும் இணைக்கவும்

source: Patch selected files
ta_in: ஒட்டு தேர்ந்தெடுக்கப்பட்ட கோப்புகள்

source: Patchfiles (*.diff, *.patch)|*.diff;*.patch|All (*.*)|*.*||
ta_in: பேட்ச்ஃபைல்கள் (*.டிஃப்,*.பாட்ச்) |*.டிஃப்;*. ஒட்டு | அனைத்தும் (*.*) |*.*||

source: Patching
ta_in: ஒட்டுதல்

source: Patching file '%1!ls!'
ta_in: ஒட்டுதல் கோப்பு '%1! Ls!'

source: Path
ta_in: பாதை

source: Path found that matches the patch better.
ta_in: பாதையை சிறப்பாக பொருத்துகிறது.

source: Path or URL:
ta_in: பாதை அல்லது URL:

source: Path:
ta_in: பாதை:

source: Paths
ta_in: பாதைகள்

source: Paths relative to root
ta_in: வேருடன் தொடர்புடைய பாதைகள்

source: Peg
ta_in: பெக்

source: Percent of authorship
ta_in: படைப்புரிமையின் விழுக்காடு

source: Percents
ta_in: விழுக்காடுகள்

source: Picture (Metafile) a picture
ta_in: படம் (மெட்டாஃபைல்) ஒரு படம்

source: Pictures (*.svg, *.wmf, *.jpg, *.png, *.bmp, *.gif, *.webp)|*.svg;*.wmf;*.jpg;*.jpeg;*.png;*.bmp;*.gif;*.webp|All (*.*)|*.*||
ta_in: படங்கள் (. ;*. bmp;*. gif;*. Webp | அனைத்தும் (*.*) |*.*||

source: Pie Graph
ta_in: பை வரைபடம்

source: Please enter a hook script to execute.
ta_in: செயல்படுத்த ஒரு ஊக் ச்கிரிப்டை உள்ளிடவும்.

source: Please enter a path where to apply the hook script to.
ta_in: ஊக் ச்கிரிப்டைப் பயன்படுத்த வேண்டிய பாதையை உள்ளிடவும்.

source: Please execute the 'Cleanup' command.
ta_in: 'தூய்மைப்படுத்தும்' கட்டளையை இயக்கவும்.

source: Please note: Your working copy remains on the previous path. If you want your next changes to be committed to the copy or branch you have just created, then you need to switch your working copy over to the new URL. Use the Switch command to do that.
ta_in: தயவுசெய்து கவனிக்கவும்: உங்கள் வேலை நகல் முந்தைய பாதையில் உள்ளது. உங்கள் அடுத்த மாற்றங்களை நீங்கள் விரும்பினால் நீங்கள் இப்போது உருவாக்கிய நகல் அல்லது கிளைக்கு உறுதியுடன் இருக்க, உங்கள் வேலை நகலை புதிய முகவரி க்கு மாற்ற வேண்டும். அதைச் செய்ய சுவிட்ச் கட்டளையைப் பயன்படுத்தவும்.

source: Please select a hook type
ta_in: ஒரு கொக்கி வகையைத் தேர்ந்தெடுக்கவும்

source: Please wait while cancelling...
ta_in: ரத்து செய்யும்போது காத்திருங்கள் ...

source: Please wait while differences are obtained...
ta_in: வேறுபாடுகள் பெறும்போது தயவுசெய்து காத்திருங்கள் ...

source: Please wait while the externals are gathered...
ta_in: வெளிப்புறங்கள் சேகரிக்கப்படும்போது காத்திருங்கள் ...

source: Please wait while the repository browser is initializing...
ta_in: களஞ்சிய உலாவி துவக்கும்போது தயவுசெய்து காத்திருங்கள் ...

source: Please wait...
ta_in: தயவுசெய்து காத்திருங்கள் ...

source: Port :
ta_in: போர்ட்:

source: Possible values: 0 (fully transparent) .. 255 (opaque)
ta_in: சாத்தியமான மதிப்புகள்: 0 (முழுமையாக வெளிப்படையானது) .. 255 (ஒளிபுகா)

source: Post-Commit Hook
ta_in: பிந்தைய கட்டளை கொக்கி

source: Post-Lock Hook
ta_in: பிந்தைய பூட்டு கொக்கி

source: Post-Update Hook
ta_in: பிந்தைய புதுப்பிப்பு கொக்கி

source: Pre&v Page
ta_in: முன் & வி பக்கம்

source: Pre-Commit Hook
ta_in: முன் கட்டளை கொக்கி

source: Pre-Connect Hook
ta_in: முன் இணைக்கவும்

source: Pre-Lock Hook
ta_in: முன் பூட்டு கொக்கி

source: Pre-Update Hook
ta_in: முன் புதுப்பிப்பு கொக்கி

source: Prepend right block
ta_in: வலது தொகுதி ஆயத்தம்

source: Prepend this block to left
ta_in: இந்த தொகுதியை இடதுபுறமாக ஆயத்தம் செய்யுங்கள்

source: Prevents most cases in which connection lines cross revision nodes
ta_in: இணைப்பு கோடுகள் குறுக்கு திருத்த முனைகளைத் தடுக்கும் பெரும்பாலான நிகழ்வுகளைத் தடுக்கிறது

source: Preview patched file
ta_in: முன்னோட்டம் இணைக்கப்பட்ட கோப்பு

source: Previous conflict
ta_in: முந்தைய மோதல்

source: Previous difference
ta_in: முந்தைய வேறுபாடு

source: Previous inline difference
ta_in: முந்தைய இன்லைன் வேறுபாடு

source: Print to File
ta_in: கோப்பில் அச்சிடு

source: Printer :
ta_in: அச்சுப்பொறி:

source: Printer Files (*.prn)|*.prn|All Files (*.*)|*.*||
ta_in: அச்சுப்பொறி கோப்புகள் (*.prn) |*.prn | அனைத்து கோப்புகளும் (*.*) |*.*||

source: Printing
ta_in: அச்சிடுதல்

source: Proceed anyway
ta_in: எப்படியும் தொடரவும்

source: Proceed with the commit the renamed/moved folders are committed recursively in the repository.
ta_in: உறுதிப்பாட்டுடன் தொடரவும் மறுபெயரிடப்பட்ட/நகர்த்தப்பட்ட கோப்புறைகள் களஞ்சியத்தில் மீண்டும் உறுதியுடன் உள்ளன.

source: Processing revision %1!d! of %2!d!...
ta_in: செயலாக்க திருத்தம் %1! D! of %2! d! ...

source: Program
ta_in: திட்டம்

source: Programs (*.exe)|*.exe|All Files (*.*)|*.*||
ta_in: நிரல்கள் (*.exe) |*.exe | அனைத்து கோப்புகளும் (*.*) |*.*||

source: Progress
ta_in: முன்னேற்றம்

source: Project
ta_in: திட்டம்

source: Properties
ta_in: பண்புகள்

source: Properties (*.svnprops)|*.svnprops|All Files (*.*)|*.*||
ta_in: பண்புகள் (*.svnprops) |*.svnprops | அனைத்து கோப்புகளும் (*.*) |*.*||

source: Properties for
ta_in: பண்புகள்

source: Properties...
ta_in: பண்புகள் ...

source: Property
ta_in: சொத்து

source: Property %1!ls! : Revision %2!ls!
ta_in: சொத்து %1! Ls! : திருத்தம் %2! Ls!

source: Property %1!ls! : Working Base, Revision %2!ld!
ta_in: சொத்து %1! Ls! : வேலை அடிப்படை, திருத்தம் %2! எல்.டி!

source: Property %ls : merged
ta_in: சொத்து %LS: ஒன்றிணைக்கப்பட்டுள்ளது

source: Property %ls : remote
ta_in: சொத்து %LS: ரிமோட்

source: Property %ls : working base
ta_in: சொத்து %எல்.எச்: வேலை அடிப்படை

source: Property %ls : working copy
ta_in: சொத்து %LS: வேலை நகல்

source: Property '%ls' deleted
ta_in: சொத்து '%ls' நீக்கப்பட்டது

source: Property '%ls' set
ta_in: சொத்து '%ls' தொகுப்பு

source: Property Page
ta_in: சொத்து பக்கம்

source: Property Status:
ta_in: சொத்து நிலை:

source: Property diff:
ta_in: சொத்து வேறுபாடு:

source: Property name:
ta_in: சொத்தின் பெயர்:

source: Property status
ta_in: சொத்து நிலை

source: Property value:
ta_in: சொத்து மதிப்பு:

source: Provider
ta_in: வழங்குநர்

source: Provider para&meters:
ta_in: வழங்குநர் பாரா & மீட்டர்:

source: Provider uuid win&32:
ta_in: வழங்குநர் UUID WIN & 32:

source: Provider:
ta_in: வழங்குநர்:

source: Proxy &timeout in seconds:
ta_in: நொடிகளில் பதிலாள் & நேரம் முடிந்தது:

source: Proxy Settings
ta_in: பதிலாள் அமைப்புகள்

source: Put "Get Lock" on top menu when svn:needs-lock is set
ta_in: எச்.வி.என்: தேவைகள்-பூட்டு அமைக்கப்படும் போது மேல் பட்டியலில் "கெட் லாக்" வைக்கவும்

source: Puts all changes you made onto a shelf
ta_in: நீங்கள் செய்த அனைத்து மாற்றங்களையும் ஒரு அலமாரியில் வைக்கிறது

source: Quit the application; prompts to save documents Exit
ta_in: விண்ணப்பத்தை விட்டு வெளியேறவும்; ஆவணங்களை சேமிக்க தூண்டுகிறது வெளியேறு

source: Quit Exit TortoiseMerge without saving the modifications
ta_in: விட்டுவிட மாற்றங்களைச் சேமிக்காமல் ஆமைசேச் வெளியேறவும்

source: R&AM drives
ta_in: ஆர் & ஆம் டிரைவ்கள்

source: R&everse merge
ta_in: ஆர் & எவர்ச் ஒன்றிணைப்பு

source: R&evert to this revision
ta_in: இந்த திருத்தத்திற்கு ஆர் & எவர்ட்

source: RAM [kB]:
ta_in: ராம் [கே.பி.]:

source: REC
ta_in: ரெக்

source: Re&movable drives
ta_in: மறு & நகரக்கூடிய இயக்கிகள்

source: Re&name...
ta_in: மறு & பெயர் ...

source: Re&store defaults
ta_in: Re & Store இயல்புநிலைகள்

source: Re&vert...
ta_in: மறு & வெர்ட் ...

source: Re&vision
ta_in: மறு & பார்வை

source: Read the 'Daily Use Guide' before you are stuck...
ta_in: நீங்கள் சிக்கிக்கொள்வதற்கு முன் 'நாள்தோறும் பயன்பாட்டு வழிகாட்டி' படிக்கவும் ...

source: Realm String
ta_in: சாம்ராச்ய சரம்

source: Recently modified lines
ta_in: அண்மைக் காலத்தில் மாற்றியமைக்கப்பட்ட கோடுகள்

source: Record Only
ta_in: பதிவு மட்டும்

source: Recording mergeinfo for merge between URLs
ta_in: முகவரி களுக்கு இடையில் ஒன்றிணைக்க மெர்சின்ஃபோவை பதிவு செய்தல்
